//
//  XLDictionaryDataType.h
//  C_Protocol
//
//  Created by JY on 14-1-8.
//  Copyright (c) 2014年 XLDZ. All rights reserved.
//

#ifndef C_Protocol_XLDataTypeDic_h
#define C_Protocol_XLDataTypeDic_h
#include "XLDataType.h"

typedef struct COMPLEX_ITEM{
    int datatype;
    char* desc;
}COMPLEX_ITEM;


//数据格式列表枚举
enum typelist {
    
    //秒分时日 星期月 年
    A1 = 0,
    
    //G3 G2 G1 S 123
    A2,
    
    //0 G 0 S 1234567
    A3,
    
    //S0 12
    A4,
    
    //S 123.1 S为符号位 下同
    A5,
    
    //S 12.12
    A6,
    
    //123.1
    A7,
    
    //1234
    A8,
    
    //S 12.1234
    A9,
    
    //123456
    A10,
    
    //123456.12
    A11,
    
    //123456789123
    A12,
    
    //1234.1234
    A13,
    
    //123456.1234
    A14,
    
    //分时日月年
    A15,
    
    //秒分时日
    A16,
    
    //分时日月
    A17,
    
    //分时日
    A18,
    
    //分时
    A19,
    
    //日月年
    A20,
    
    //月年
    A21,
    
    //1.2
    A22,
    
    //12.1234
    A23,
    
    //时日
    A24,
    
    //S 123.123
    A25,
    
    //1.123
    A26,
    
    //12345678
    A27,
    
    //F 度分秒
    A28,
    
    //1字节BIN
    BIN1_29,
    
    //2字节BIN
    BIN2_30,
    
    //3字节BIN
    BIN3_31,
    
    //4字节BIN
    BIN4_32,
    
    //31字节BS
    BS248_33,
    
    //1字节BS
    BS8_34,
    
    //String类型
    STRING_35,
    
    //变长ascii
    V_ASCII_36,
    
    //ascii 32个字节
    ASCII32_37,
    
    //BS 64
    BS64_38,
    
    //ascii 16
    ASCII16_39,
    
    
    //6字节bin
    BIN6_40,
    
    /*
     3字节:
     D7  D6  D5  D4  D3  D2  D1  D0
     Byte1 |   bcd码个位   |   bcd码十分位  |
     
     Byte2 |   bcd码百位   |   bcd码十位    |
     
     Byte3 |   bcd码万位   |   bcd码千位    |
     
     */
    NEW_41,
    
}DATATYPE;


//通讯参数
const COMPLEX_ITEM parameter_data_comm[]=
{
    
    {BIN1_29,"终端数传机延时时间RTS"},
    {BIN1_29,"终端作为启动站允许发送传输延时时间"},
    {BIN2_30,"终端等待从动站响应的超时时间"},
    {BIN2_30,"终端等待从动站相应的重发次数"},
    {BIN1_29,"1类数据自动上报需要确认"},
    {BIN1_29,"2类数据自动上报需要确认"},
    {BIN1_29,"3类数据自动上报需要确认"},
    {BIN1_29,"心跳周期"},
    {BIN1_29,"主站主用IP"},
    {BIN2_30,"主站主用端口"},
    
    
    
    {BIN1_29,"主站备用IP"},
    {BIN2_30,"主站备用端口"},
    {STRING_35,"主站APN"},
    {BIN1_29,"终端IP地址"},
    {BIN1_29,"终端子网掩码"},
    {BIN1_29,"终端网关"},
    {BIN1_29,"终端代理类型"},
    {BIN1_29,"终端代理服务器地址"},
    {BIN2_30,"终端代理服务器端口"},
    {BIN1_29,"终端代理服务器连接方式"},
    
    
    
    {BIN1_29,"终端代理服务器用户名长度"},
    {V_ASCII_36,"终端代理服务器用户名"},
    {BIN1_29,"终端代理服务器密码长度"},
    {V_ASCII_36,"终端代理服务器密码"},
    {BIN2_30,"终端侦听端口"},
    {STRING_35,"虚拟专网用户名"},
    {STRING_35,"虚拟专网密码"},
    {STRING_35,"WIFI SSID"},
    {STRING_35,"WIFI 密码"},
    {STRING_35,"用户名"},
    {STRING_35,"密码"},
};

//测量点参数
const COMPLEX_ITEM  parameter_data_mtr[]=
{
    {BIN2_30,"电压互感器倍率"},
    {BIN2_30,"电流互感器倍率"},
    {A7,"额定电压"},
    {A22,"额定电流"},
    {A23,"额定负荷"},
    {STRING_35,"电源接线方式"},
    {BIN1_29,"单向表接线相"},
    {A7,"电压合格上限"},
    {A7,"电压合格下限"},
    {A7,"电压断相门限"},
    
    
    
    {A7,"电压上上限"},
    {BIN1_29,"过压越限持续时间"},
    {A5,"过压越限恢复系数"},
    {A5,"电压下下限"},
    {BIN1_29,"欠压越限持续时间"},
    {A5,"欠压越限恢复系数"},
    {A25,"相电流上上限"},
    {BIN1_29,"过流越限持续时间"},
    {A5,"过流越限恢复系数"},
    {A25,"相电流上限"},
    
    
    
    
    {BIN1_29,"额定电流越限持续时间"},
    {A5,"额定电流越限恢复系数"},
    {A25,"零序电流上限"},
    {BIN1_29,"零序电流上限越限持续时间"},
    {A5,"零序电流上限越限恢复系数"},
    {A23,"视在功率上上限"},
    {BIN1_29,"视在功率上上限越限持续时间"},
    {A5,"视在功率上上限越限恢复系数"},
    {A23,"视在功率上限"},
    {BIN1_29,"视在功率上限越限持续时间"},
    
    
    {A5,"视在功率上限越限恢复系数"},
    {A5,"三相电压不平衡限值"},
    {BIN1_29,"三相电压不平衡越限持续时间"},
    {A5,"三相电压不平衡越限恢复系数"},
    {A5,"三相电流不平衡限值"},
    {BIN1_29,"三相电流不平衡越限持续时间"},
    {A5,"三相电流不平衡越限恢复系数"},
    {BIN1_29,"连续失压时间限值"},
    {A26,"A相电阻RA"},
    {A26,"A相电抗XA"},
    
    
    
    
    {A26,"A相电导GA"},
    {A26,"A相电纳BA"},
    {A26,"B相电阻RB"},
    {A26,"B相电抗XB"},
    {A26,"B相电导GB"},
    {A26,"B相电纳BB"},
    {A26,"C相电阻RC"},
    {A26,"C相电抗XC"},
    {A26,"C相电导GC"},
    {A26,"C相电纳BC"},
    
    
    
    {A5,"功率因数分段限值1"},
    {A5,"功率因数分段限值2"},
    
};



//终端日统计数据
const COMPLEX_ITEM terminal_day_sta[] =
{
    {A20,"数据时标"},
    
    {BIN2_30,"终端日供电时间"},
    
    {BIN2_30,"终端日复位次数"}
};

//终端月统计数据
const COMPLEX_ITEM terminal_month_sta[] =
{
    {A21,"数据时标"},
    
    {BIN2_30,"终端月供电时间"},
    
    {BIN2_30,"终端月复位次数"}
};


//终端基本实时数据
const COMPLEX_ITEM terminal_rt_basic_sta[] =
{
    {A15,"终端抄表时间"},
    
    {STRING_35,"终端参数状态"},
    
    {BIN4_32,"终端与主站当日通信流量"},
    
    {BIN4_32,"终端与主站当月通信流量"},
    
    {STRING_35,"状态量的状态"},
    
    {STRING_35,"状态量变位标志"},
    
    {BIN1_29,"当前重要事件计数器EC1值"},
    
    {BIN1_29,"当前一般事件计数器EC2值"},
    
    {STRING_35,"当前终端日历时钟"},
    
    {A5,"油温"},
    
    {A5,"A相绕组温度"},
    
    {A5,"B相绕组温度"},
    
    {A5,"C相绕组温度"},
    
    {A5,"剩余寿命"},
};

const COMPLEX_ITEM mtr_rt_basic_sta[] =
{
    {A15,"终端抄表时间"},
    
    {A9,"当前总有功功率"},
    
    {A9,"当前A相有功功率"},
    
    {A9,"当前B相有功功率"},
    
    {A9,"当前C相有功功率"},
    
    
    {A9,"当前总无功功率"},
    
    {A9,"当前A相无功功率"},
    
    {A9,"当前B相无功功率"},
    
    {A9,"当前C相无功功率"},
    
    
    {A5,"当前总功率因数"},
    
    {A5,"当前A相功率因数"},
    
    {A5,"当前B相功率因数"},
    
    {A5,"当前C相功率因数"},
    
    
    {A7,"当前A相电压"},
    
    {A7,"当前B相电压"},
    
    {A7,"当前C相电压"},
    
    
    {A25,"当前A相电流"},
    
    {A25,"当前B相电流"},
    
    {A25,"当前C相电流"},
    
    
    {A25,"当前零序电流"},
    
    
    {A9,"当前总视在功率"},
    
    {A9,"当前A相视在功率"},
    
    {A9,"当前B相视在功率"},
    
    {A9,"当前C相视在功率"},
    
    
    {A5,"A相电压相角"},
    
    {A5,"B相电压相角"},
    
    {A5,"C相电压相角"},
    
    
    {A5,"A相电流相角"},
    
    {A5,"B相电流相角"},
    
    {A5,"C相电流相角"},
    
    {A14,"当前铜损有功总电能示值"},
    
    {A14,"当前铁损有功总电能示值"}
};

const COMPLEX_ITEM rt_power_value_sta[] =
{
    {A15,"终端抄表时间"},
    
    {A14,"当前正向有功总电能示值"},
    
    {A14,"当前费率1正向有功总电能示值"},
    
    {A14,"当前费率2正向有功总电能示值"},
    
    {A14,"当前费率3正向有功总电能示值"},
    
    {A14,"当前费率4正向有功总电能示值"},
    
    
    {A11,"当前正向无功（组合无功1）总电能示值"},
    
    {A11,"当前费率1正向无功（组合无功1）总电能示值"},
    
    {A11,"当前费率2正向无功（组合无功1）总电能示值"},
    
    {A11,"当前费率3正向无功（组合无功1）总电能示值"},
    
    {A11,"当前费率4正向无功（组合无功1）总电能示值"},
    
    
    {A11,"当前一象限无功总电能示值"},
    
    {A11,"当前一象限费率1无功电能示值"},
    
    {A11,"当前一象限费率2无功电能示值"},
    
    {A11,"当前一象限费率3无功电能示值"},
    
    {A11,"当前一象限费率4无功电能示值"},
    
    
    {A11,"当前四象限无功总电能示值"},
    
    {A11,"当前四象限费率1无功电能示值"},
    
    {A11,"当前四象限费率2无功电能示值"},
    
    {A11,"当前四象限费率3无功电能示值"},
    
    {A11,"当前四象限费率4无功电能示值"},
    
    
    {A14,"当前反向有功总电能示值"},
    
    {A14,"当前费率1反向有功总电能示值"},
    
    {A14,"当前费率2反向有功总电能示值"},
    
    {A14,"当前费率3反向有功总电能示值"},
    
    {A14,"当前费率4反向有功总电能示值"},
    
    
    {A11,"当前反向无功（组合无功2）总电能示值"},
    
    {A11,"当前费率1反向无功（组合无功2）总电能示值"},
    
    {A11,"当前费率2反向无功（组合无功2）总电能示值"},
    
    {A11,"当前费率3反向无功（组合无功2）总电能示值"},
    
    {A11,"当前费率4反向无功（组合无功2）总电能示值"},
    
    
    {A11,"当前二象限无功总电能示值"},
    
    {A11,"当前二象限费率1无功电能示值"},
    
    {A11,"当前二象限费率2无功电能示值"},
    
    {A11,"当前二象限费率3无功电能示值"},
    
    {A11,"当前二象限费率4无功电能示值"},
    
    
    {A11,"当前三象限无功总电能示值"},
    
    {A11,"当前三象限费率1无功电能示值"},
    
    {A11,"当前三象限费率2无功电能示值"},
    
    {A11,"当前三象限费率3无功电能示值"},
    
    {A11,"当前三象限费率4无功电能示值"},
};

const COMPLEX_ITEM rt_power_needs_sta[]=
{
    {A15,"终端抄表时间"},
    
    {A23,"当月正向有功总最大需量"},
    
    {A23,"当月正向有功费率1最大需量"},
    
    {A23,"当月正向有功费率2最大需量"},
    
    {A23,"当月正向有功费率3最大需量"},
    
    {A23,"当月正向有功费率4最大需量"},
    
    
    {A17,"当月正向有功总最大需量发生时间"},
    
    {A17,"当月正向有功费率1最大需量发生时间"},
    
    {A17,"当月正向有功费率2最大需量发生时间"},
    
    {A17,"当月正向有功费率3最大需量发生时间"},
    
    {A17,"当月正向有功费率4最大需量发生时间"},
    
    
    {A23,"当月正向无功总最大需量"},
    
    {A23,"当月正向无功费率1最大需量"},
    
    {A23,"当月正向无功费率2最大需量"},
    
    {A23,"当月正向无功费率3最大需量"},
    
    {A23,"当月正向无功费率4最大需量"},
    
    
    {A17,"当月正向无功总最大需量发生时间"},
    
    {A17,"当月正向无功费率1最大需量发生时间"},
    
    {A17,"当月正向无功费率2最大需量发生时间"},
    
    {A17,"当月正向无功费率3最大需量发生时间"},
    
    {A17,"当月正向无功费率4最大需量发生时间"},
    
    
    {A23,"当月反向有功总最大需量"},
    
    {A23,"当月反向有功费率1最大需量"},
    
    {A23,"当月反向有功费率2最大需量"},
    
    {A23,"当月反向有功费率3最大需量"},
    
    {A23,"当月反向有功费率4最大需量"},
    
    
    {A17,"当月反向有功总最大需量发生时间"},
    
    {A17,"当月反向有功费率1最大需量发生时间"},
    
    {A17,"当月反向有功费率2最大需量发生时间"},
    
    {A17,"当月反向有功费率3最大需量发生时间"},
    
    {A17,"当月反向有功费率4最大需量发生时间"},
    
    
    {A23,"当月反向无功总最大需量"},
    
    {A23,"当月反向无功费率1最大需量"},
    
    {A23,"当月反向无功费率2最大需量"},
    
    {A23,"当月反向无功费率3最大需量"},
    
    {A23,"当月反向无功费率4最大需量"},
    
    
    {A17,"当月反向无功总最大需量发生时间"},
    
    {A17,"当月反向无功费率1最大需量发生时间"},
    
    {A17,"当月反向无功费率2最大需量发生时间"},
    
    {A17,"当月反向无功费率3最大需量发生时间"},
    
    {A17,"当月反向无功费率4最大需量发生时间"},
    
};

const COMPLEX_ITEM rt_dc_analog[]=
{
    {A2,"直流模拟量当前数据"}
};

const COMPLEX_ITEM mtr_rt_harmonic[]=
{
    {BIN1_29,"谐波次数"},
    
    {A7,"A相电压2次谐波有效值"},
    
    {A7,"A相电压3次谐波有效值"},
    
    {A7,"A相电压4次谐波有效值"},
    
    {A7,"A相电压5次谐波有效值"},
    
    {A7,"A相电压6次谐波有效值"},
    
    {A7,"A相电压7次谐波有效值"},
    
    {A7,"A相电压8次谐波有效值"},
    
    {A7,"A相电压9次谐波有效值"},
    
    {A7,"A相电压10次谐波有效值"},
    
    {A7,"A相电压11次谐波有效值"},
    
    {A7,"A相电压12次谐波有效值"},
    
    {A7,"A相电压13次谐波有效值"},
    
    {A7,"A相电压14次谐波有效值"},
    
    {A7,"A相电压15次谐波有效值"},
    
    {A7,"A相电压16次谐波有效值"},
    
    {A7,"A相电压17次谐波有效值"},
    
    {A7,"A相电压18次谐波有效值"},
    
    {A7,"A相电压19次谐波有效值"},
    
    
    
    {A7,"B相电压2次谐波有效值"},
    
    {A7,"B相电压3次谐波有效值"},
    
    {A7,"B相电压4次谐波有效值"},
    
    {A7,"B相电压5次谐波有效值"},
    
    {A7,"B相电压6次谐波有效值"},
    
    {A7,"B相电压7次谐波有效值"},
    
    {A7,"B相电压8次谐波有效值"},
    
    {A7,"B相电压9次谐波有效值"},
    
    {A7,"B相电压10次谐波有效值"},
    
    {A7,"B相电压11次谐波有效值"},
    
    {A7,"B相电压12次谐波有效值"},
    
    {A7,"B相电压13次谐波有效值"},
    
    {A7,"B相电压14次谐波有效值"},
    
    {A7,"B相电压15次谐波有效值"},
    
    {A7,"B相电压16次谐波有效值"},
    
    {A7,"B相电压17次谐波有效值"},
    
    {A7,"B相电压18次谐波有效值"},
    
    {A7,"B相电压19次谐波有效值"},
    
    
    
    {A7,"C相电压2次谐波有效值"},
    
    {A7,"C相电压3次谐波有效值"},
    
    {A7,"C相电压4次谐波有效值"},
    
    {A7,"C相电压5次谐波有效值"},
    
    {A7,"C相电压6次谐波有效值"},
    
    {A7,"C相电压7次谐波有效值"},
    
    {A7,"C相电压8次谐波有效值"},
    
    {A7,"C相电压9次谐波有效值"},
    
    {A7,"C相电压10次谐波有效值"},
    
    {A7,"C相电压11次谐波有效值"},
    
    {A7,"C相电压12次谐波有效值"},
    
    {A7,"C相电压13次谐波有效值"},
    
    {A7,"C相电压14次谐波有效值"},
    
    {A7,"C相电压15次谐波有效值"},
    
    {A7,"C相电压16次谐波有效值"},
    
    {A7,"C相电压17次谐波有效值"},
    
    {A7,"C相电压18次谐波有效值"},
    
    {A7,"C相电压19次谐波有效值"},
    
    
    
    {A6,"A相电流2次谐波有效值"},
    
    {A6,"A相电流3次谐波有效值"},
    
    {A6,"A相电流4次谐波有效值"},
    
    {A6,"A相电流5次谐波有效值"},
    
    {A6,"A相电流6次谐波有效值"},
    
    {A6,"A相电流7次谐波有效值"},
    
    {A6,"A相电流8次谐波有效值"},
    
    {A6,"A相电流9次谐波有效值"},
    
    {A6,"A相电流10次谐波有效值"},
    
    {A6,"A相电流11次谐波有效值"},
    
    {A6,"A相电流12次谐波有效值"},
    
    {A6,"A相电流13次谐波有效值"},
    
    {A6,"A相电流14次谐波有效值"},
    
    {A6,"A相电流15次谐波有效值"},
    
    {A6,"A相电流16次谐波有效值"},
    
    {A6,"A相电流17次谐波有效值"},
    
    {A6,"A相电流18次谐波有效值"},
    
    {A6,"A相电流19次谐波有效值"},
    
    
    
    {A6,"B相电流2次谐波有效值"},
    
    {A6,"B相电流3次谐波有效值"},
    
    {A6,"B相电流4次谐波有效值"},
    
    {A6,"B相电流5次谐波有效值"},
    
    {A6,"B相电流6次谐波有效值"},
    
    {A6,"B相电流7次谐波有效值"},
    
    {A6,"B相电流8次谐波有效值"},
    
    {A6,"B相电流9次谐波有效值"},
    
    {A6,"B相电流10次谐波有效值"},
    
    {A6,"B相电流11次谐波有效值"},
    
    {A6,"B相电流12次谐波有效值"},
    
    {A6,"B相电流13次谐波有效值"},
    
    {A6,"B相电流14次谐波有效值"},
    
    {A6,"B相电流15次谐波有效值"},
    
    {A6,"B相电流16次谐波有效值"},
    
    {A6,"B相电流17次谐波有效值"},
    
    {A6,"B相电流18次谐波有效值"},
    
    {A6,"B相电流19次谐波有效值"},
    
    
    
    {A6,"C相电流2次谐波有效值"},
    
    {A6,"C相电流3次谐波有效值"},
    
    {A6,"C相电流4次谐波有效值"},
    
    {A6,"C相电流5次谐波有效值"},
    
    {A6,"C相电流6次谐波有效值"},
    
    {A6,"C相电流7次谐波有效值"},
    
    {A6,"C相电流8次谐波有效值"},
    
    {A6,"C相电流9次谐波有效值"},
    
    {A6,"C相电流10次谐波有效值"},
    
    {A6,"C相电流11次谐波有效值"},
    
    {A6,"C相电流12次谐波有效值"},
    
    {A6,"C相电流13次谐波有效值"},
    
    {A6,"C相电流14次谐波有效值"},
    
    {A6,"C相电流15次谐波有效值"},
    
    {A6,"C相电流16次谐波有效值"},
    
    {A6,"C相电流17次谐波有效值"},
    
    {A6,"C相电流18次谐波有效值"},
    
    {A6,"C相电流19次谐波有效值"},
    
    
    {A5,"当前A相电压总谐波含有率"},
    
    {A5,"当前A相电压2次谐波含有率"},
    
    {A5,"当前A相电压3次谐波含有率"},
    
    {A5,"当前A相电压4次谐波含有率"},
    
    {A5,"当前A相电压5次谐波含有率"},
    
    {A5,"当前A相电压6次谐波含有率"},
    
    {A5,"当前A相电压7次谐波含有率"},
    
    {A5,"当前A相电压8次谐波含有率"},
    
    {A5,"当前A相电压9次谐波含有率"},
    
    {A5,"当前A相电压10次谐波含有率"},
    
    {A5,"当前A相电压11次谐波含有率"},
    
    {A5,"当前A相电压12次谐波含有率"},
    
    {A5,"当前A相电压13次谐波含有率"},
    
    {A5,"当前A相电压14次谐波含有率"},
    
    {A5,"当前A相电压15次谐波含有率"},
    
    {A5,"当前A相电压16次谐波含有率"},
    
    {A5,"当前A相电压17次谐波含有率"},
    
    {A5,"当前A相电压18次谐波含有率"},
    
    {A5,"当前A相电压19次谐波含有率"},
    
    
    
    {A5,"当前B相电压总谐波含有率"},
    
    {A5,"当前B相电压2次谐波含有率"},
    
    {A5,"当前B相电压3次谐波含有率"},
    
    {A5,"当前B相电压4次谐波含有率"},
    
    {A5,"当前B相电压5次谐波含有率"},
    
    {A5,"当前B相电压6次谐波含有率"},
    
    {A5,"当前B相电压7次谐波含有率"},
    
    {A5,"当前B相电压8次谐波含有率"},
    
    {A5,"当前B相电压9次谐波含有率"},
    
    {A5,"当前B相电压10次谐波含有率"},
    
    {A5,"当前B相电压11次谐波含有率"},
    
    {A5,"当前B相电压12次谐波含有率"},
    
    {A5,"当前B相电压13次谐波含有率"},
    
    {A5,"当前B相电压14次谐波含有率"},
    
    {A5,"当前B相电压15次谐波含有率"},
    
    {A5,"当前B相电压16次谐波含有率"},
    
    {A5,"当前B相电压17次谐波含有率"},
    
    {A5,"当前B相电压18次谐波含有率"},
    
    {A5,"当前B相电压19次谐波含有率"},
    
    
    
    {A5,"当前C相电压总谐波含有率"},
    
    {A5,"当前C相电压2次谐波含有率"},
    
    {A5,"当前C相电压3次谐波含有率"},
    
    {A5,"当前C相电压4次谐波含有率"},
    
    {A5,"当前C相电压5次谐波含有率"},
    
    {A5,"当前C相电压6次谐波含有率"},
    
    {A5,"当前C相电压7次谐波含有率"},
    
    {A5,"当前C相电压8次谐波含有率"},
    
    {A5,"当前C相电压9次谐波含有率"},
    
    {A5,"当前C相电压10次谐波含有率"},
    
    {A5,"当前C相电压11次谐波含有率"},
    
    {A5,"当前C相电压12次谐波含有率"},
    
    {A5,"当前C相电压13次谐波含有率"},
    
    {A5,"当前C相电压14次谐波含有率"},
    
    {A5,"当前C相电压15次谐波含有率"},
    
    {A5,"当前C相电压16次谐波含有率"},
    
    {A5,"当前C相电压17次谐波含有率"},
    
    {A5,"当前C相电压18次谐波含有率"},
    
    {A5,"当前C相电压19次谐波含有率"},
    
    
    
    //****************************确认******************************
    
    {A5,"当前A相电流2次谐波含有率"},
    
    {A5,"当前A相电流3次谐波含有率"},
    
    {A5,"当前A相电流4次谐波含有率"},
    
    {A5,"当前A相电流5次谐波含有率"},
    
    {A5,"当前A相电流6次谐波含有率"},
    
    {A5,"当前A相电流7次谐波含有率"},
    
    {A5,"当前A相电流8次谐波含有率"},
    
    {A5,"当前A相电流9次谐波含有率"},
    
    {A5,"当前A相电流10次谐波含有率"},
    
    {A5,"当前A相电流11次谐波含有率"},
    
    {A5,"当前A相电流12次谐波含有率"},
    
    {A5,"当前A相电流13次谐波含有率"},
    
    {A5,"当前A相电流14次谐波含有率"},
    
    {A5,"当前A相电流15次谐波含有率"},
    
    {A5,"当前A相电流16次谐波含有率"},
    
    {A5,"当前A相电流17次谐波含有率"},
    
    {A5,"当前A相电流18次谐波含有率"},
    
    {A5,"当前A相电流19次谐波含有率"},
    
    
    
    
    {A5,"当前B相电流2次谐波含有率"},
    
    {A5,"当前B相电流3次谐波含有率"},
    
    {A5,"当前B相电流4次谐波含有率"},
    
    {A5,"当前B相电流5次谐波含有率"},
    
    {A5,"当前B相电流6次谐波含有率"},
    
    {A5,"当前B相电流7次谐波含有率"},
    
    {A5,"当前B相电流8次谐波含有率"},
    
    {A5,"当前B相电流9次谐波含有率"},
    
    {A5,"当前B相电流10次谐波含有率"},
    
    {A5,"当前B相电流11次谐波含有率"},
    
    {A5,"当前B相电流12次谐波含有率"},
    
    {A5,"当前B相电流13次谐波含有率"},
    
    {A5,"当前B相电流14次谐波含有率"},
    
    {A5,"当前B相电流15次谐波含有率"},
    
    {A5,"当前B相电流16次谐波含有率"},
    
    {A5,"当前B相电流17次谐波含有率"},
    
    {A5,"当前B相电流18次谐波含有率"},
    
    {A5,"当前B相电流19次谐波含有率"},
    
    
    
    
    {A5,"当前C相电流2次谐波含有率"},
    
    {A5,"当前C相电流3次谐波含有率"},
    
    {A5,"当前C相电流4次谐波含有率"},
    
    {A5,"当前C相电流5次谐波含有率"},
    
    {A5,"当前C相电流6次谐波含有率"},
    
    {A5,"当前C相电流7次谐波含有率"},
    
    {A5,"当前C相电流8次谐波含有率"},
    
    {A5,"当前C相电流9次谐波含有率"},
    
    {A5,"当前C相电流10次谐波含有率"},
    
    {A5,"当前C相电流11次谐波含有率"},
    
    {A5,"当前C相电流12次谐波含有率"},
    
    {A5,"当前C相电流13次谐波含有率"},
    
    {A5,"当前C相电流14次谐波含有率"},
    
    {A5,"当前C相电流15次谐波含有率"},
    
    {A5,"当前C相电流16次谐波含有率"},
    
    {A5,"当前C相电流17次谐波含有率"},
    
    {A5,"当前C相电流18次谐波含有率"},
    
    {A5,"当前C相电流19次谐波含有率"},
};





//测量点曲线数据
const COMPLEX_ITEM measure_curve_data[] =
{
    {A15,"日期"},
    
    {BIN1_29,"密度"},
    
    {BIN1_29,"点数"},
    
    {A9,"功率曲线类型"},
    
    {A7,"电压曲线类型"},
    
    {A25,"电流曲线类型"},
    
    {A5,"功率因素曲线"},
    
    {A2,"直流模拟量数据曲线"},
    
    /*chenbaiqing 2014.2.13 增补*/
    {A5,"油温曲线"},
    {A5,"A相绕组温度曲线"},
    {A5,"B相绕组温度曲线"},
    {A5,"C相绕组温度曲线"},
    
    {A5,"负载率曲线"},
    {A5,"电压不平衡曲线"},
    {A5,"电流不平衡曲线"},
};


//直流模拟量日数据
const COMPLEX_ITEM dcanalog_day_data[] =
{
    
    
    {A20,"日数据时标"},
    
    {BIN2_30,"直流模拟量越上限日累计时间"},
    
    {BIN2_30,"直流模拟量越下限日累计时间"},
    
    {A2,"直流模拟量日最大值"},
    
    {A18,"直流模拟量日最大值发生时间"},
    
    {A2,"直流模拟量日最小值"},
    
    {A18,"直流模拟量日最小值发生时间"}
    
};


//直流模拟量月数据
const COMPLEX_ITEM dcanalog_month_data[] =
{
    {A21,"月数据时标"},
    
    {BIN2_30,"直流模拟量越上限月累计时间"},
    
    {BIN2_30,"直流模拟量越下限月累计时间"},
    
    {A2,"直流模拟量月最大值"},
    
    {A18,"直流模拟量月最大值发生时间"},
    
    {A2,"直流模拟量月最小值"},
    
    {A18,"直流模拟量月最小值发生时间"}
};



//测量点日数据——电压谐波数据
const COMPLEX_ITEM daily_data_vharmonic[] =
{
    
    {A20,"日数据时标"},
    
    /*A相2－19次谐波电压含有率日最大值及发生时间*/
    {A5,"A相2次谐波电压含有率日最大值"},
    
    {A17,"A相2次谐波电压含有率日最大值发生时间"},
    
    {A5,"A相3次谐波电压含有率日最大值"},
    
    {A17,"A相3次谐波电压含有率日最大值发生时间"},
    
    {A5,"A相4次谐波电压含有率日最大值"},
    
    {A17,"A相4次谐波电压含有率日最大值发生时间"},
    
    {A5,"A相5次谐波电压含有率日最大值"},
    
    {A17,"A相5次谐波电压含有率日最大值发生时间"},
    
    {A5,"A相6次谐波电压含有率日最大值"},
    
    {A17,"A相6次谐波电压含有率日最大值发生时间"},
    
    {A5,"A相7次谐波电压含有率日最大值"},
    
    {A17,"A相7次谐波电压含有率日最大值发生时间"},
    
    {A5,"A相8次谐波电压含有率日最大值"},
    
    {A17,"A相8次谐波电压含有率日最大值发生时间"},
    
    {A5,"A相9次谐波电压含有率日最大值"},
    
    {A17,"A相9次谐波电压含有率日最大值发生时间"},
    
    {A5,"A相10次谐波电压含有率日最大值"},
    
    {A17,"A相10次谐波电压含有率日最大值发生时间"},
    
    {A5,"A相11次谐波电压含有率日最大值"},
    
    {A17,"A相11次谐波电压含有率日最大值发生时间"},
    
    {A5,"A相12次谐波电压含有率日最大值"},
    
    {A17,"A相12次谐波电压含有率日最大值发生时间"},
    
    {A5,"A相13次谐波电压含有率日最大值"},
    
    {A17,"A相13次谐波电压含有率日最大值发生时间"},
    
    {A5,"A相14次谐波电压含有率日最大值"},
    
    {A17,"A相14次谐波电压含有率日最大值发生时间"},
    
    {A5,"A相15次谐波电压含有率日最大值"},
    
    {A17,"A相15次谐波电压含有率日最大值发生时间"},
    
    {A5,"A相16次谐波电压含有率日最大值"},
    
    {A17,"A相16次谐波电压含有率日最大值发生时间"},
    
    {A5,"A相17次谐波电压含有率日最大值"},
    
    {A17,"A相17次谐波电压含有率日最大值发生时间"},
    
    {A5,"A相18次谐波电压含有率日最大值"},
    
    {A17,"A相18次谐波电压含有率日最大值发生时间"},
    
    {A5,"A相19次谐波电压含有率日最大值"},
    
    {A17,"A相19次谐波电压含有率日最大值发生时间"},
    
    //A相总谐波电压含有率日最大值及+A相总畸变电压含有率日最大值发生时间
    {A5,"A相总谐波电压含有率日最大值"},
    
    {A17,"A相总谐波电压含有率日最大值发生时间"},
    
    
    /*B相2－19次谐波电压含有率日最大值及发生时间*/
    {A5,"B相2次谐波电压含有率日最大值"},
    
    {A17,"B相2次谐波电压含有率日最大值发生时间"},
    
    {A5,"B相3次谐波电压含有率日最大值"},
    
    {A17,"B相3次谐波电压含有率日最大值发生时间"},
    
    {A5,"B相4次谐波电压含有率日最大值"},
    
    {A17,"B相4次谐波电压含有率日最大值发生时间"},
    
    {A5,"B相5次谐波电压含有率日最大值"},
    
    {A17,"B相5次谐波电压含有率日最大值发生时间"},
    
    {A5,"B相6次谐波电压含有率日最大值"},
    
    {A17,"B相6次谐波电压含有率日最大值发生时间"},
    
    {A5,"B相7次谐波电压含有率日最大值"},
    
    {A17,"B相7次谐波电压含有率日最大值发生时间"},
    
    {A5,"B相8次谐波电压含有率日最大值"},
    
    {A17,"B相8次谐波电压含有率日最大值发生时间"},
    
    {A5,"B相9次谐波电压含有率日最大值"},
    
    {A17,"B相9次谐波电压含有率日最大值发生时间"},
    
    {A5,"B相10次谐波电压含有率日最大值"},
    
    {A17,"B相10次谐波电压含有率日最大值发生时间"},
    
    {A5,"B相11次谐波电压含有率日最大值"},
    
    {A17,"B相11次谐波电压含有率日最大值发生时间"},
    
    {A5,"B相12次谐波电压含有率日最大值"},
    
    {A17,"B相12次谐波电压含有率日最大值发生时间"},
    
    {A5,"B相13次谐波电压含有率日最大值"},
    
    {A17,"B相13次谐波电压含有率日最大值发生时间"},
    
    {A5,"B相14次谐波电压含有率日最大值"},
    
    {A17,"B相14次谐波电压含有率日最大值发生时间"},
    
    {A5,"B相15次谐波电压含有率日最大值"},
    
    {A17,"B相15次谐波电压含有率日最大值发生时间"},
    
    {A5,"B相16次谐波电压含有率日最大值"},
    
    {A17,"B相16次谐波电压含有率日最大值发生时间"},
    
    {A5,"B相17次谐波电压含有率日最大值"},
    
    {A17,"B相17次谐波电压含有率日最大值发生时间"},
    
    {A5,"B相18次谐波电压含有率日最大值"},
    
    {A17,"B相18次谐波电压含有率日最大值发生时间"},
    
    {A5,"B相19次谐波电压含有率日最大值"},
    
    {A17,"B相19次谐波电压含有率日最大值发生时间"},
    
    //B相总谐波电压含有率日最大值及+A相总畸变电压含有率日最大值发生时间
    {A5,"B相总谐波电压含有率日最大值"},
    
    {A17,"B相总谐波电压含有率日最大值发生时间"},
    
    
    
    /*C相2－19次谐波电压含有率日最大值及发生时间*/
    {A5,"C相2次谐波电压含有率日最大值"},
    
    {A17,"C相2次谐波电压含有率日最大值发生时间"},
    
    {A5,"C相3次谐波电压含有率日最大值"},
    
    {A17,"C相3次谐波电压含有率日最大值发生时间"},
    
    {A5,"C相4次谐波电压含有率日最大值"},
    
    {A17,"C相4次谐波电压含有率日最大值发生时间"},
    
    {A5,"C相5次谐波电压含有率日最大值"},
    
    {A17,"C相5次谐波电压含有率日最大值发生时间"},
    
    {A5,"C相6次谐波电压含有率日最大值"},
    
    {A17,"C相6次谐波电压含有率日最大值发生时间"},
    
    {A5,"C相7次谐波电压含有率日最大值"},
    
    {A17,"C相7次谐波电压含有率日最大值发生时间"},
    
    {A5,"C相8次谐波电压含有率日最大值"},
    
    {A17,"C相8次谐波电压含有率日最大值发生时间"},
    
    {A5,"C相9次谐波电压含有率日最大值"},
    
    {A17,"C相9次谐波电压含有率日最大值发生时间"},
    
    {A5,"C相10次谐波电压含有率日最大值"},
    
    {A17,"C相10次谐波电压含有率日最大值发生时间"},
    
    {A5,"C相11次谐波电压含有率日最大值"},
    
    {A17,"C相11次谐波电压含有率日最大值发生时间"},
    
    {A5,"C相12次谐波电压含有率日最大值"},
    
    {A17,"C相12次谐波电压含有率日最大值发生时间"},
    
    {A5,"C相13次谐波电压含有率日最大值"},
    
    {A17,"C相13次谐波电压含有率日最大值发生时间"},
    
    {A5,"C相14次谐波电压含有率日最大值"},
    
    {A17,"C相14次谐波电压含有率日最大值发生时间"},
    
    {A5,"C相15次谐波电压含有率日最大值"},
    
    {A17,"C相15次谐波电压含有率日最大值发生时间"},
    
    {A5,"C相16次谐波电压含有率日最大值"},
    
    {A17,"C相16次谐波电压含有率日最大值发生时间"},
    
    {A5,"C相17次谐波电压含有率日最大值"},
    
    {A17,"C相17次谐波电压含有率日最大值发生时间"},
    
    {A5,"C相18次谐波电压含有率日最大值"},
    
    {A17,"C相18次谐波电压含有率日最大值发生时间"},
    
    {A5,"C相19次谐波电压含有率日最大值"},
    
    {A17,"C相19次谐波电压含有率日最大值发生时间"},
    
    //C相总谐波电压含有率日最大值及+A相总畸变电压含有率日最大值发生时间
    {A5,"C相总谐波电压含有率日最大值"},
    
    {A17,"C相总谐波电压含有率日最大值发生时间"}
    
};





//测量点日数据——电流谐波类数据
const COMPLEX_ITEM daily_data_charmonic[] =
{
    {A20,"日数据时标"},
    
    
    /*A相2－19次谐波电流日最大值及发生时间*/
    {A6,"A相2次谐波电流日最大值"},
    
    {A17,"A相2次谐波电流日最大值发生时间"},
    
    {A6,"A相3次谐波电流日最大值"},
    
    {A17,"A相3次谐波电流日最大值发生时间"},
    
    {A6,"A相4次谐波电流日最大值"},
    
    {A17,"A相4次谐波电流日最大值发生时间"},
    
    {A6,"A相5次谐波电流日最大值"},
    
    {A17,"A相5次谐波电流日最大值发生时间"},
    
    {A6,"A相6次谐波电流日最大值"},
    
    {A17,"A相6次谐波电流日最大值发生时间"},
    
    {A6,"A相7次谐波电流日最大值"},
    
    {A17,"A相7次谐波电流日最大值发生时间"},
    
    {A6,"A相8次谐波电流日最大值"},
    
    {A17,"A相8次谐波电流日最大值发生时间"},
    
    {A6,"A相9次谐波电流日最大值"},
    
    {A17,"A相9次谐波电流日最大值发生时间"},
    
    {A6,"A相10次谐波电流日最大值"},
    
    {A17,"A相10次谐波电流日最大值发生时间"},
    
    {A6,"A相11次谐波电流日最大值"},
    
    {A17,"A相11次谐波电流日最大值发生时间"},
    
    {A6,"A相12次谐波电流日最大值"},
    
    {A17,"A相12次谐波电流日最大值发生时间"},
    
    {A6,"A相13次谐波电流日最大值"},
    
    {A17,"A相13次谐波电流日最大值发生时间"},
    
    {A6,"A相14次谐波电流日最大值"},
    
    {A17,"A相14次谐波电流日最大值发生时间"},
    
    {A6,"A相15次谐波电流日最大值"},
    
    {A17,"A相15次谐波电流日最大值发生时间"},
    
    {A6,"A相16次谐波电流日最大值"},
    
    {A17,"A相16次谐波电流日最大值发生时间"},
    
    {A6,"A相17次谐波电流日最大值"},
    
    {A17,"A相17次谐波电流日最大值发生时间"},
    
    {A6,"A相18次谐波电流日最大值"},
    
    {A17,"A相18次谐波电流日最大值发生时间"},
    
    {A6,"A相19次谐波电流日最大值"},
    
    {A17,"A相19次谐波电流日最大值发生时间"},
    /*A相总畸变电流日最大值+A相总畸变电流日最大值发生时间*/
    {A6,"A相总畸变电流日最大值"},
    
    {A17,"A相总畸变电流日最大值发生时间"},
    
    
    /*B相2－19次谐波电流日最大值及发生时间*/
    {A6,"B相2次谐波电流日最大值"},
    
    {A17,"B相2次谐波电流日最大值发生时间"},
    
    {A6,"B相3次谐波电流日最大值"},
    
    {A17,"B相3次谐波电流日最大值发生时间"},
    
    {A6,"B相4次谐波电流日最大值"},
    
    {A17,"B相4次谐波电流日最大值发生时间"},
    
    {A6,"B相5次谐波电流日最大值"},
    
    {A17,"B相5次谐波电流日最大值发生时间"},
    
    {A6,"B相6次谐波电流日最大值"},
    
    {A17,"B相6次谐波电流日最大值发生时间"},
    
    {A6,"B相7次谐波电流日最大值"},
    
    {A17,"B相7次谐波电流日最大值发生时间"},
    
    {A6,"B相8次谐波电流日最大值"},
    
    {A17,"B相8次谐波电流日最大值发生时间"},
    
    {A6,"B相9次谐波电流日最大值"},
    
    {A17,"B相9次谐波电流日最大值发生时间"},
    
    {A6,"B相10次谐波电流日最大值"},
    
    {A17,"B相10次谐波电流日最大值发生时间"},
    
    {A6,"B相11次谐波电流日最大值"},
    
    {A17,"B相11次谐波电流日最大值发生时间"},
    
    {A6,"B相12次谐波电流日最大值"},
    
    {A17,"B相12次谐波电流日最大值发生时间"},
    
    {A6,"B相13次谐波电流日最大值"},
    
    {A17,"B相13次谐波电流日最大值发生时间"},
    
    {A6,"B相14次谐波电流日最大值"},
    
    {A17,"B相14次谐波电流日最大值发生时间"},
    
    {A6,"B相15次谐波电流日最大值"},
    
    {A17,"B相15次谐波电流日最大值发生时间"},
    
    {A6,"B相16次谐波电流日最大值"},
    
    {A17,"B相16次谐波电流日最大值发生时间"},
    
    {A6,"B相17次谐波电流日最大值"},
    
    {A17,"B相17次谐波电流日最大值发生时间"},
    
    {A6,"B相18次谐波电流日最大值"},
    
    {A17,"B相18次谐波电流日最大值发生时间"},
    
    {A6,"B相19次谐波电流日最大值"},
    
    {A17,"B相19次谐波电流日最大值发生时间"},
    /*B相总畸变电流日最大值+B相总畸变电流日最大值发生时间*/
    {A6,"B相总畸变电流日最大值"},
    
    {A17,"B相总畸变电流日最大值发生时间"},
    
    /*C相2－19次谐波电流日最大值及发生时间*/
    {A6,"C相2次谐波电流日最大值"},
    
    {A17,"C相2次谐波电流日最大值发生时间"},
    
    {A6,"C相3次谐波电流日最大值"},
    
    {A17,"C相3次谐波电流日最大值发生时间"},
    
    {A6,"C相4次谐波电流日最大值"},
    
    {A17,"C相4次谐波电流日最大值发生时间"},
    
    {A6,"C相5次谐波电流日最大值"},
    
    {A17,"C相5次谐波电流日最大值发生时间"},
    
    {A6,"C相6次谐波电流日最大值"},
    
    {A17,"C相6次谐波电流日最大值发生时间"},
    
    {A6,"C相7次谐波电流日最大值"},
    
    {A17,"C相7次谐波电流日最大值发生时间"},
    
    {A6,"C相8次谐波电流日最大值"},
    
    {A17,"C相8次谐波电流日最大值发生时间"},
    
    {A6,"C相9次谐波电流日最大值"},
    
    {A17,"C相9次谐波电流日最大值发生时间"},
    
    {A6,"C相10次谐波电流日最大值"},
    
    {A17,"C相10次谐波电流日最大值发生时间"},
    
    {A6,"C相11次谐波电流日最大值"},
    
    {A17,"C相11次谐波电流日最大值发生时间"},
    
    {A6,"C相12次谐波电流日最大值"},
    
    {A17,"C相12次谐波电流日最大值发生时间"},
    
    {A6,"C相13次谐波电流日最大值"},
    
    {A17,"C相13次谐波电流日最大值发生时间"},
    
    {A6,"C相14次谐波电流日最大值"},
    
    {A17,"C相14次谐波电流日最大值发生时间"},
    
    {A6,"C相15次谐波电流日最大值"},
    
    {A17,"C相15次谐波电流日最大值发生时间"},
    
    {A6,"C相16次谐波电流日最大值"},
    
    {A17,"C相16次谐波电流日最大值发生时间"},
    
    {A6,"C相17次谐波电流日最大值"},
    
    {A17,"C相17次谐波电流日最大值发生时间"},
    
    {A6,"C相18次谐波电流日最大值"},
    
    {A17,"C相18次谐波电流日最大值发生时间"},
    
    {A6,"C相19次谐波电流日最大值"},
    
    {A17,"C相19次谐波电流日最大值发生时间"},
    /*C相总畸变电流日最大值+C相总畸变电流日最大值发生时间*/
    {A6,"C相总畸变电流日最大值"},
    
    {A17,"C相总畸变电流日最大值发生时间"},
    
};

//测量点日电能示值数据
const COMPLEX_ITEM measure_day_powervalue[]=
{
    
    {A20,"数据时标"},
    //正向有功总电能示值
    {A14,"正向有功总电能示值"},
    
    {A14,"费率1正向有功电能示值"},
    
    {A14,"费率2正向有功电能示值"},
    
    {A14,"费率3正向有功电能示值"},
    
    {A14,"费率4正向有功电能示值"},
    
    
    
    //正向无功
    {A11,"正向无功总电能示值"},
    
    {A11,"正向无功费率1电能示值"},
    
    {A11,"正向无功费率2电能示值"},
    
    {A11,"正向无功费率3电能示值"},
    
    {A11,"正向无功费率4电能示值"},
    
    //一象限无功
    
    {A11,"一象限无功总电能示值"},
    
    {A11,"一象限无功费率1电能示值"},
    
    {A11,"一象限无功费率2电能示值"},
    
    {A11,"一象限无功费率3电能示值"},
    
    {A11,"一象限无功费率4电能示值"},
    
    //四象限无功
    {A11,"四象限无功总电能示值"},
    
    {A11,"四象限无功费率1电能示值"},
    
    {A11,"四象限无功费率2电能示值"},
    
    {A11,"四象限无功费率3电能示值"},
    
    {A11,"四象限无功费率4电能示值"},
    
    
    //反向有功
    {A14,"反向有功总电能示值"},
    
    {A14,"费率1反向有功电能示值"},
    
    {A14,"费率2反向有功电能示值"},
    
    {A14,"费率3反向有功电能示值"},
    
    {A14,"费率4反向有功电能示值"},
    
    
    //反向无功
    {A11,"反向无功总电能示值"},
    
    {A11,"反向无功费率1电能示值"},
    
    {A11,"反向无功费率2电能示值"},
    
    {A11,"反向无功费率3电能示值"},
    
    {A11,"反向无功费率4电能示值"},
    
    
    //二象限无功
    {A11,"二象限无功总电能示值"},
    
    {A11,"二象限无功费率1电能示值"},
    
    {A11,"二象限无功费率2电能示值"},
    
    {A11,"二象限无功费率3电能示值"},
    
    {A11,"二象限无功费率4电能示值"},
    
    
    //三象限无功
    {A11,"三象限无功总电能示值"},
    
    {A11,"三象限无功费率1电能示值"},
    
    {A11,"三象限无功费率2电能示值"},
    
    {A11,"三象限无功费率3电能示值"},
    
    {A11,"三象限无功费率4电能示值"},
    
    
    
    //正向无功（组合无功1）
    {A11,"正向无功总电能示值"},
    
    {A11,"正向无功费率1电能示值"},
    
    {A11,"正向无功费率2电能示值"},
    
    {A11,"正向无功费率3电能示值"},
    
    {A11,"正向无功费率4电能示值"},
    
    //反向无功（组合无功1）
    {A11,"反向无功总电能示值"},
    
    {A11,"反向无功费率1电能示值"},
    
    {A11,"反向无功费率2电能示值"},
    
    {A11,"反向无功费率3电能示值"},
    
    {A11,"反向无功费率4电能示值"},
    
    //正向有功电能量
    
    {A13,"日正向有功总电能量"},
    
    {A13,"日费率1正向有功电能量"},
    
    {A13,"日费率2正向有功电能量"},
    
    {A13,"日费率3正向有功电能量"},
    
    {A13,"日费率4正向有功电能量"},
    
};


//测量点月电能示值数据
const COMPLEX_ITEM measure_month_powervalue[]=
{
    {A21,"数据时标"},
    
    //正向有功总电能示值
    {A14,"正向有功总电能示值"},
    
    {A14,"费率1正向有功电能示值"},
    
    {A14,"费率2正向有功电能示值"},
    
    {A14,"费率3正向有功电能示值"},
    
    {A14,"费率4正向有功电能示值"},
    
    
    
    //正向无功
    {A11,"正向无功总电能示值"},
    
    {A11,"正向无功费率1电能示值"},
    
    {A11,"正向无功费率2电能示值"},
    
    {A11,"正向无功费率3电能示值"},
    
    {A11,"正向无功费率4电能示值"},
    
    //一象限无功
    {A11,"一象限无功总电能示值"},
    
    {A11,"一象限无功费率1电能示值"},
    
    {A11,"一象限无功费率2电能示值"},
    
    {A11,"一象限无功费率3电能示值"},
    
    {A11,"一象限无功费率4电能示值"},
    //四象限无功
    {A11,"四象限无功总电能示值"},
    
    {A11,"四象限无功费率1电能示值"},
    
    {A11,"四象限无功费率2电能示值"},
    
    {A11,"四象限无功费率3电能示值"},
    
    {A11,"四象限无功费率4电能示值"},
    
    
    //反向有功
    {A14,"反向有功总电能示值"},
    
    {A14,"费率1反向有功电能示值"},
    
    {A14,"费率2反向有功电能示值"},
    
    {A14,"费率3反向有功电能示值"},
    
    {A14,"费率4反向有功电能示值"},
    
    
    //反向无功
    {A11,"反向无功总电能示值"},
    
    {A11,"反向无功费率1电能示值"},
    
    {A11,"反向无功费率2电能示值"},
    
    {A11,"反向无功费率3电能示值"},
    
    {A11,"反向无功费率4电能示值"},
    
    
    //二象限无功
    {A11,"二象限无功总电能示值"},
    
    {A11,"二象限无功费率1电能示值"},
    
    {A11,"二象限无功费率2电能示值"},
    
    {A11,"二象限无功费率3电能示值"},
    
    {A11,"二象限无功费率4电能示值"},
    
    
    //三象限无功
    {A11,"三象限无功总电能示值"},
    
    {A11,"三象限无功费率1电能示值"},
    
    {A11,"三象限无功费率2电能示值"},
    
    {A11,"三象限无功费率3电能示值"},
    
    {A11,"三象限无功费率4电能示值"},
    
    
    
    //正向无功（组合无功1）
    {A11,"正向无功总电能示值"},
    
    {A11,"正向无功费率1电能示值"},
    
    {A11,"正向无功费率2电能示值"},
    
    {A11,"正向无功费率3电能示值"},
    
    {A11,"正向无功费率4电能示值"},
    
    //反向无功（组合无功1）
    {A11,"反向无功总电能示值"},
    
    {A11,"反向无功费率1电能示值"},
    
    {A11,"反向无功费率2电能示值"},
    
    {A11,"反向无功费率3电能示值"},
    
    {A11,"反向无功费率4电能示值"},
    
    {A13,"月正向有功总电能量"},
    
    {A13,"月费率1正向有功总电能量"},
    
    {A13,"月费率2正向有功总电能量"},
    
    {A13,"月费率3正向有功总电能量"},
    
    {A13,"月费率4正向有功总电能量"},
    
    
};


//历史数据测量日统计数据
const COMPLEX_ITEM measure_day_sta[]=
{
    {A20,"日数据时标"},
    
    {BIN2_30,"A相电压越上上限日累计时间"},
    
    {BIN2_30,"A相电压越下下限日累计时间"},
    
    {BIN2_30,"A相电压越上限日累计时间"},
    
    {BIN2_30,"A相电压越下限日累计时间"},
    
    {BIN2_30,"A相电压合格日累计时间"},
    
    
    {BIN2_30,"B相电压越上上限日累计时间"},
    
    {BIN2_30,"B相电压越下下限日累计时间"},
    
    {BIN2_30,"B相电压越上限日累计时间"},
    
    {BIN2_30,"B相电压越下限日累计时间"},
    
    {BIN2_30,"B相电压合格日累计时间"},
    
    
    {BIN2_30,"C相电压越上上限日累计时间"},
    
    {BIN2_30,"C相电压越下下限日累计时间"},
    
    {BIN2_30,"C相电压越上限日累计时间"},
    
    {BIN2_30,"C相电压越下限日累计时间"},
    
    {BIN2_30,"C相电压合格日累计时间"},
    
    
    {A7,"A相电压最大值"},
    
    {A18,"A相电压最大值发生时间"},
    
    {A7,"A相电压最小值"},
    
    {A18,"A相电压最小值发生时间"},
    
    {A7,"B相电压最大值"},
    
    {A18,"B相电压最大值发生时间"},
    
    {A7,"B相电压最小值"},
    
    {A18,"B相电压最小值发生时间"},
    
    {A7,"C相电压最大值"},
    
    {A18,"C相电压最大值发生时间"},
    
    {A7,"C相电压最小值"},
    
    {A18,"C相电压最小值发生时间"},
    
    
    
    {A7,"A相平均电压"},
    
    {A7,"B相平均电压"},
    
    {A7,"C相平均电压"},
    
    
    
    {A25,"A相电压越上限率"},
    
    {A25,"A相电压越下限率"},
    
    {A25,"A相电压合格率"},
    
    {A25,"B相电压越上限率"},
    
    {A25,"B相电压越下限率"},
    
    {A25,"B相电压合格率"},
    
    {A25,"C相电压越上限率"},
    
    {A25,"C相电压越下限率"},
    
    {A25,"C相电压合格率"},
    
    //日冻结日不平衡度越限累计时间 发生时间不相同
    {BIN2_30,"电流不平衡度越限日累计时间"},
    
    {BIN2_30,"电压不平衡度越限日累计时间"},
    
    //***************************确认***************************
    {A5,"电流不平衡最大值"},
    
    {A18,"电流不平衡最大值发生时间"},
    
    {A5,"电压不平衡最大值"},
    
    {A18,"电压不平衡最大值发生时间"},
    
    
    
    {BIN2_30,"A相电流越上上限日累计时间"},
    
    {BIN2_30,"A相电流越上限日累计时间"},
    
    {BIN2_30,"B相电流越上上限日累计时间"},
    
    {BIN2_30,"B相电流越上限日累计时间"},
    
    {BIN2_30,"C相电流越上上限日累计时间"},
    
    {BIN2_30,"C相电流越上限日累计时间"},
    
    {BIN2_30,"零序电流越上限日累计时间"},
    
    
    
    
    {A25,"A相电流最大值"},
    
    {A18,"A相电流最大值发生时间"},
    
    {A25,"B相电流最大值"},
    
    {A18,"B相电流最大值发生时间"},
    
    {A25,"C相电流最大值"},
    
    {A18,"C相电流最大值发生时间"},
    
    {A25,"零序电流最大值"},
    
    {A18,"零序电流最大值发生时间"},
    
    
    
    {BIN2_30,"视在功率越上上限日累计时间"},
    
    {BIN2_30,"视在功率越上限日累计时间"},
    
    
    
    {BIN2_30,"区段1累计时间（功率因数＜定值1）"},
    
    {BIN2_30,"区段2累计时间（定值1≤功率因数＜定值2）"},
    
    {BIN2_30,"区段3累计时间（功率因数≥定值2）"},
    
    {A23,"三相总最大有功功率"},
    
    {A18,"三相总最大有功功率发生时间"},
    
    {A23,"A相最大有功功率"},
    
    {A18,"A相最大有功功率发生时间"},
    
    {A23,"B相最大有功功率"},
    
    {A18,"B相最大有功功率发生时间"},
    
    {A23,"C相最大有功功率"},
    
    {A18,"C相最大有功功率发生时间"},
    
    
    {BIN2_30,"三相总有功功率为零时间"},
    
    {BIN2_30,"A相有功功率为零时间"},
    
    {BIN2_30,"B相有功功率为零时间"},
    
    {BIN2_30,"C相有功功率为零时间"},
    
    /*chenbaiqing 2014.2.13增补规约*/
    {BIN2_30,"日冻结A相过载日累计时间"},
    
    {BIN2_30,"日冻结B相过载日累计时间"},
    
    {BIN2_30,"日冻结C相过载日累计时间"},
    
    {A14,"铜损有功总电能示值"},
    
    {A14,"铁损有功总电能示值"},
};



//历史数据测量点月统计数据
const COMPLEX_ITEM measure_month_sta[]=
{
    
    {A21,"月数据时标"},
    
    {BIN2_30,"A相电压越上上限月累计时间"},
    
    {BIN2_30,"A相电压越下下限月累计时间"},
    
    {BIN2_30,"A相电压越上限月累计时间"},
    
    {BIN2_30,"A相电压越下限月累计时间"},
    
    {BIN2_30,"A相电压合格月累计时间"},
    
    
    {BIN2_30,"B相电压越上上限月累计时间"},
    
    {BIN2_30,"B相电压越下下限月累计时间"},
    
    {BIN2_30,"B相电压越上限月累计时间"},
    
    {BIN2_30,"B相电压越下限月累计时间"},
    
    {BIN2_30,"B相电压合格月累计时间"},
    
    
    {BIN2_30,"C相电压越上上限月累计时间"},
    
    {BIN2_30,"C相电压越下下限月累计时间"},
    
    {BIN2_30,"C相电压越上限月累计时间"},
    
    {BIN2_30,"C相电压越下限月累计时间"},
    
    {BIN2_30,"C相电压合格月累计时间"},
    
    
    {A7,"A相电压最大值"},
    
    {A18,"A相电压最大值发生时间"},
    
    {A7,"A相电压最小值"},
    
    {A18,"A相电压最小值发生时间"},
    
    {A7,"B相电压最大值"},
    
    {A18,"B相电压最大值发生时间"},
    
    {A7,"B相电压最小值"},
    
    {A18,"B相电压最小值发生时间"},
    
    {A7,"C相电压最大值"},
    
    {A18,"C相电压最大值发生时间"},
    
    {A7,"C相电压最小值"},
    
    {A18,"C相电压最小值发生时间"},
    
    {A7,"A相平均电压"},
    
    {A7,"B相平均电压"},
    
    {A7,"C相平均电压"},
    
    
    
    {A25,"A相电压越上限率"},
    
    {A25,"A相电压越下限率"},
    
    {A25,"A相电压合格率"},
    
    {A25,"B相电压越上限率"},
    
    {A25,"B相电压越下限率"},
    
    {A25,"B相电压合格率"},
    
    {A25,"C相电压越上限率"},
    
    {A25,"C相电压越下限率"},
    
    {A25,"C相电压合格率"},
    
    
    {BIN2_30,"电流不平衡度越限月累计时间"},
    
    {BIN2_30,"电压不平衡度越限月累计时间"},
    
    {A5,"电流不平衡最大值"},
    
    {A17,"电流不平衡最大值发生时间"},
    
    {A5,"电压不平衡最大值"},
    
    {A17,"电压不平衡最大值发生时间"},
    
    
    
    {BIN2_30,"A相电流越上上限月累计时间"},
    
    {BIN2_30,"A相电流越上限月累计时间"},
    
    {BIN2_30,"B相电流越上上限月累计时间"},
    
    {BIN2_30,"B相电流越上限月累计时间"},
    
    {BIN2_30,"C相电流越上上限月累计时间"},
    
    {BIN2_30,"C相电流越上限月累计时间"},
    
    {BIN2_30,"零序电流越上限月累计时间"},
    
    
    
    
    {A25,"A相电流最大值"},
    
    {A18,"A相电流最大值发生时间"},
    
    {A25,"B相电流最大值"},
    
    {A18,"B相电流最大值发生时间"},
    
    {A25,"C相电流最大值"},
    
    {A18,"C相电流最大值发生时间"},
    
    {A25,"零序电流最大值"},
    
    {A18,"零序电流最大值发生时间"},
    
    
    
    {BIN2_30,"视在功率越上上限月累计时间"},
    
    {BIN2_30,"视在功率越上限月累计时间"},
    
    {BIN2_30,"区段1累计时间（功率因数＜定值1）"},
    
    {BIN2_30,"区段2累计时间（定值1≤功率因数＜定值2）"},
    
    {BIN2_30,"区段3累计时间（功率因数≥定值2）"},
    
    {A23,"三相总最大有功功率"},
    
    {A18,"三相总最大有功功率发生时间"},
    
    {A23,"A相最大有功功率"},
    
    {A18,"A相最大有功功率发生时间"},
    
    {A23,"B相最大有功功率"},
    
    {A18,"B相最大有功功率发生时间"},
    
    {A23,"C相最大有功功率"},
    
    {A18,"C相最大有功功率发生时间"},
    
    {BIN2_30,"三相总有功功率为零时间"},
    
    {BIN2_30,"A相有功功率为零时间"},
    
    {BIN2_30,"B相有功功率为零时间"},
    
    {BIN2_30,"C相有功功率为零时间"},
    
    /*chenbaiqing 2014.2.13增补规约*/
    {BIN2_30,"月冻结A相过载日累计时间"},
    
    {BIN2_30,"月冻结B相过载日累计时间"},
    
    {BIN2_30,"月冻结C相过载日累计时间"},
    
    /*chenbaiqing2014.2.21 新增*/
    {A14,"铜损有功总电能示值"},
    
    {A14,"铁损有功总电能示值"},
    
};


//测量点日需量数据类型
const COMPLEX_ITEM history_day_powerneeds[]=
{
    
    {A20, "日数据时标"},
    
    //正向有功最大需量
    {A23,"正向有功总最大需量"},
    
    {A23,"费率1正向有功最大需量"},
    
    {A23,"费率2正向有功最大需量"},
    
    {A23,"费率3正向有功最大需量"},
    
    {A23,"费率4正向有功最大需量"},
    
    
    //正向有功最大需量发生时间
    {A17,"正向有功总最大需量发生时间"},
    
    {A17,"费率1正向有功最大需量发生时间"},
    
    {A17,"费率2正向有功最大需量发生时间"},
    
    {A17,"费率3正向有功最大需量发生时间"},
    
    {A17,"费率4正向有功最大需量发生时间"},
    
    
    //正向无功最大需量
    {A23,"正向无功总最大需量"},
    
    {A23,"费率1正向无功最大需量"},
    
    {A23,"费率2正向无功最大需量"},
    
    {A23,"费率3正向无功最大需量"},
    
    {A23,"费率4正向无功最大需量"},
    
    
    //正向无功最大需量发生时间
    {A17,"正向无功总最大需量发生时间"},
    
    {A17,"费率1正向无功最大需量发生时间"},
    
    {A17,"费率2正向无功最大需量发生时间"},
    
    {A17,"费率3正向无功最大需量发生时间"},
    
    {A17,"费率4正向无功最大需量发生时间"},
    
    
    //反向有功最大需量
    {A23,"反向有功总最大需量"},
    
    {A23,"费率1反向有功最大需量"},
    
    {A23,"费率2反向有功最大需量"},
    
    {A23,"费率3反向有功最大需量"},
    
    {A23,"费率4反向有功最大需量"},
    
    
    //反向有功最大需量发生时间
    {A17,"反向有功总最大需量发生时间"},
    
    {A17,"费率1反向有功最大需量发生时间"},
    
    {A17,"费率2反向有功最大需量发生时间"},
    
    {A17,"费率3反向有功最大需量发生时间"},
    
    {A17,"费率4反向有功最大需量发生时间"},
    
    
    //反向无功最大需量
    {A23,"反向无功总最大需量"},
    
    {A23,"费率1反向无功最大需量"},
    
    {A23,"费率2反向无功最大需量"},
    
    {A23,"费率3反向无功最大需量"},
    
    {A23,"费率4反向无功最大需量"},
    
    
    //反向无功最大需量发生时间
    {A17,"反向无功总最大需量发生时间"},
    
    {A17,"费率1反向无功最大需量发生时间"},
    
    {A17,"费率2反向无功最大需量发生时间"},
    
    {A17,"费率3反向无功最大需量发生时间"},
    
    {A17,"费率4反向无功最大需量发生时间"},
    
    
    
    
    //三向总有功最大需量
    {A23,"三相总有功最大需量"},
    
    {A18,"三相总有功最大需量发生时间"},
    
    {A23,"A相有功最大需量"},
    
    {A18,"A相有功最大需量发生时间"},
    
    {A23,"B相有功最大需量"},
    
    {A18,"B相有功最大需量发生时间"},
    
    {A23,"C相有功最大需量"},
    
    {A18,"C相有功最大需量发生时间"},
    
};

//测量点月需量数据类型
const COMPLEX_ITEM history_month_powerneeds[]=
{
    {A21,"月数据时标"},
    
    //正向有功最大需量
    {A23,"正向有功总最大需量"},
    
    {A23,"费率1正向有功最大需量"},
    
    {A23,"费率2正向有功最大需量"},
    
    {A23,"费率3正向有功最大需量"},
    
    {A23,"费率4正向有功最大需量"},
    
    
    
    //正向有功最大需量发生时间
    {A17,"正向有功总最大需量发生时间"},
    
    {A17,"费率1正向有功最大需量发生时间"},
    
    {A17,"费率2正向有功最大需量发生时间"},
    
    {A17,"费率3正向有功最大需量发生时间"},
    
    {A17,"费率4正向有功最大需量发生时间"},
    
    
    
    //正向无功最大需量
    {A23,"正向无功总最大需量"},
    
    {A23,"费率1正向无功最大需量"},
    
    {A23,"费率2正向无功最大需量"},
    
    {A23,"费率3正向无功最大需量"},
    
    {A23,"费率4正向无功最大需量"},
    
    
    
    //正向无功最大需量发生时间
    {A17,"正向无功总最大需量发生时间"},
    
    {A17,"费率1正向无功最大需量发生时间"},
    
    {A17,"费率2正向无功最大需量发生时间"},
    
    {A17,"费率3正向无功最大需量发生时间"},
    
    {A17,"费率4正向无功最大需量发生时间"},
    
    
    
    //反向有功最大需量
    {A23,"反向有功总最大需量"},
    
    {A23,"费率1反向有功最大需量"},
    
    {A23,"费率2反向有功最大需量"},
    
    {A23,"费率3反向有功最大需量"},
    
    {A23,"费率4反向有功最大需量"},
    
    
    //反向有功最大需量发生时间
    {A17,"反向有功总最大需量发生时间"},
    
    {A17,"费率1反向有功最大需量发生时间"},
    
    {A17,"费率2反向有功最大需量发生时间"},
    
    {A17,"费率3反向有功最大需量发生时间"},
    
    {A17,"费率4反向有功最大需量发生时间"},
    
    
    
    //反向无功最大需量
    {A23,"反向无功总最大需量"},
    
    {A23,"费率1反向无功最大需量"},
    
    {A23,"费率2反向无功最大需量"},
    
    {A23,"费率3反向无功最大需量"},
    
    {A23,"费率4反向无功最大需量"},
    
    
    //反向无功最大需量发生时间
    {A17,"反向无功总最大需量发生时间"},
    
    {A17,"费率1反向无功最大需量发生时间"},
    
    {A17,"费率2反向无功最大需量发生时间"},
    
    {A17,"费率3反向无功最大需量发生时间"},
    
    {A17,"费率4反向无功最大需量发生时间"},
    
    
    //三向总有功最大需量
    {A23,"三相总有功最大需量"},
    
    {A18,"三相总有功最大需量发生时间"},
    
    {A23,"A相有功最大需量"},
    
    {A18,"A相有功最大需量发生时间"},
    
    {A23,"B相有功最大需量"},
    
    {A18,"B相有功最大需量发生时间"},
    
    {A23,"C相有功最大需量"},
    
    {A18,"C相有功最大需量发生时间"},
    
    
};

const COMPLEX_ITEM parameter_data_terminal[] =
{
    {STRING_35,"事件记录有效标志位"},
    
    {STRING_35,"事件重要性等级标志位"},
    
    {STRING_35,"状态量接入标志位（对应1～8路状态量）"},
    
    {STRING_35,"状态量属性标志位（对应1～8路状态量）"},
    
    {BIN4_32,"月通信流量门限"},
    
    {A5,"总畸变电压含有率上限"},
    
    {A5,"奇次谐波电压含有率上限"},
    
    {A5,"偶次谐波电压含有率上限"},
    
    {A5,"2次谐波电压含有率上限"},
    
    {A5,"4次谐波电压含有率上限"},
    
    {A5,"6次谐波电压含有率上限"},
    
    {A5,"8次谐波电压含有率上限"},
    
    {A5,"10次谐波电压含有率上限"},
    
    {A5,"12次谐波电压含有率上限"},
    
    {A5,"14次谐波电压含有率上限"},
    
    {A5,"16次谐波电压含有率上限"},
    
    {A5,"18次谐波电压含有率上限"},
    
    {A5,"3次谐波电压含有率上限"},
    
    {A5,"5次谐波电压含有率上限"},
    
    {A5,"7次谐波电压含有率上限"},
    
    {A5,"9次谐波电压含有率上限"},
    
    {A5,"11次谐波电压含有率上限"},
    
    {A5,"13次谐波电压含有率上限"},
    
    {A5,"15次谐波电压含有率上限"},
    
    {A5,"17次谐波电压含有率上限"},
    
    {A5,"19次谐波电压含有率上限"},
    
    {A6,"总畸变电流有效值上限"},
    
    {A6,"2次谐波电流有效值上限"},
    
    {A6,"4次谐波电流有效值上限"},
    
    {A6,"6次谐波电流有效值上限"},
    
    {A6,"8次谐波电流有效值上限"},
    
    {A6,"10次谐波电流有效值上限"},
    
    {A6,"12次谐波电流有效值上限"},
    
    {A6,"14次谐波电流有效值上限"},
    
    {A6,"16次谐波电流有效值上限"},
    
    {A6,"18次谐波电流有效值上限"},
    
    {A6,"3次谐波电流有效值上限"},
    
    {A6,"5次谐波电流有效值上限"},
    
    {A6,"7次谐波电流有效值上限"},
    
    {A6,"9次谐波电流有效值上限"},
    
    {A6,"11次谐波电流有效值上限"},
    
    {A6,"13次谐波电流有效值上限"},
    
    {A6,"15次谐波电流有效值上限"},
    
    {A6,"17次谐波电流有效值上限"},
    
    {A6,"19次谐波电流有效值上限"},
    
    {STRING_35,"直流模拟量接入参数"},
    
    {STRING_35, "经度"},
    
    {STRING_35,"纬度"},
    
    {STRING_35,"设备编号"},
    
    {STRING_35,"设备类型"},
    
    {A7,"额定电压"},
    
    {NEW_41,"额定电流"},
    
    {BIN2_30,"额定容量"},
    
    {BIN2_30,"满载损耗"},
    
    {BIN2_30,"空载损耗"},
    
    {A7,"阻抗电压"},
    
    {A7,"额定频率"},
    
    {A20,"制造日期"},
    
    {STRING_35,"出厂编号"},
    
    {STRING_35,"连接组别"},
    
    {BIN1_29,"相数"},
    
    {STRING_35,"绝热耐热等级"},
    
    {A7,"温升"},
    
    {STRING_35,"冷却方式"},
    
    {STRING_35,"绝缘水平"},
    
    {BIN2_30,"CT变比"},
    
};



//测量点通信参数
const COMPLEX_ITEM parameter_data_mtr_comm[] =
{
    {BIN2_30, "所属测量点号"},
    
    {BIN2_30, "电能表/交流采样装置序号"},
    
    {BIN2_30, "通信速率"},
    
    {BIN1_29, "通信端口号"},
    
    {STRING_35, "通信协议类型"},
    
    {BIN6_40, "通信地址"},
    
    {BIN6_40, "通信密码"},
    
    {BIN1_29, "电能费率个数"},
    
    {BIN1_29,"有功电能示值整数位数"},
    
    {BIN1_29,"有功电能示值小数位数"}
};

////终端日统计数据
//const int terminal_day_sta[] =
//{
//    //数据时标
//    A20,
//
//    //终端日供电时间
//    BIN2_30,
//
//    //终端日复位次数
//    BIN2_30
//};
//
////终端月统计数据
//const int terminal_month_sta[] =
//{
//    //数据时标
//    A21,
//
//    //终端日供电时间
//    BIN2_30,
//
//    //终端日复位次数
//    BIN2_30
//};



////终端基本实时数据
//const int terminal_rt_basic_sta[] =
//{
//
//    BS248_33,    //终端参数状态
//
//    BIN4_32,     //终端与主站当日通信流量
//
//    BIN4_32,     //终端与主站当月通信流量
//
//    BS8_34,      //状态量的状态
//
//    BS8_34,      //状态量变位标志
//
//    BIN1_29,     //当前重要事件计数器EC1值
//
//    BIN1_29      //当前一般事件计数器EC2值
//};
//
//const int mtr_rt_basic_sta[] =
//{
//
//    A9,    //当前总有功功率
//
//    A9,    //当前A相有功功率
//
//    A9,    //当前B相有功功率
//
//    A9,    //当前C相有功功率
//
//    A9,    //当前总无功功率
//
//    A9,    //当前A相无功功率
//
//    A9,    //当前B相无功功率
//
//    A9,    //当前C相无功功率
//
//    A5,    //当前总功率因数
//
//    A5,    //当前A相功率因数
//
//    A5,    //当前B相功率因数
//
//    A5,    //当前C相功率因数
//
//    A7,    //当前A相电压
//
//    A7,    //当前B相电压
//
//    A7,    //当前C相电压
//
//    A25,   //当前A相电流
//
//    A25,   //当前B相电流
//
//    A25,   //当前C相电流
//
//    A25,   //当前零序电流
//
//    A9,    //当前总视在功率
//
//    A9,    //当前A相视在功率
//
//    A9,    //当前B相视在功率
//
//    A9,    //当前C相视在功率
//
//    A5,    //A相电压相角
//
//    A5,    //B相电压相角
//
//    A5,    //C相电压相角
//
//    A5,    //A相电流相角
//
//    A5,    //B相电流相角
//
//    A5     //C相电流相角
//};
//
//const int rt_power_value_sta[] =
//{
//    //当前正向有功总电能示值
//    A14,
//
//    //当前费率1正向有功总电能示值
//    A14,
//
//    //当前费率2正向有功总电能示值
//    A14,
//
//    //当前费率3正向有功总电能示值
//    A14,
//
//    //当前费率4正向有功总电能示值
//    A14,
//
//    //当前正向无功（组合无功1）总电能示值
//    A11,
//
//    //当前费率1正向无功（组合无功1）总电能示值
//    A11,
//
//    //当前费率2正向无功（组合无功1）总电能示值
//    A11,
//
//    //当前费率3正向无功（组合无功1）总电能示值
//    A11,
//
//    //当前费率4正向无功（组合无功1）总电能示值
//    A11,
//
//    //当前一象限无功总电能示值
//    A11,
//
//    //当前一象限费率1无功电能示值
//    A11,
//
//    //当前一象限费率2无功电能示值
//    A11,
//
//    //当前一象限费率3无功电能示值
//    A11,
//
//    //当前一象限费率4无功电能示值
//    A11,
//
//    //当前四象限无功总电能示值
//    A11,
//
//    //当前四象限费率1无功电能示值
//    A11,
//
//    //当前四象限费率2无功电能示值
//    A11,
//
//    //当前四象限费率3无功电能示值
//    A11,
//
//    //当前四象限费率4无功电能示值
//    A11,
//
//    //当前反向有功总电能示值
//    A14,
//
//    //当前费率1反向有功总电能示值
//    A14,
//
//    //当前费率2反向有功总电能示值
//    A14,
//
//    //当前费率3反向有功总电能示值
//    A14,
//
//    //当前费率4反向有功总电能示值
//    A14,
//
//    //当前反向无功（组合无功2）总电能示值
//    A11,
//
//    //当前费率1反向无功（组合无功2）总电能示值
//    A11,
//
//    //当前费率2反向无功（组合无功2）总电能示值
//    A11,
//
//    //当前费率3反向无功（组合无功2）总电能示值
//    A11,
//
//    //当前费率4反向无功（组合无功2）总电能示值
//    A11,
//
//    //当前二象限无功总电能示值
//    A11,
//
//    //当前二象限费率1无功电能示值
//    A11,
//
//    //当前二象限费率2无功电能示值
//    A11,
//
//    //当前二象限费率3无功电能示值
//    A11,
//
//    //当前二象限费率4无功电能示值
//    A11,
//
//    //当前三象限无功总电能示值
//    A11,
//
//    //当前三象限费率1无功电能示值
//    A11,
//
//    //当前三象限费率2无功电能示值
//    A11,
//
//    //当前三象限费率3无功电能示值
//    A11,
//
//    //当前三象限费率4无功电能示值
//    A11
//};
//
//const int rt_power_needs_sta[]=
//{
//    //当月正向有功总最大需量
//    A23,
//
//    //当月正向有功费率1最大需量
//    A23,
//
//    //当月正向有功费率2最大需量
//    A23,
//
//    //当月正向有功费率3最大需量
//    A23,
//
//    //当月正向有功费率4最大需量
//    A23,
//
//    //当月正向有功总最大需量发生时间
//    A17,
//
//    //当月正向有功费率1最大需量发生时间
//    A17,
//
//    //当月正向有功费率2最大需量发生时间
//    A17,
//
//    //当月正向有功费率3最大需量发生时间
//    A17,
//
//    //当月正向有功费率4最大需量发生时间
//    A17,
//
//    //当月正向无功总最大需量
//    A23,
//
//    //当月正向无功费率1最大需量
//    A23,
//
//    //当月正向无功费率2最大需量
//    A23,
//
//    //当月正向无功费率3最大需量
//    A23,
//
//    //当月正向无功费率4最大需量
//    A23,
//
//    //当月正向无功总最大需量发生时间
//    A17,
//
//    //当月正向无功费率1最大需量发生时间
//    A17,
//
//    //当月正向无功费率2最大需量发生时间
//    A17,
//
//    //当月正向无功费率3最大需量发生时间
//    A17,
//
//    //当月正向无功费率4最大需量发生时间
//    A17,
//
//    //当月反向有功总最大需量
//    A23,
//
//    //当月反向有功费率1最大需量
//    A23,
//
//    //当月反向有功费率2最大需量
//    A23,
//
//    //当月反向有功费率3最大需量
//    A23,
//
//    //当月反向有功费率4最大需量
//    A23,
//
//    //当月反向有功总最大需量发生时间
//    A17,
//
//    //当月反向有功费率1最大需量发生时间
//    A17,
//
//    //当月反向有功费率2最大需量发生时间
//    A17,
//
//    //当月反向有功费率3最大需量发生时间
//    A17,
//
//    //当月反向有功费率4最大需量发生时间
//    A17,
//
//    //当月反向无功总最大需量
//    A23,
//
//    //当月反向无功费率1最大需量
//    A23,
//
//    //当月反向无功费率2最大需量
//    A23,
//
//    //当月反向无功费率3最大需量
//    A23,
//
//    //当月反向无功费率4最大需量
//    A23,
//
//    //当月反向无功总最大需量发生时间
//    A17,
//
//    //当月反向无功费率1最大需量发生时间
//    A17,
//
//    //当月反向无功费率2最大需量发生时间
//    A17,
//
//    //当月反向无功费率3最大需量发生时间
//    A17,
//
//    //当月反向无功费率4最大需量发生时间
//    A17
//
//};
//
//const int rt_dc_analog[]=
//{
//    //直流模拟量当前数据
//    A2
//};
//
//const int mtr_rt_harmonic[]=
//{
//    //A相电压2次谐波有效值
//    A7,
//
//    //A相电压3次谐波有效值
//    A7,
//
//    //A相电压4次谐波有效值
//    A7,
//
//    //A相电压5次谐波有效值
//    A7,
//
//    //A相电压6次谐波有效值
//    A7,
//
//    //A相电压7次谐波有效值
//    A7,
//
//    //A相电压8次谐波有效值
//    A7,
//
//    //A相电压9次谐波有效值
//    A7,
//
//    //A相电压10次谐波有效值
//    A7,
//
//    //A相电压11次谐波有效值
//    A7,
//
//    //A相电压12次谐波有效值
//    A7,
//
//    //A相电压13次谐波有效值
//    A7,
//
//    //A相电压14次谐波有效值
//    A7,
//
//    //A相电压15次谐波有效值
//    A7,
//
//    //A相电压16次谐波有效值
//    A7,
//
//    //A相电压17次谐波有效值
//    A7,
//
//    //A相电压18次谐波有效值
//    A7,
//
//    //A相电压19次谐波有效值
//    A7,
//
//    //B相电压2次谐波有效值
//    A7,
//
//    //B相电压3次谐波有效值
//    A7,
//
//    //B相电压4次谐波有效值
//    A7,
//
//    //B相电压5次谐波有效值
//    A7,
//
//    //B相电压6次谐波有效值
//    A7,
//
//    //B相电压7次谐波有效值
//    A7,
//
//    //B相电压8次谐波有效值
//    A7,
//
//    //B相电压9次谐波有效值
//    A7,
//
//    //B相电压10次谐波有效值
//    A7,
//
//    //B相电压11次谐波有效值
//    A7,
//
//    //B相电压12次谐波有效值
//    A7,
//
//    //B相电压13次谐波有效值
//    A7,
//
//    //B相电压14次谐波有效值
//    A7,
//
//    //B相电压15次谐波有效值
//    A7,
//
//    //B相电压16次谐波有效值
//    A7,
//
//    //B相电压17次谐波有效值
//    A7,
//
//    //B相电压18次谐波有效值
//    A7,
//
//    //B相电压19次谐波有效值
//    A7,
//
//    //C相电压2次谐波有效值
//    A7,
//
//    //C相电压3次谐波有效值
//    A7,
//
//    //C相电压4次谐波有效值
//    A7,
//
//    //C相电压5次谐波有效值
//    A7,
//
//    //C相电压6次谐波有效值
//    A7,
//
//    //C相电压7次谐波有效值
//    A7,
//
//    //C相电压8次谐波有效值
//    A7,
//
//    //C相电压9次谐波有效值
//    A7,
//
//    //C相电压10次谐波有效值
//    A7,
//
//    //C相电压11次谐波有效值
//    A7,
//
//    //C相电压12次谐波有效值
//    A7,
//
//    //C相电压13次谐波有效值
//    A7,
//
//    //C相电压14次谐波有效值
//    A7,
//
//    //C相电压15次谐波有效值
//    A7,
//
//    //C相电压16次谐波有效值
//    A7,
//
//    //C相电压17次谐波有效值
//    A7,
//
//    //C相电压18次谐波有效值
//    A7,
//
//    //C相电压19次谐波有效值
//    A7,
//
//    //A相电流2次谐波有效值
//    A6,
//
//    //A相电流3次谐波有效值
//    A6,
//
//    //A相电流4次谐波有效值
//    A6,
//
//    //A相电流5次谐波有效值
//    A6,
//
//    //A相电流6次谐波有效值
//    A6,
//
//    //A相电流7次谐波有效值
//    A6,
//
//    //A相电流8次谐波有效值
//    A6,
//
//    //A相电流9次谐波有效值
//    A6,
//
//    //A相电流10次谐波有效值
//    A6,
//
//    //A相电流11次谐波有效值
//    A6,
//
//    //A相电流12次谐波有效值
//    A6,
//
//    //A相电流13次谐波有效值
//    A6,
//
//    //A相电流14次谐波有效值
//    A6,
//
//    //A相电流15次谐波有效值
//    A6,
//
//    //A相电流16次谐波有效值
//    A6,
//
//    //A相电流17次谐波有效值
//    A6,
//
//    //A相电流18次谐波有效值
//    A6,
//
//    //A相电流19次谐波有效值
//    A6,
//
//    //B相电流2次谐波有效值
//    A6,
//
//    //B相电流3次谐波有效值
//    A6,
//
//    //B相电流4次谐波有效值
//    A6,
//
//    //B相电流5次谐波有效值
//    A6,
//
//    //B相电流6次谐波有效值
//    A6,
//
//    //B相电流7次谐波有效值
//    A6,
//
//    //B相电流8次谐波有效值
//    A6,
//
//    //B相电流9次谐波有效值
//    A6,
//
//    //B相电流10次谐波有效值
//    A6,
//
//    //B相电流11次谐波有效值
//    A6,
//
//    //B相电流12次谐波有效值
//    A6,
//
//    //B相电流13次谐波有效值
//    A6,
//
//    //B相电流14次谐波有效值
//    A6,
//
//    //B相电流15次谐波有效值
//    A6,
//
//    //B相电流16次谐波有效值
//    A6,
//
//    //B相电流17次谐波有效值
//    A6,
//
//    //B相电流18次谐波有效值
//    A6,
//
//    //B相电流19次谐波有效值
//    A6,
//
//    //C相电流2次谐波有效值
//    A6,
//
//    //C相电流3次谐波有效值
//    A6,
//
//    //C相电流4次谐波有效值
//    A6,
//
//    //C相电流5次谐波有效值
//    A6,
//
//    //C相电流6次谐波有效值
//    A6,
//
//    //C相电流7次谐波有效值
//    A6,
//
//    //C相电流8次谐波有效值
//    A6,
//
//    //C相电流9次谐波有效值
//    A6,
//
//    //C相电流10次谐波有效值
//    A6,
//
//    //C相电流11次谐波有效值
//    A6,
//
//    //C相电流12次谐波有效值
//    A6,
//
//    //C相电流13次谐波有效值
//    A6,
//
//    //C相电流14次谐波有效值
//    A6,
//
//    //C相电流15次谐波有效值
//    A6,
//
//    //C相电流16次谐波有效值
//    A6,
//
//    //C相电流17次谐波有效值
//    A6,
//
//    //C相电流18次谐波有效值
//    A6,
//
//    //C相电流19次谐波有效值
//    A6,
//
//    //当前A相电压总谐波含有率
//    A5,
//
//    //当前A相电压2次谐波含有率
//    A5,
//
//    //当前A相电压3次谐波含有率
//    A5,
//
//    //当前A相电压4次谐波含有率
//    A5,
//
//    //当前A相电压5次谐波含有率
//    A5,
//
//    //当前A相电压6次谐波含有率
//    A5,
//
//    //当前A相电压7次谐波含有率
//    A5,
//
//    //当前A相电压8次谐波含有率
//    A5,
//
//    //当前A相电压9次谐波含有率
//    A5,
//
//    //当前A相电压10次谐波含有率
//    A5,
//
//    //当前A相电压11次谐波含有率
//    A5,
//
//    //当前A相电压12次谐波含有率
//    A5,
//
//    //当前A相电压13次谐波含有率
//    A5,
//
//    //当前A相电压14次谐波含有率
//    A5,
//
//    //当前A相电压15次谐波含有率
//    A5,
//
//    //当前A相电压16次谐波含有率
//    A5,
//
//    //当前A相电压17次谐波含有率
//    A5,
//
//    //当前A相电压18次谐波含有率
//    A5,
//
//    //当前A相电压19次谐波含有率
//    A5,
//
//    //当前B相电压总谐波含有率
//    A5,
//
//    //当前B相电压2次谐波含有率
//    A5,
//
//    //当前B相电压3次谐波含有率
//    A5,
//
//    //当前B相电压4次谐波含有率
//    A5,
//
//    //当前B相电压5次谐波含有率
//    A5,
//
//    //当前B相电压6次谐波含有率
//    A5,
//
//    //当前B相电压7次谐波含有率
//    A5,
//
//    //当前B相电压8次谐波含有率
//    A5,
//
//    //当前B相电压9次谐波含有率
//    A5,
//
//    //当前B相电压10次谐波含有率
//    A5,
//
//    //当前B相电压11次谐波含有率
//    A5,
//
//    //当前B相电压12次谐波含有率
//    A5,
//
//    //当前B相电压13次谐波含有率
//    A5,
//
//    //当前B相电压14次谐波含有率
//    A5,
//
//    //当前B相电压15次谐波含有率
//    A5,
//
//    //当前B相电压16次谐波含有率
//    A5,
//
//    //当前B相电压17次谐波含有率
//    A5,
//
//    //当前B相电压18次谐波含有率
//    A5,
//
//    //当前B相电压19次谐波含有率
//    A5,
//
//    //当前C相电压总谐波含有率
//    A5,
//
//    //当前C相电压2次谐波含有率
//    A5,
//
//    //当前C相电压3次谐波含有率
//    A5,
//
//    //当前C相电压4次谐波含有率
//    A5,
//
//    //当前C相电压5次谐波含有率
//    A5,
//
//    //当前C相电压6次谐波含有率
//    A5,
//
//    //当前C相电压7次谐波含有率
//    A5,
//
//    //当前C相电压8次谐波含有率
//    A5,
//
//    //当前C相电压9次谐波含有率
//    A5,
//
//    //当前C相电压10次谐波含有率
//    A5,
//
//    //当前C相电压11次谐波含有率
//    A5,
//
//    //当前C相电压12次谐波含有率
//    A5,
//
//    //当前C相电压13次谐波含有率
//    A5,
//
//    //当前C相电压14次谐波含有率
//    A5,
//
//    //当前C相电压15次谐波含有率
//    A5,
//
//    //当前C相电压16次谐波含有率
//    A5,
//
//    //当前C相电压17次谐波含有率
//    A5,
//
//    //当前C相电压18次谐波含有率
//    A5,
//
//    //当前C相电压19次谐波含有率
//    A5,
//
//    //当前A相电流总谐波含有率
//    A5,
//
//    //当前A相电流2次谐波含有率
//    A5,
//
//    //当前A相电流3次谐波含有率
//    A5,
//
//    //当前A相电流4次谐波含有率
//    A5,
//
//    //当前A相电流5次谐波含有率
//    A5,
//
//    //当前A相电流6次谐波含有率
//    A5,
//
//    //当前A相电流7次谐波含有率
//    A5,
//
//    //当前A相电流8次谐波含有率
//    A5,
//
//    //当前A相电流9次谐波含有率
//    A5,
//
//    //当前A相电流10次谐波含有率
//    A5,
//
//    //当前A相电流11次谐波含有率
//    A5,
//
//    //当前A相电流12次谐波含有率
//    A5,
//
//    //当前A相电流13次谐波含有率
//    A5,
//
//    //当前A相电流14次谐波含有率
//    A5,
//
//    //当前A相电流15次谐波含有率
//    A5,
//
//    //当前A相电流16次谐波含有率
//    A5,
//
//    //当前A相电流17次谐波含有率
//    A5,
//
//    //当前A相电流18次谐波含有率
//    A5,
//
//    //当前A相电流19次谐波含有率
//    A5,
//
//    //当前B相电流总谐波含有率
//    A5,
//
//    //当前B相电流2次谐波含有率
//    A5,
//
//    //当前B相电流3次谐波含有率
//    A5,
//
//    //当前B相电流4次谐波含有率
//    A5,
//
//    //当前B相电流5次谐波含有率
//    A5,
//
//    //当前B相电流6次谐波含有率
//    A5,
//
//    //当前B相电流7次谐波含有率
//    A5,
//
//    //当前B相电流8次谐波含有率
//    A5,
//
//    //当前B相电流9次谐波含有率
//    A5,
//
//    //当前B相电流10次谐波含有率
//    A5,
//
//    //当前B相电流11次谐波含有率
//    A5,
//
//    //当前B相电流12次谐波含有率
//    A5,
//
//    //当前B相电流13次谐波含有率
//    A5,
//
//    //当前B相电流14次谐波含有率
//    A5,
//
//    //当前B相电流15次谐波含有率
//    A5,
//
//    //当前B相电流16次谐波含有率
//    A5,
//
//    //当前B相电流17次谐波含有率
//    A5,
//
//    //当前B相电流18次谐波含有率
//    A5,
//
//    //当前B相电流19次谐波含有率
//    A5,
//
//    //当前C相电流总谐波含有率
//    A5,
//
//    //当前C相电流2次谐波含有率
//    A5,
//
//    //当前C相电流3次谐波含有率
//    A5,
//
//    //当前C相电流4次谐波含有率
//    A5,
//
//    //当前C相电流5次谐波含有率
//    A5,
//
//    //当前C相电流6次谐波含有率
//    A5,
//
//    //当前C相电流7次谐波含有率
//    A5,
//
//    //当前C相电流8次谐波含有率
//    A5,
//
//    //当前C相电流9次谐波含有率
//    A5,
//
//    //当前C相电流10次谐波含有率
//    A5,
//
//    //当前C相电流11次谐波含有率
//    A5,
//
//    //当前C相电流12次谐波含有率
//    A5,
//
//    //当前C相电流13次谐波含有率
//    A5,
//
//    //当前C相电流14次谐波含有率
//    A5,
//
//    //当前C相电流15次谐波含有率
//    A5,
//
//    //当前C相电流16次谐波含有率
//    A5,
//
//    //当前C相电流17次谐波含有率
//    A5,
//
//    //当前C相电流18次谐波含有率
//    A5,
//
//    //当前C相电流19次谐波含有率
//    A5
//};
//
//
//
//
//
////测量点曲线数据
//const int measure_curve_data[] =
//{
//    A15,    //日期
//
//    BIN1_29,//密度
//
//    BIN1_29,//点数
//
//    A9,//功率曲线类型
//
//    A7,//电压曲线类型
//
//    A25,//电流曲线类型
//
//    A5, //功率因素曲线
//
//    A2,//直流模拟量数据曲线
//};
//
//
////直流模拟量日数据
//const int dcanalog_day_data[] =
//{
//
//
//    A20,  //日数据时标
//
//    BIN2_30,//直流模拟量越上限日累计时间
//
//    BIN2_30,//直流模拟量越下限日累计时间
//
//    A2,//直流模拟量日最大值
//
//    A18,//直流模拟量日最大值发生时间
//
//    A2,//直流模拟量日最小值
//
//    A18//直流模拟量日最小值发生时间
//
//};
//
//
////直流模拟量月数据
//const int dcanalog_month_data[] =
//{
//    A21,  //月数据时标
//
//    BIN2_30,//直流模拟量越上限月累计时间
//
//    BIN2_30,//直流模拟量越下限月累计时间
//
//    A2,//直流模拟量月最大值
//
//    A18,//直流模拟量月最大值发生时间
//
//    A2,//直流模拟量月最小值
//
//    A18//直流模拟量月最小值发生时间
//};
//
//
//
////测量点日数据——电压谐波数据
//const int daily_data_vharmonic[] =
//{
//
//    A20,  //日数据时标
//
//    /*A相2－19次谐波电压含有率日最大值及发生时间*/
//    A5,//A相2次谐波电压含有率日最大值
//
//    A17,//A相2次谐波电压含有率日最大值发生时间
//
//    A5,//A相3次谐波电压含有率日最大值
//
//    A17,//A相3次谐波电压含有率日最大值发生时间
//
//    A5,//A相4次谐波电压含有率日最大值
//
//    A17,//A相4次谐波电压含有率日最大值发生时间
//
//    A5,//A相5次谐波电压含有率日最大值
//
//    A17,//A相5次谐波电压含有率日最大值发生时间
//
//    A5,//A相6次谐波电压含有率日最大值
//
//    A17,//A相6次谐波电压含有率日最大值发生时间
//
//    A5,//A相7次谐波电压含有率日最大值
//
//    A17,//A相7次谐波电压含有率日最大值发生时间
//
//    A5,//A相8次谐波电压含有率日最大值
//
//    A17,//A相8次谐波电压含有率日最大值发生时间
//
//    A5,//A相9次谐波电压含有率日最大值
//
//    A17,//A相9次谐波电压含有率日最大值发生时间
//
//    A5,//A相10次谐波电压含有率日最大值
//
//    A17,//A相10次谐波电压含有率日最大值发生时间
//
//    A5,//A相11次谐波电压含有率日最大值
//
//    A17,//A相11次谐波电压含有率日最大值发生时间
//
//    A5,//A相12次谐波电压含有率日最大值
//
//    A17,//A相12次谐波电压含有率日最大值发生时间
//
//    A5,//A相13次谐波电压含有率日最大值
//
//    A17,//A相13次谐波电压含有率日最大值发生时间
//
//    A5,//A相14次谐波电压含有率日最大值
//
//    A17,//A相14次谐波电压含有率日最大值发生时间
//
//    A5,//A相15次谐波电压含有率日最大值
//
//    A17,//A相15次谐波电压含有率日最大值发生时间
//
//    A5,//A相16次谐波电压含有率日最大值
//
//    A17,//A相16次谐波电压含有率日最大值发生时间
//
//    A5,//A相17次谐波电压含有率日最大值
//
//    A17,//A相17次谐波电压含有率日最大值发生时间
//
//    A5,//A相18次谐波电压含有率日最大值
//
//    A17,//A相18次谐波电压含有率日最大值发生时间
//
//    A5,//A相19次谐波电压含有率日最大值
//
//    A17,//A相19次谐波电压含有率日最大值发生时间
//
//    //A相总谐波电压含有率日最大值及+A相总畸变电压含有率日最大值发生时间
//    A5,//A相总谐波电压含有率日最大值
//
//    A17,//A相总谐波电压含有率日最大值发生时间
//
//
//    /*B相2－19次谐波电压含有率日最大值及发生时间*/
//    A5,//B相2次谐波电压含有率日最大值
//
//    A17,//B相2次谐波电压含有率日最大值发生时间
//
//    A5,//B相3次谐波电压含有率日最大值
//
//    A17,//B相3次谐波电压含有率日最大值发生时间
//
//    A5,//B相4次谐波电压含有率日最大值
//
//    A17,//B相4次谐波电压含有率日最大值发生时间
//
//    A5,//B相5次谐波电压含有率日最大值
//
//    A17,//B相5次谐波电压含有率日最大值发生时间
//
//    A5,//B相6次谐波电压含有率日最大值
//
//    A17,//B相6次谐波电压含有率日最大值发生时间
//
//    A5,//B相7次谐波电压含有率日最大值
//
//    A17,//B相7次谐波电压含有率日最大值发生时间
//
//    A5,//B相8次谐波电压含有率日最大值
//
//    A17,//B相8次谐波电压含有率日最大值发生时间
//
//    A5,//B相9次谐波电压含有率日最大值
//
//    A17,//B相9次谐波电压含有率日最大值发生时间
//
//    A5,//B相10次谐波电压含有率日最大值
//
//    A17,//B相10次谐波电压含有率日最大值发生时间
//
//    A5,//B相11次谐波电压含有率日最大值
//
//    A17,//B相11次谐波电压含有率日最大值发生时间
//
//    A5,//B相12次谐波电压含有率日最大值
//
//    A17,//B相12次谐波电压含有率日最大值发生时间
//
//    A5,//B相13次谐波电压含有率日最大值
//
//    A17,//B相13次谐波电压含有率日最大值发生时间
//
//    A5,//B相14次谐波电压含有率日最大值
//
//    A17,//B相14次谐波电压含有率日最大值发生时间
//
//    A5,//B相15次谐波电压含有率日最大值
//
//    A17,//B相15次谐波电压含有率日最大值发生时间
//
//    A5,//B相16次谐波电压含有率日最大值
//
//    A17,//B相16次谐波电压含有率日最大值发生时间
//
//    A5,//B相17次谐波电压含有率日最大值
//
//    A17,//B相17次谐波电压含有率日最大值发生时间
//
//    A5,//B相18次谐波电压含有率日最大值
//
//    A17,//B相18次谐波电压含有率日最大值发生时间
//
//    A5,//B相19次谐波电压含有率日最大值
//
//    A17,//B相19次谐波电压含有率日最大值发生时间
//
//    //B相总谐波电压含有率日最大值及+A相总畸变电压含有率日最大值发生时间
//    A5,//B相总谐波电压含有率日最大值
//
//    A17,//B相总谐波电压含有率日最大值发生时间
//
//
//
//    /*C相2－19次谐波电压含有率日最大值及发生时间*/
//    A5,//C相2次谐波电压含有率日最大值
//
//    A17,//C相2次谐波电压含有率日最大值发生时间
//
//    A5,//C相3次谐波电压含有率日最大值
//
//    A17,//C相3次谐波电压含有率日最大值发生时间
//
//    A5,//C相4次谐波电压含有率日最大值
//
//    A17,//C相4次谐波电压含有率日最大值发生时间
//
//    A5,//C相5次谐波电压含有率日最大值
//
//    A17,//C相5次谐波电压含有率日最大值发生时间
//
//    A5,//C相6次谐波电压含有率日最大值
//
//    A17,//C相6次谐波电压含有率日最大值发生时间
//
//    A5,//C相7次谐波电压含有率日最大值
//
//    A17,//C相7次谐波电压含有率日最大值发生时间
//
//    A5,//C相8次谐波电压含有率日最大值
//
//    A17,//C相8次谐波电压含有率日最大值发生时间
//
//    A5,//C相9次谐波电压含有率日最大值
//
//    A17,//C相9次谐波电压含有率日最大值发生时间
//
//    A5,//C相10次谐波电压含有率日最大值
//
//    A17,//C相10次谐波电压含有率日最大值发生时间
//
//    A5,//C相11次谐波电压含有率日最大值
//
//    A17,//C相11次谐波电压含有率日最大值发生时间
//
//    A5,//C相12次谐波电压含有率日最大值
//
//    A17,//C相12次谐波电压含有率日最大值发生时间
//
//    A5,//C相13次谐波电压含有率日最大值
//
//    A17,//C相13次谐波电压含有率日最大值发生时间
//
//    A5,//C相14次谐波电压含有率日最大值
//
//    A17,//C相14次谐波电压含有率日最大值发生时间
//
//    A5,//C相15次谐波电压含有率日最大值
//
//    A17,//C相15次谐波电压含有率日最大值发生时间
//
//    A5,//C相16次谐波电压含有率日最大值
//
//    A17,//C相16次谐波电压含有率日最大值发生时间
//
//    A5,//C相17次谐波电压含有率日最大值
//
//    A17,//C相17次谐波电压含有率日最大值发生时间
//
//    A5,//C相18次谐波电压含有率日最大值
//
//    A17,//C相18次谐波电压含有率日最大值发生时间
//
//    A5,//C相19次谐波电压含有率日最大值
//
//    A17,//C相19次谐波电压含有率日最大值发生时间
//
//    //C相总谐波电压含有率日最大值及+A相总畸变电压含有率日最大值发生时间
//    A5,//C相总谐波电压含有率日最大值
//
//    A17,//C相总谐波电压含有率日最大值发生时间
//
//};
//
//
//
//
//
////测量点日数据——电流谐波类数据
//const int daily_data_charmonic[] =
//{
//    A20,  //日数据时标
//
//
//    /*A相2－19次谐波电流日最大值及发生时间*/
//    A6,//A相2次谐波电流日最大值
//
//    A17,//A相2次谐波电流日最大值发生时间
//
//    A6,//A相3次谐波电流日最大值
//
//    A17,//A相3次谐波电流日最大值发生时间
//
//
//    A6,//A相4次谐波电流日最大值
//
//    A17,//A相4次谐波电流日最大值发生时间
//
//    A6,//A相5次谐波电流日最大值
//
//    A17,//A相5次谐波电流日最大值发生时间
//
//    A6,//A相6次谐波电流日最大值
//
//    A17,//A相6次谐波电流日最大值发生时间
//
//    A6,//A相7次谐波电流日最大值
//
//    A17,//A相7次谐波电流日最大值发生时间
//
//    A6,//A相8次谐波电流日最大值
//
//    A17,//A相8次谐波电流日最大值发生时间
//
//    A6,//A相9次谐波电流日最大值
//
//    A17,//A相9次谐波电流日最大值发生时间
//
//    A6,//A相10次谐波电流日最大值
//
//    A17,//A相10次谐波电流日最大值发生时间
//
//    A6,//A相11次谐波电流日最大值
//
//    A17,//A相11次谐波电流日最大值发生时间
//
//    A6,//A相12次谐波电流日最大值
//
//    A17,//A相12次谐波电流日最大值发生时间
//
//    A6,//A相13次谐波电流日最大值
//
//    A17,//A相13次谐波电流日最大值发生时间
//
//    A6,//A相14次谐波电流日最大值
//
//    A17,//A相14次谐波电流日最大值发生时间
//
//    A6,//A相15次谐波电流日最大值
//
//    A17,//A相15次谐波电流日最大值发生时间
//
//    A6,//A相16次谐波电流日最大值
//
//    A17,//A相16次谐波电流日最大值发生时间
//
//    A6,//A相17次谐波电流日最大值
//
//    A17,//A相17次谐波电流日最大值发生时间
//
//    A6,//A相18次谐波电流日最大值
//
//    A17,//A相18次谐波电流日最大值发生时间
//
//    A6,//A相19次谐波电流日最大值
//
//    A17,//A相19次谐波电流日最大值发生时间
//    /*A相总畸变电流日最大值+A相总畸变电流日最大值发生时间*/
//    A6,//A相总畸变电流日最大值
//
//    A17,//A相总畸变电流日最大值发生时间
//
//
//    /*B相2－19次谐波电流日最大值及发生时间*/
//    A6,//B相2次谐波电流日最大值
//
//    A17,//B相2次谐波电流日最大值发生时间
//
//    A6,//B相3次谐波电流日最大值
//
//    A17,//B相3次谐波电流日最大值发生时间
//
//
//    A6,//B相4次谐波电流日最大值
//
//    A17,//B相4次谐波电流日最大值发生时间
//
//    A6,//B相5次谐波电流日最大值
//
//    A17,//B相5次谐波电流日最大值发生时间
//
//    A6,//B相6次谐波电流日最大值
//
//    A17,//B相6次谐波电流日最大值发生时间
//
//    A6,//B相7次谐波电流日最大值
//
//    A17,//B相7次谐波电流日最大值发生时间
//
//    A6,//B相8次谐波电流日最大值
//
//    A17,//B相8次谐波电流日最大值发生时间
//
//    A6,//B相9次谐波电流日最大值
//
//    A17,//B相9次谐波电流日最大值发生时间
//
//
//    A6,//B相10次谐波电流日最大值
//
//    A17,//B相10次谐波电流日最大值发生时间
//
//
//    A6,//B相11次谐波电流日最大值
//
//    A17,//B相11次谐波电流日最大值发生时间
//
//    A6,//B相12次谐波电流日最大值
//
//    A17,//B相12次谐波电流日最大值发生时间
//
//    A6,//B相13次谐波电流日最大值
//
//    A17,//B相13次谐波电流日最大值发生时间
//
//    A6,//B相14次谐波电流日最大值
//
//    A17,//B相14次谐波电流日最大值发生时间
//
//    A6,//B相15次谐波电流日最大值
//
//    A17,//B相15次谐波电流日最大值发生时间
//
//    A6,//B相16次谐波电流日最大值
//
//    A17,//B相16次谐波电流日最大值发生时间
//
//    A6,//B相17次谐波电流日最大值
//
//    A17,//B相17次谐波电流日最大值发生时间
//
//    A6,//B相18次谐波电流日最大值
//
//    A17,//B相18次谐波电流日最大值发生时间
//
//    A6,//B相19次谐波电流日最大值
//
//    A17,//B相19次谐波电流日最大值发生时间
//    /*B相总畸变电流日最大值+A相总畸变电流日最大值发生时间*/
//    A6,//B相总畸变电流日最大值
//
//    A17,//B相总畸变电流日最大值发生时间
//
//
//    /*C相2－19次谐波电流日最大值及发生时间*/
//    A6,//C相2次谐波电流日最大值
//
//    A17,//C相2次谐波电流日最大值发生时间
//
//    A6,//C相3次谐波电流日最大值
//
//    A17,//C相3次谐波电流日最大值发生时间
//
//
//    A6,//C相4次谐波电流日最大值
//
//    A17,//C相4次谐波电流日最大值发生时间
//
//    A6,//C相5次谐波电流日最大值
//
//    A17,//C相5次谐波电流日最大值发生时间
//
//    A6,//C相6次谐波电流日最大值
//
//    A17,//C相6次谐波电流日最大值发生时间
//
//    A6,//C相7次谐波电流日最大值
//
//    A17,//C相7次谐波电流日最大值发生时间
//
//    A6,//C相8次谐波电流日最大值
//
//    A17,//C相8次谐波电流日最大值发生时间
//
//    A6,//C相9次谐波电流日最大值
//
//    A17,//C相9次谐波电流日最大值发生时间
//
//    A6,//C相10次谐波电流日最大值
//
//    A17,//C相10次谐波电流日最大值发生时间
//
//    A6,//C相11次谐波电流日最大值
//
//    A17,//C相11次谐波电流日最大值发生时间
//
//    A6,//C相12次谐波电流日最大值
//
//    A17,//C相12次谐波电流日最大值发生时间
//
//    A6,//C相13次谐波电流日最大值
//
//    A17,//C相13次谐波电流日最大值发生时间
//
//    A6,//C相14次谐波电流日最大值
//
//    A17,//C相14次谐波电流日最大值发生时间
//
//    A6,//C相15次谐波电流日最大值
//
//    A17,//C相15次谐波电流日最大值发生时间
//
//    A6,//C相16次谐波电流日最大值
//
//    A17,//C相16次谐波电流日最大值发生时间
//
//
//    A6,//C相17次谐波电流日最大值
//
//    A17,//C相17次谐波电流日最大值发生时间
//
//    A6,//C相18次谐波电流日最大值
//
//    A17,//C相18次谐波电流日最大值发生时间
//
//    A6,//C相19次谐波电流日最大值
//
//    A17,//C相19次谐波电流日最大值发生时间
//    /*C相总畸变电流日最大值+A相总畸变电流日最大值发生时间*/
//    A6,//C相总畸变电流日最大值
//
//    A17,//C相总畸变电流日最大值发生时间
//
//
//};
//
////测量点日电能示值数据
//const int measure_day_powervalue[]=
//{
//
//    A20, //数据时标
//    //正向有功总电能示值
//    A14,//正向有功总电能示值
//
//    A14,//费率1正向有功电能示值
//
//    A14,//费率2正向有功电能示值
//
//    A14,//费率3正向有功电能示值
//
//    A14,//费率4正向有功电能示值
//
//
//
//    //正向无功
//    A11,//正向无功总电能示值
//
//    A11,//正向无功费率1电能示值
//
//    A11,//正向无功费率2电能示值
//
//    A11,//正向无功费率3电能示值
//
//    A11,//正向无功费率4电能示值
//
//    //一象限无功
//
//    A11,//一象限无功总电能示值
//
//    A11,//一象限无功费率1电能示值
//
//    A11,//一象限无功费率2电能示值
//
//    A11,//一象限无功费率3电能示值
//
//    A11,//一象限无功费率4电能示值
//
//    //四象限无功
//    A11,//四象限无功总电能示值
//
//    A11,//四象限无功费率1电能示值
//
//    A11,//四象限无功费率2电能示值
//
//    A11,//四象限无功费率3电能示值
//
//    A11,//四象限无功费率4电能示值
//
//
//    //反向有功
//    A14,//反向有功总电能示值
//
//    A14,//费率1反向有功电能示值
//
//    A14,//费率2反向有功电能示值
//
//    A14,//费率3反向有功电能示值
//
//    A14,//费率4反向有功电能示值
//
//
//    //反向无功
//    A11,//反向无功总电能示值
//
//    A11,//反向无功费率1电能示值
//
//    A11,//反向无功费率2电能示值
//
//    A11,//反向无功费率3电能示值
//
//    A11,//反向无功费率4电能示值
//
//
//    //二象限无功
//    A11,//二象限无功总电能示值
//
//    A11,//二象限无功费率1电能示值
//
//    A11,//二象限无功费率2电能示值
//
//    A11,//二象限无功费率3电能示值
//
//    A11,//二象限无功费率4电能示值
//
//
//    //三象限无功
//    A11,//三象限无功总电能示值
//
//    A11,//三象限无功费率1电能示值
//
//    A11,//三象限无功费率2电能示值
//
//    A11,//三象限无功费率3电能示值
//
//    A11,//三象限无功费率4电能示值
//
//
//
//    //正向无功（组合无功1）
//    A11,//正向无功总电能示值
//
//    A11,//正向无功费率1电能示值
//
//    A11,//正向无功费率2电能示值
//
//    A11,//正向无功费率3电能示值
//
//    A11,//正向无功费率4电能示值
//
//    //反向无功（组合无功1）
//    A11,//反向无功总电能示值
//
//    A11,//反向无功费率1电能示值
//
//    A11,//反向无功费率2电能示值
//
//    A11,//反向无功费率3电能示值
//
//    A11,//反向无功费率4电能示值
//
//};
//
//
////测量点月电能示值数据
//const int measure_month_powervalue[]=
//{
//    A21,  //数据时标
//
//    //正向有功总电能示值
//    A14,//正向有功总电能示值
//
//    A14,//费率1正向有功电能示值
//
//    A14,//费率2正向有功电能示值
//
//    A14,//费率3正向有功电能示值
//
//    A14,//费率4正向有功电能示值
//
//
//
//    //正向无功
//    A11,//正向无功总电能示值
//
//    A11,//正向无功费率1电能示值
//
//    A11,//正向无功费率2电能示值
//
//    A11,//正向无功费率3电能示值
//
//    A11,//正向无功费率4电能示值
//
//    //一象限无功
//    A11,//一象限无功总电能示值
//
//    A11,//一象限无功费率1电能示值
//
//    A11,//一象限无功费率2电能示值
//
//    A11,//一象限无功费率3电能示值
//
//    A11,//一象限无功费率4电能示值
//    //四象限无功
//    A11,//四象限无功总电能示值
//
//    A11,//四象限无功费率1电能示值
//
//    A11,//四象限无功费率2电能示值
//
//    A11,//四象限无功费率3电能示值
//
//    A11,//四象限无功费率4电能示值
//
//
//    //反向有功
//    A14,//反向有功总电能示值
//
//    A14,//费率1反向有功电能示值
//
//    A14,//费率2反向有功电能示值
//
//    A14,//费率3反向有功电能示值
//
//    A14,//费率4反向有功电能示值
//
//
//    //反向无功
//    A11,//反向无功总电能示值
//
//    A11,//反向无功费率1电能示值
//
//    A11,//反向无功费率2电能示值
//
//    A11,//反向无功费率3电能示值
//
//    A11,//反向无功费率4电能示值
//
//
//    //二象限无功
//    A11,//二象限无功总电能示值
//
//    A11,//二象限无功费率1电能示值
//
//    A11,//二象限无功费率2电能示值
//
//    A11,//二象限无功费率3电能示值
//
//    A11,//二象限无功费率4电能示值
//
//
//    //三象限无功
//    A11,//三象限无功总电能示值
//
//    A11,//三象限无功费率1电能示值
//
//    A11,//三象限无功费率2电能示值
//
//    A11,//三象限无功费率3电能示值
//
//    A11,//三象限无功费率4电能示值
//
//
//
//    //正向无功（组合无功1）
//    A11,//正向无功总电能示值
//
//    A11,//正向无功费率1电能示值
//
//    A11,//正向无功费率2电能示值
//
//    A11,//正向无功费率3电能示值
//
//    A11,//正向无功费率4电能示值
//
//    //反向无功（组合无功1）
//    A11,//反向无功总电能示值
//
//    A11,//反向无功费率1电能示值
//
//    A11,//反向无功费率2电能示值
//
//    A11,//反向无功费率3电能示值
//
//    A11,//反向无功费率4电能示值
//
//
//};
//
//
////历史数据测量日统计数据
//const int measure_day_sta[]=
//{
//    A20,   //日数据时标
//    BIN2_30,//A相电压越上上限月累计时间
//
//    BIN2_30,//A相电压越下下限月累计时间
//
//    BIN2_30,//A相电压越上限月累计时间
//
//    BIN2_30,//A相电压越下限月累计时间
//
//    BIN2_30,//A相电压合格月累计时间
//
//
//    BIN2_30,//B相电压越上上限月累计时间
//
//    BIN2_30,//B相电压越下下限月累计时间
//
//    BIN2_30,//B相电压越上限月累计时间
//
//    BIN2_30,//B相电压越下限月累计时间
//
//    BIN2_30,//B相电压合格月累计时间
//
//
//    BIN2_30,//C相电压越上上限月累计时间
//
//    BIN2_30,//C相电压越下下限月累计时间
//
//    BIN2_30,//C相电压越上限月累计时间
//
//    BIN2_30,//C相电压越下限月累计时间
//
//    BIN2_30,//C相电压合格月累计时间
//
//
//    A7,//A相电压最大值
//
//    A18,//A相电压最大值发生时间
//
//    A7,//A相电压最小值
//
//    A18,//A相电压最小值发生时间
//
//    A7,//B相电压最大值
//
//    A18,//B相电压最大值发生时间
//
//    A7,//B相电压最小值
//
//    A18,//B相电压最小值发生时间
//
//
//    A7,//C相电压最大值
//
//    A18,//C相电压最大值发生时间
//
//    A7,//C相电压最小值
//
//    A18,//C相电压最小值发生时间
//
//    A7,//A相平均电压
//
//    A7,//B相平均电压
//
//    A7,//C相平均电压
//
//
//
//    A25,//A相电压越上限率
//
//    A25,//A相电压越下限率
//
//    A25,//A相电压合格率
//
//    A25,//B相电压越上限率
//
//    A25,//B相电压越下限率
//
//    A25,//B相电压合格率
//
//
//    A25,//C相电压越上限率
//
//    A25,//C相电压越下限率
//
//    A25,//C相电压合格率
//
//    //日冻结日不平衡度越限累计时间 发生时间不相同
//    BIN2_30,//电流不平衡度越限月累计时间
//
//    BIN2_30,//电压不平衡度越限月累计时间
//
//    A5,//电流不平衡最大值
//
//    A18,//电流不平衡最大值发生时间
//
//    A5,//电压不平衡最大值
//
//    A18,//电压不平衡最大值发生时间
//
//
//
//    BIN2_30,//A相电流越上上限月累计时间
//
//    BIN2_30,//A相电流越上限月累计时间
//
//    BIN2_30,//B相电流越上上限月累计时间
//
//    BIN2_30,//B相电流越上限月累计时间
//
//    BIN2_30,//C相电流越上上限月累计时间
//
//    BIN2_30,//C相电流越上限月累计时间
//
//    BIN2_30,//零序电流越上限月累计时间
//
//
//
//
//    A25,//A相电流最大值
//
//    A18,//A相电流最大值发生时间
//
//    A25,//B相电流最大值
//
//    A18,//B相电流最大值发生时间
//
//    A25,//C相电流最大值
//
//    A18,//C相电流最大值发生时间
//
//    A25,//零序电流最大值
//
//    A18,//零序电流最大值发生时间
//
//
//
//    BIN2_30,//视在功率越上上限日累计时间
//
//    BIN2_30,//视在功率越上限日累计时间
//
//
//
//    BIN2_30,//区段1累计时间（功率因数＜定值1）
//
//    BIN2_30,//区段2累计时间（定值1≤功率因数＜定值2）
//
//    BIN2_30,//区段3累计时间（功率因数≥定值2）
//
//    A23,//三相总最大有功功率
//
//    A18,//三相总最大有功功率发生时间
//
//    A23,//A相最大有功功率
//
//    A18,//A相最大有功功率发生时间
//
//    A23,//B相最大有功功率
//
//    A18,//B相最大有功功率发生时间
//
//    A23,//C相最大有功功率
//
//    A18,//C相最大有功功率发生时间
//
//
//    BIN2_30,//三相总有功功率为零时间
//
//    BIN2_30,//A相有功功率为零时间
//
//    BIN2_30,//B相有功功率为零时间
//
//    BIN2_30,//C相有功功率为零时间
//
//
//};
//
//
//
////历史数据测量点月统计数据
//const int measure_month_sta[]=
//{
//
//    A21,//月数据时标
//
//    BIN2_30,//A相电压越上上限月累计时间
//
//    BIN2_30,//A相电压越下下限月累计时间
//
//    BIN2_30,//A相电压越上限月累计时间
//
//    BIN2_30,//A相电压越下限月累计时间
//
//    BIN2_30,//A相电压合格月累计时间
//
//
//    BIN2_30,//B相电压越上上限月累计时间
//
//    BIN2_30,//B相电压越下下限月累计时间
//
//    BIN2_30,//B相电压越上限月累计时间
//
//    BIN2_30,//B相电压越下限月累计时间
//
//    BIN2_30,//B相电压合格月累计时间
//
//
//    BIN2_30,//C相电压越上上限月累计时间
//
//    BIN2_30,//C相电压越下下限月累计时间
//
//    BIN2_30,//C相电压越上限月累计时间
//
//    BIN2_30,//C相电压越下限月累计时间
//
//    BIN2_30,//C相电压合格月累计时间
//
//
//    A7,//A相电压最大值
//
//    A18,//A相电压最大值发生时间
//
//    A7,//A相电压最小值
//
//    A18,//A相电压最小值发生时间
//
//    A7,//B相电压最大值
//
//    A18,//B相电压最大值发生时间
//
//    A7,//B相电压最小值
//
//    A18,//B相电压最小值发生时间
//
//
//    A7,//C相电压最大值
//
//    A18,//C相电压最大值发生时间
//
//    A7,//C相电压最小值
//
//    A18,//C相电压最小值发生时间
//
//    A7,//A相平均电压
//
//    A7,//B相平均电压
//
//    A7,//C相平均电压
//
//
//    A25,//A相电压越上限率
//
//    A25,//A相电压越下限率
//
//    A25,//A相电压合格率
//
//    A25,//B相电压越上限率
//
//    A25,//B相电压越下限率
//
//    A25,//B相电压合格率
//
//
//    A25,//C相电压越上限率
//
//    A25,//C相电压越下限率
//
//    A25,//C相电压合格率
//
//
//    BIN2_30,//电流不平衡度越限月累计时间
//
//    BIN2_30,//电压不平衡度越限月累计时间
//
//    A5,//电流不平衡最大值
//
//    A17,//电流不平衡最大值发生时间
//
//    A5,//电压不平衡最大值
//
//    A17,//电压不平衡最大值发生时间
//
//
//
//    BIN2_30,//A相电流越上上限月累计时间
//
//    BIN2_30,//A相电流越上限月累计时间
//
//    BIN2_30,//B相电流越上上限月累计时间
//
//    BIN2_30,//B相电流越上限月累计时间
//
//    BIN2_30,//C相电流越上上限月累计时间
//
//    BIN2_30,//C相电流越上限月累计时间
//
//    BIN2_30,//零序电流越上限月累计时间
//
//
//
//
//    A25,//A相电流最大值
//
//    A18,//A相电流最大值发生时间
//
//    A25,//B相电流最大值
//
//    A18,//B相电流最大值发生时间
//
//    A25,//C相电流最大值
//
//    A18,//C相电流最大值发生时间
//
//    A25,//零序电流最大值
//
//    A18,//零序电流最大值发生时间
//
//
//
//    BIN2_30,//视在功率越上上限月累计时间
//
//    BIN2_30,//视在功率越上限月累计时间
//
//    BIN2_30,//区段1累计时间（功率因数＜定值1）
//
//    BIN2_30,//区段2累计时间（定值1≤功率因数＜定值2）
//
//    BIN2_30,//区段3累计时间（功率因数≥定值2）
//
//    A23,//三相总最大有功功率
//
//    A18,//三相总最大有功功率发生时间
//
//    A23,//A相最大有功功率
//
//    A18,//A相最大有功功率发生时间
//
//    A23,//B相最大有功功率
//
//    A18,//B相最大有功功率发生时间
//
//    A23,//C相最大有功功率
//
//    A18,//C相最大有功功率发生时间
//
//    BIN2_30,//三相总有功功率为零时间
//
//    BIN2_30,//A相有功功率为零时间
//
//    BIN2_30,//B相有功功率为零时间
//
//    BIN2_30,//C相有功功率为零时间
//
//};
//
//
//
//
//
//
//
//
////测量点日需量数据类型
//const int history_day_powerneeds[]=
//{
//
//    A20, //日数据时标
//
//    //正向有功最大需量
//    A23,//正向有功总最大需量
//
//    A23,//费率1正向有功最大需量
//
//    A23,//费率2正向有功最大需量
//
//    A23,//费率3正向有功最大需量
//
//    A23,//费率4正向有功最大需量
//
//
//    //正向有功最大需量发生时间
//    A17,//正向有功总最大需量发生时间
//
//    A17,//费率1正向有功最大需量发生时间
//
//    A17,//费率2正向有功最大需量发生时间
//
//    A17,//费率3正向有功最大需量发生时间
//
//    A17,//费率4正向有功最大需量发生时间
//
//
//    //正向无功最大需量
//    A23,//正向无功总最大需量
//
//    A23,//费率1正向无功最大需量
//
//    A23,//费率2正向无功最大需量
//
//    A23,//费率3正向无功最大需量
//
//    A23,//费率4正向无功最大需量
//
//
//    //正向无功最大需量发生时间
//    A17,//正向无功总最大需量发生时间
//    A17,//费率1正向无功最大需量发生时间
//
//    A17,//费率2正向无功最大需量发生时间
//
//    A17,//费率3正向无功最大需量发生时间
//
//    A17,//费率4正向无功最大需量发生时间
//
//
//    //反向有功最大需量
//    A23,//反向有功总最大需量
//
//    A23,//费率1反向有功最大需量
//
//    A23,//费率2反向有功最大需量
//
//    A23,//费率3发向有功最大需量
//
//    A23,//费率4反向有功最大需量
//
//
//    //反向有功最大需量发生时间
//    A17,//反向有功总最大需量发生时间
//
//    A17,//费率1反向有功最大需量发生时间
//
//    A17,//费率2反向有功最大需量发生时间
//
//    A17,//费率3反向有功最大需量发生时间
//
//    A17,//费率4反向有功最大需量发生时间
//
//
//    //反向无功最大需量
//    A23,//反向无功总最大需量
//    A23,//费率1反向无功最大需量
//
//    A23,//费率2反向无功最大需量
//
//    A23,//费率3发向无功最大需量
//
//    A23,//费率4反向无功最大需量
//
//
//    //反向无功最大需量发生时间
//    A17,//反向无功总最大需量发生时间
//
//    A17,//费率1反向无功最大需量发生时间
//
//    A17,//费率2反向无功最大需量发生时间
//
//    A17,//费率3反向无功最大需量发生时间
//
//    A17,//费率4反向无功最大需量发生时间
//
//
//
//
//    //三向总有功最大需量
//    A23,//三相总有功最大需量
//
//    A18,//三相总有功最大需量发生时间
//
//    A23,//A相有功最大需量
//
//    A18,//A相有功最大需量发生时间
//
//    A23,//B相有功最大需量
//
//    A18,//B相有功最大需量发生时间
//
//    A23,//C相有功最大需量
//
//    A18,//C相有功最大需量发生时间
//
//};
//
////测量点月需量数据类型
//const int history_month_powerneeds[]=
//{
//    A21, //月数据时标
//
//    //正向有功最大需量
//    A23,//正向有功总最大需量
//
//    A23,//费率1正向有功最大需量
//
//    A23,//费率2正向有功最大需量
//
//    A23,//费率3正向有功最大需量
//
//    A23,//费率4正向有功最大需量
//
//
//
//    //正向有功最大需量发生时间
//    A17,//正向有功总最大需量发生时间
//
//    A17,//费率1正向有功最大需量发生时间
//
//    A17,//费率2正向有功最大需量发生时间
//
//    A17,//费率3正向有功最大需量发生时间
//
//    A17,//费率4正向有功最大需量发生时间
//
//
//
//    //正向无功最大需量
//    A23,//正向无功总最大需量
//
//    A23,//费率1正向无功最大需量
//
//    A23,//费率2正向无功最大需量
//
//    A23,//费率3正向无功最大需量
//
//    A23,//费率4正向无功最大需量
//
//
//
//    //正向无功最大需量发生时间
//    A17,//正向无功总最大需量发生时间
//
//    A17,//费率1正向无功最大需量发生时间
//
//    A17,//费率2正向无功最大需量发生时间
//
//    A17,//费率3正向无功最大需量发生时间
//
//    A17,//费率4正向无功最大需量发生时间
//
//
//
//    //反向有功最大需量
//    A23,//反向有功总最大需量
//
//    A23,//费率1反向有功最大需量
//
//    A23,//费率2反向有功最大需量
//
//    A23,//费率3发向有功最大需量
//
//    A23,//费率4反向有功最大需量
//
//
//    //反向有功最大需量发生时间
//
//    A17,//反向有功总最大需量发生时间
//
//    A17,//费率1反向有功最大需量发生时间
//
//    A17,//费率2反向有功最大需量发生时间
//
//    A17,//费率3反向有功最大需量发生时间
//
//    A17,//费率4反向有功最大需量发生时间
//
//
//
//    //反向无功最大需量
//    A23,//反向无功总最大需量
//
//    A23,//费率1反向无功最大需量
//
//    A23,//费率2反向无功最大需量
//
//    A23,//费率3发向无功最大需量
//
//    A23,//费率4反向无功最大需量
//
//
//    //反向无功最大需量发生时间
//    A17,//反向无功总最大需量发生时间
//
//    A17,//费率1反向无功最大需量发生时间
//
//    A17,//费率2反向无功最大需量发生时间
//
//    A17,//费率3反向无功最大需量发生时间
//
//    A17,//费率4反向无功最大需量发生时间
//
//
//    //三向总有功最大需量
//    A23,//三相总有功最大需量
//
//    A18,//三相总有功最大需量发生时间
//
//    A23,//A相有功最大需量
//
//    A18,//A相有功最大需量发生时间
//
//    A23,//B相有功最大需量
//
//    A18,//B相有功最大需量发生时间
//
//    A23,//C相有功最大需量
//
//    A18,//C相有功最大需量发生时间
//
//
//};

const COMPLEX_ITEM eventlist[] = {
    {STRING_35,"描述"}
};

char* type_desc[] = {
    "终端日统计数据","终端月统计数据","测量点日电能需量"
};

#endif


