//
//  XLDictionaryDataType.h
//  C_Protocol
//
//  Created by JY on 14-1-8.
//  Copyright (c) 2014年 XLDZ. All rights reserved.
//

#ifndef C_Protocol_XLDataTypeDic_h
#define C_Protocol_XLDataTypeDic_h
#include "XLDataType.h"

typedef struct COMPLEX_ITEM{
    int datatype;
    char* desc;
}COMPLEX_ITEM;


//数据格式列表枚举
enum typelist {
    
    //秒分时日 星期月 年
    A1 = 0,
    
    //G3 G2 G1 S 123
    A2,
    
    //0 G 0 S 1234567
    A3,
    
    //S0 12
    A4,
    
    //S 123.1 S为符号位 下同
    A5,
    
    //S 12.12
    A6,
    
    //123.1
    A7,
    
    //1234
    A8,
    
    //S 12.1234
    A9,
    
    //123456
    A10,
    
    //123456.12
    A11,
    
    //123456789123
    A12,
    
    //1234.1234
    A13,
    
    //123456.1234
    A14,
    
    //分时日月年
    A15,
    
    //秒分时日
    A16,
    
    //分时日月
    A17,
    
    //分时日
    A18,
    
    //分时
    A19,
    
    //日月年
    A20,
    
    //月年
    A21,
    
    //1.2
    A22,
    
    //12.1234
    A23,
    
    //时日
    A24,
    
    //S 123.123
    A25,
    
    //1.123
    A26,
    
    //12345678
    A27,
    
    //F 度分秒
    A28,
    
    //1字节BIN
    BIN1_29,
    
    //2字节BIN
    BIN2_30,
    
    //3字节BIN
    BIN3_31,
    
    //4字节BIN
    BIN4_32,
    
    //31字节BS
    BS248_33,
    
    //1字节BS
    BS8_34,
    
    //String类型
    STRING_35,
    
}DATATYPE;

//终端日统计数据
const COMPLEX_ITEM terminal_day_sta[] =
{
    {A20,"数据时标"},
    
    {BIN2_30,"终端日供电时间"},
    
    {BIN2_30,"终端日复位次数"}
};

//终端月统计数据
const COMPLEX_ITEM terminal_month_sta[] =
{
    {A21,"数据时标"},
    
    {BIN2_30,"终端日供电时间"},
    
    {BIN2_30,"终端日复位次数"}
};


//终端基本实时数据
const COMPLEX_ITEM terminal_rt_basic_sta[] =
{
    
    {BS248_33,"终端参数状态"},
    
    {BIN4_32,"终端与主站当日通信流量"},
    
    {BIN4_32,"终端与主站当月通信流量"},
    
    {BS8_34,"状态量的状态"},
    
    {BS8_34,"状态量变位标志"},
    
    {BIN1_29,"当前重要事件计数器EC1值"},
    
    {BIN1_29,"当前一般事件计数器EC2值"}
};

const COMPLEX_ITEM mtr_rt_basic_sta[] =
{
    
    {A9,"当前总有功功率"},
    
    {A9,"当前A相有功功率"},
    
    {A9,"当前B相有功功率"},
    
    {A9,"当前C相有功功率"},
    
    
    {A9,"当前总无功功率"},
    
    {A9,"当前A相无功功率"},
    
    {A9,"当前B相无功功率"},
    
    {A9,"当前C相无功功率"},
    
    
    {A5,"当前总功率因数"},
    
    {A5,"当前A相功率因数"},
    
    {A5,"当前B相功率因数"},
    
    {A5,"当前C相功率因数"},
    
    
    {A7,"当前A相电压"},
    
    {A7,"当前B相电压"},
    
    {A7,"当前C相电压"},
    
    
    {A25,"当前A相电流"},
    
    {A25,"当前B相电流"},
    
    {A25,"当前C相电流"},
    
    
    {A25,"当前零序电流"},
    
    
    {A9,"当前总视在功率"},
    
    {A9,"当前A相视在功率"},
    
    {A9,"当前B相视在功率"},
    
    {A9,"当前C相视在功率"},
    
    
    {A5,"A相电压相角"},
    
    {A5,"B相电压相角"},
    
    {A5,"C相电压相角"},
    
    
    {A5,"A相电流相角"},
    
    {A5,"B相电流相角"},
    
    {A5,"C相电流相角"}
};

const COMPLEX_ITEM rt_power_value_sta[] =
{
  
    {A14,"当前正向有功总电能示值"},
    
    {A14,"当前费率1正向有功总电能示值"},
    
    {A14,"当前费率2正向有功总电能示值"},
    
    {A14,"当前费率3正向有功总电能示值"},
    
    {A14,"当前费率4正向有功总电能示值"},
    
    
    {A11,"当前正向无功（组合无功1）总电能示值"},
    
    {A11,"当前费率1正向无功（组合无功1）总电能示值"},
    
    {A11,"当前费率2正向无功（组合无功1）总电能示值"},
    
    {A11,"当前费率3正向无功（组合无功1）总电能示值"},
    
    {A11,"当前费率4正向无功（组合无功1）总电能示值"},
    
    
    {A11,"当前一象限无功总电能示值"},
    
    {A11,"当前一象限费率1无功电能示值"},
    
    {A11,"当前一象限费率2无功电能示值"},
    
    {A11,"当前一象限费率3无功电能示值"},
    
    {A11,"当前一象限费率4无功电能示值"},
    

    {A11,"当前四象限无功总电能示值"},
    
    {A11,"当前四象限费率1无功电能示值"},
    
    {A11,"当前四象限费率2无功电能示值"},
    
    {A11,"当前四象限费率3无功电能示值"},
    
    {A11,"当前四象限费率4无功电能示值"},
    
    
    {A14,"当前反向有功总电能示值"},
    
    {A14,"当前费率1反向有功总电能示值"},
    
    {A14,"当前费率2反向有功总电能示值"},
    
    {A14,"当前费率3反向有功总电能示值"},
    
    {A14,"当前费率4反向有功总电能示值"},
    
    
    {A11,"当前反向无功（组合无功2）总电能示值"},

    {A11,"当前费率1反向无功（组合无功2）总电能示值"},
    
    {A11,"当前费率2反向无功（组合无功2）总电能示值"},
    
    {A11,"当前费率3反向无功（组合无功2）总电能示值"},
    
    {A11,"当前费率4反向无功（组合无功2）总电能示值"},
    
    
    {A11,"当前二象限无功总电能示值"},

    {A11,"当前二象限费率1无功电能示值"},
    
    {A11,"当前二象限费率2无功电能示值"},
    
    {A11,"当前二象限费率3无功电能示值"},
    
    {A11,"当前二象限费率4无功电能示值"},
    
    
    {A11,"当前三象限无功总电能示值"},

    {A11,"当前三象限费率1无功电能示值"},
    
    {A11,"当前三象限费率2无功电能示值"},
    
    {A11,"当前三象限费率3无功电能示值"},
    
    {A11,"当前三象限费率4无功电能示值"},
};

const COMPLEX_ITEM rt_power_needs_sta[]=
{
    {A23,"当月正向有功总最大需量"},
    
    {A23,"当月正向有功费率1最大需量"},
    
    {A23,"当月正向有功费率2最大需量"},
    
    {A23,"当月正向有功费率3最大需量"},
    
    {A23,"当月正向有功费率4最大需量"},
    
    
    {A17,"当月正向有功总最大需量发生时间"},
    
    {A17,"当月正向有功费率1最大需量发生时间"},
    
    {A17,"当月正向有功费率2最大需量发生时间"},
    
    {A17,"当月正向有功费率3最大需量发生时间"},
    
    {A17,"当月正向有功费率4最大需量发生时间"},
    
    
    {A23,"当月正向无功总最大需量"},
    
    {A23,"当月正向无功费率1最大需量"},
    
    {A23,"当月正向无功费率2最大需量"},
    
    {A23,"当月正向无功费率3最大需量"},
    
    {A23,"当月正向无功费率4最大需量"},
    
    
    {A17,"当月正向无功总最大需量发生时间"},
    
    {A17,"当月正向无功费率1最大需量发生时间"},
    
    {A17,"当月正向无功费率2最大需量发生时间"},
    
    {A17,"当月正向无功费率3最大需量发生时间"},
    
    {A17,"当月正向无功费率4最大需量发生时间"},
    
    
    {A23,"当月反向有功总最大需量"},

    {A23,"当月反向有功费率1最大需量"},
    
    {A23,"当月反向有功费率2最大需量"},
    
    {A23,"当月反向有功费率3最大需量"},
    
    {A23,"当月反向有功费率4最大需量"},
    
    
    {A17,"当月反向有功总最大需量发生时间"},

    {A17,"当月反向有功费率1最大需量发生时间"},
    
    {A17,"当月反向有功费率2最大需量发生时间"},
    
    {A17,"当月反向有功费率3最大需量发生时间"},
    
    {A17,"当月反向有功费率4最大需量发生时间"},
    
    
    {A23,"当月反向无功总最大需量"},
    
    {A23,"当月反向无功费率1最大需量"},
    
    {A23,"当月反向无功费率2最大需量"},
    
    {A23,"当月反向无功费率3最大需量"},
    
    {A23,"当月反向无功费率4最大需量"},
    
    
    {A17,"当月反向无功总最大需量发生时间"},
    
    {A17,"当月反向无功费率1最大需量发生时间"},
    
    {A17,"当月反向无功费率2最大需量发生时间"},
    
    {A17,"当月反向无功费率3最大需量发生时间"},
    
    {A17,"当月反向无功费率4最大需量发生时间"},
    
};

const COMPLEX_ITEM rt_dc_analog[]=
{
    {A2,"直流模拟量当前数据"}
};

const COMPLEX_ITEM mtr_rt_harmonic[]=
{
    {A7,"A相电压2次谐波有效值"},
    
    {A7,"A相电压3次谐波有效值"},
    
    {A7,"A相电压4次谐波有效值"},
    
    {A7,"A相电压5次谐波有效值"},
    
    {A7,"A相电压6次谐波有效值"},
    
    {A7,"A相电压7次谐波有效值"},
    
    {A7,"A相电压8次谐波有效值"},
    
    {A7,"A相电压9次谐波有效值"},
    
    {A7,"A相电压10次谐波有效值"},
    
    {A7,"A相电压11次谐波有效值"},
    
    {A7,"A相电压12次谐波有效值"},
    
    {A7,"A相电压13次谐波有效值"},
    
    {A7,"A相电压14次谐波有效值"},
    
    {A7,"A相电压15次谐波有效值"},
    
    {A7,"A相电压16次谐波有效值"},
    
    {A7,"A相电压17次谐波有效值"},
    
    {A7,"A相电压18次谐波有效值"},
    
    {A7,"A相电压19次谐波有效值"},
    
    

    {A7,"B相电压2次谐波有效值"},
    
    {A7,"B相电压3次谐波有效值"},
    
    {A7,"B相电压4次谐波有效值"},
    
    {A7,"B相电压5次谐波有效值"},
    
    {A7,"B相电压6次谐波有效值"},
    
    {A7,"B相电压7次谐波有效值"},
    
    {A7,"B相电压8次谐波有效值"},
    
    {A7,"B相电压9次谐波有效值"},
    
    {A7,"B相电压10次谐波有效值"},
    
    {A7,"B相电压11次谐波有效值"},
    
    {A7,"B相电压12次谐波有效值"},
    
    {A7,"B相电压13次谐波有效值"},
    
    {A7,"B相电压14次谐波有效值"},
    
    {A7,"B相电压15次谐波有效值"},
    
    {A7,"B相电压16次谐波有效值"},
    
    {A7,"B相电压17次谐波有效值"},
    
    {A7,"B相电压18次谐波有效值"},
    
    {A7,"B相电压19次谐波有效值"},
    
    
    
    {A7,"C相电压2次谐波有效值"},
    
    {A7,"C相电压3次谐波有效值"},
    
    {A7,"C相电压4次谐波有效值"},
    
    {A7,"C相电压5次谐波有效值"},
    
    {A7,"C相电压6次谐波有效值"},
    
    {A7,"C相电压7次谐波有效值"},
    
    {A7,"C相电压8次谐波有效值"},
    
    {A7,"C相电压9次谐波有效值"},
    
    {A7,"C相电压10次谐波有效值"},
    
    {A7,"C相电压11次谐波有效值"},
    
    {A7,"C相电压12次谐波有效值"},
    
    {A7,"C相电压13次谐波有效值"},
    
    {A7,"C相电压14次谐波有效值"},
    
    {A7,"C相电压15次谐波有效值"},
    
    {A7,"C相电压16次谐波有效值"},
    
    {A7,"C相电压17次谐波有效值"},
    
    {A7,"C相电压18次谐波有效值"},
    
    {A7,"C相电压19次谐波有效值"},
    
    
    
    {A6,"A相电流2次谐波有效值"},
    
    {A6,"A相电流3次谐波有效值"},
    
    {A6,"A相电流4次谐波有效值"},
    
    {A6,"A相电流5次谐波有效值"},
    
    {A6,"A相电流6次谐波有效值"},
    
    {A6,"A相电流7次谐波有效值"},
    
    {A6,"A相电流8次谐波有效值"},
    
    {A6,"A相电流9次谐波有效值"},
    
    {A6,"A相电流10次谐波有效值"},
    
    {A6,"A相电流11次谐波有效值"},
    
    {A6,"A相电流12次谐波有效值"},
    
    {A6,"A相电流13次谐波有效值"},
    
    {A6,"A相电流14次谐波有效值"},
    
    {A6,"A相电流15次谐波有效值"},
    
    {A6,"A相电流16次谐波有效值"},
    
    {A6,"A相电流17次谐波有效值"},
    
    {A6,"A相电流18次谐波有效值"},
    
    {A6,"A相电流19次谐波有效值"},
    
    
    
    {A6,"B相电流2次谐波有效值"},
    
    {A6,"B相电流3次谐波有效值"},
    
    {A6,"B相电流4次谐波有效值"},
    
    {A6,"B相电流5次谐波有效值"},
    
    {A6,"B相电流6次谐波有效值"},
    
    {A6,"B相电流7次谐波有效值"},
    
    {A6,"B相电流8次谐波有效值"},
    
    {A6,"B相电流9次谐波有效值"},
    
    {A6,"B相电流10次谐波有效值"},
    
    {A6,"B相电流11次谐波有效值"},
    
    {A6,"B相电流12次谐波有效值"},
    
    {A6,"B相电流13次谐波有效值"},
    
    {A6,"B相电流14次谐波有效值"},
    
    {A6,"B相电流15次谐波有效值"},
    
    {A6,"B相电流16次谐波有效值"},
    
    {A6,"B相电流17次谐波有效值"},
    
    {A6,"B相电流18次谐波有效值"},
    
    {A6,"B相电流19次谐波有效值"},
    
    
    
    {A6,"C相电流2次谐波有效值"},
    
    {A6,"C相电流3次谐波有效值"},
    
    {A6,"C相电流4次谐波有效值"},
    
    {A6,"C相电流5次谐波有效值"},
    
    {A6,"C相电流6次谐波有效值"},
    
    {A6,"C相电流7次谐波有效值"},
    
    {A6,"C相电流8次谐波有效值"},
    
    {A6,"C相电流9次谐波有效值"},
    
    {A6,"C相电流10次谐波有效值"},
    
    {A6,"C相电流11次谐波有效值"},
    
    {A6,"C相电流12次谐波有效值"},
    
    {A6,"C相电流13次谐波有效值"},
    
    {A6,"C相电流14次谐波有效值"},
    
    {A6,"C相电流15次谐波有效值"},
    
    {A6,"C相电流16次谐波有效值"},
    
    {A6,"C相电流17次谐波有效值"},
    
    {A6,"C相电流18次谐波有效值"},
    
    {A6,"C相电流19次谐波有效值"},
    
 
    {A5,"当前A相电压总谐波含有率"},

    {A5,"当前A相电压2次谐波含有率"},
    
    {A5,"当前A相电压3次谐波含有率"},
    
    {A5,"当前A相电压4次谐波含有率"},
    
    {A5,"当前A相电压5次谐波含有率"},
    
    {A5,"当前A相电压6次谐波含有率"},
    
    {A5,"当前A相电压7次谐波含有率"},
    
    {A5,"当前A相电压8次谐波含有率"},
    
    {A5,"当前A相电压9次谐波含有率"},
    
    {A5,"当前A相电压10次谐波含有率"},
    
    {A5,"当前A相电压11次谐波含有率"},
    
    {A5,"当前A相电压12次谐波含有率"},
    
    {A5,"当前A相电压13次谐波含有率"},
    
    {A5,"当前A相电压14次谐波含有率"},
    
    {A5,"当前A相电压15次谐波含有率"},
    
    {A5,"当前A相电压16次谐波含有率"},
    
    {A5,"当前A相电压17次谐波含有率"},
    
    {A5,"当前A相电压18次谐波含有率"},
    
    {A5,"当前A相电压19次谐波含有率"},
    
    
    
    {A5,"当前B相电压总谐波含有率"},
    
    {A5,"当前B相电压2次谐波含有率"},
    
    {A5,"当前B相电压3次谐波含有率"},
    
    {A5,"当前B相电压4次谐波含有率"},
    
    {A5,"当前B相电压5次谐波含有率"},
    
    {A5,"当前B相电压6次谐波含有率"},
    
    {A5,"当前B相电压7次谐波含有率"},
    
    {A5,"当前B相电压8次谐波含有率"},
    
    {A5,"当前B相电压9次谐波含有率"},
    
    {A5,"当前B相电压10次谐波含有率"},
    
    {A5,"当前B相电压11次谐波含有率"},
    
    {A5,"当前B相电压12次谐波含有率"},
    
    {A5,"当前B相电压13次谐波含有率"},
    
    {A5,"当前B相电压14次谐波含有率"},
    
    {A5,"当前B相电压15次谐波含有率"},
    
    {A5,"当前B相电压16次谐波含有率"},
    
    {A5,"当前B相电压17次谐波含有率"},
    
    {A5,"当前B相电压18次谐波含有率"},
    
    {A5,"当前B相电压19次谐波含有率"},
    
    
    
    {A5,"当前C相电压总谐波含有率"},
    
    {A5,"当前C相电压2次谐波含有率"},
    
    {A5,"当前C相电压3次谐波含有率"},
    
    {A5,"当前C相电压4次谐波含有率"},
    
    {A5,"当前C相电压5次谐波含有率"},
    
    {A5,"当前C相电压6次谐波含有率"},
    
    {A5,"当前C相电压7次谐波含有率"},
    
    {A5,"当前C相电压8次谐波含有率"},
    
    {A5,"当前C相电压9次谐波含有率"},
    
    {A5,"当前C相电压10次谐波含有率"},
    
    {A5,"当前C相电压11次谐波含有率"},
    
    {A5,"当前C相电压12次谐波含有率"},
    
    {A5,"当前C相电压13次谐波含有率"},
    
    {A5,"当前C相电压14次谐波含有率"},
    
    {A5,"当前C相电压15次谐波含有率"},
    
    {A5,"当前C相电压16次谐波含有率"},
    
    {A5,"当前C相电压17次谐波含有率"},
    
    {A5,"当前C相电压18次谐波含有率"},
    
    {A5,"当前C相电压19次谐波含有率"},
    
    
    
    //****************************确认******************************
    {A5,"当前A相电流总谐波含有率"},
    
    {A5,"当前A相电流2次谐波含有率"},
    
    {A5,"当前A相电流3次谐波含有率"},
    
    {A5,"当前A相电流4次谐波含有率"},
    
    {A5,"当前A相电流5次谐波含有率"},
    
    {A5,"当前A相电流6次谐波含有率"},
    
    {A5,"当前A相电流7次谐波含有率"},
    
    {A5,"当前A相电流8次谐波含有率"},
    
    {A5,"当前A相电流9次谐波含有率"},
    
    {A5,"当前A相电流10次谐波含有率"},
    
    {A5,"当前A相电流11次谐波含有率"},
    
    {A5,"当前A相电流12次谐波含有率"},
    
    {A5,"当前A相电流13次谐波含有率"},
    
    {A5,"当前A相电流14次谐波含有率"},
    
    {A5,"当前A相电流15次谐波含有率"},
    
    {A5,"当前A相电流16次谐波含有率"},
    
    {A5,"当前A相电流17次谐波含有率"},
    
    {A5,"当前A相电流18次谐波含有率"},
    
    {A5,"当前A相电流19次谐波含有率"},
    
    
    
    {A5,"当前B相电流总谐波含有率"},
    
    {A5,"当前B相电流2次谐波含有率"},
    
    {A5,"当前B相电流3次谐波含有率"},
    
    {A5,"当前B相电流4次谐波含有率"},
    
    {A5,"当前B相电流5次谐波含有率"},
    
    {A5,"当前B相电流6次谐波含有率"},
    
    {A5,"当前B相电流7次谐波含有率"},
    
    {A5,"当前B相电流8次谐波含有率"},
    
    {A5,"当前B相电流9次谐波含有率"},
    
    {A5,"当前B相电流10次谐波含有率"},
    
    {A5,"当前B相电流11次谐波含有率"},
    
    {A5,"当前B相电流12次谐波含有率"},
    
    {A5,"当前B相电流13次谐波含有率"},
    
    {A5,"当前B相电流14次谐波含有率"},
    
    {A5,"当前B相电流15次谐波含有率"},
    
    {A5,"当前B相电流16次谐波含有率"},
    
    {A5,"当前B相电流17次谐波含有率"},
    
    {A5,"当前B相电流18次谐波含有率"},
    
    {A5,"当前B相电流19次谐波含有率"},
    
    
    
    {A5,"当前C相电流总谐波含有率"},
    
    {A5,"当前C相电流2次谐波含有率"},
    
    {A5,"当前C相电流3次谐波含有率"},
    
    {A5,"当前C相电流4次谐波含有率"},
    
    {A5,"当前C相电流5次谐波含有率"},
    
    {A5,"当前C相电流6次谐波含有率"},
    
    {A5,"当前C相电流7次谐波含有率"},
    
    {A5,"当前C相电流8次谐波含有率"},
    
    {A5,"当前C相电流9次谐波含有率"},
    
    {A5,"当前C相电流10次谐波含有率"},
    
    {A5,"当前C相电流11次谐波含有率"},
    
    {A5,"当前C相电流12次谐波含有率"},
    
    {A5,"当前C相电流13次谐波含有率"},
    
    {A5,"当前C相电流14次谐波含有率"},
    
    {A5,"当前C相电流15次谐波含有率"},
    
    {A5,"当前C相电流16次谐波含有率"},
    
    {A5,"当前C相电流17次谐波含有率"},
    
    {A5,"当前C相电流18次谐波含有率"},
    
    {A5,"当前C相电流19次谐波含有率"},
};





//测量点曲线数据
const COMPLEX_ITEM measure_curve_data[] =
{
    {A15,"日期"},
    
    {BIN1_29,"密度"},
    
    {BIN1_29,"点数"},
    
    {A9,"功率曲线类型"},
    
    {A7,"电压曲线类型"},
    
    {A25,"电流曲线类型"},
    
    {A5,"功率因素曲线"},
    
    {A2,"直流模拟量数据曲线"}
};


//直流模拟量日数据
const COMPLEX_ITEM dcanalog_day_data[] =
{
    
    
    {A20,"日数据时标"},
    
    {BIN2_30,"直流模拟量越上限日累计时间"},
    
    {BIN2_30,"直流模拟量越下限日累计时间"},
    
    {A2,"直流模拟量日最大值"},
    
    {A18,"直流模拟量日最大值发生时间"},
    
    {A2,"直流模拟量日最小值"},
    
    {A18,"直流模拟量日最小值发生时间"}
    
};


//直流模拟量月数据
const COMPLEX_ITEM dcanalog_month_data[] =
{
    {A21,"月数据时标"},
    
    {BIN2_30,"直流模拟量越上限月累计时间"},
    
    {BIN2_30,"直流模拟量越下限月累计时间"},
    
    {A2,"直流模拟量月最大值"},
    
    {A18,"直流模拟量月最大值发生时间"},
    
    {A2,"直流模拟量月最小值"},
    
    {A18,"直流模拟量月最小值发生时间"}
};



//测量点日数据——电压谐波数据
const COMPLEX_ITEM daily_data_vharmonic[] =
{
    
    {A20,"日数据时标"},
    
    /*A相2－19次谐波电压含有率日最大值及发生时间*/
    {A5,"A相2次谐波电压含有率日最大值"},
    
    {A17,"A相2次谐波电压含有率日最大值发生时间"},
    
    {A5,"A相3次谐波电压含有率日最大值"},
    
    {A17,"A相3次谐波电压含有率日最大值发生时间"},
    
    {A5,"A相4次谐波电压含有率日最大值"},
    
    {A17,"A相4次谐波电压含有率日最大值发生时间"},
    
    {A5,"A相5次谐波电压含有率日最大值"},
    
    {A17,"A相5次谐波电压含有率日最大值发生时间"},
    
    {A5,"A相6次谐波电压含有率日最大值"},
    
    {A17,"A相6次谐波电压含有率日最大值发生时间"},
    
    {A5,"A相7次谐波电压含有率日最大值"},
    
    {A17,"A相7次谐波电压含有率日最大值发生时间"},
    
    {A5,"A相8次谐波电压含有率日最大值"},
    
    {A17,"A相8次谐波电压含有率日最大值发生时间"},
    
    {A5,"A相9次谐波电压含有率日最大值"},
    
    {A17,"A相9次谐波电压含有率日最大值发生时间"},
    
    {A5,"A相10次谐波电压含有率日最大值"},
    
    {A17,"A相10次谐波电压含有率日最大值发生时间"},
    
    {A5,"A相11次谐波电压含有率日最大值"},
    
    {A17,"A相11次谐波电压含有率日最大值发生时间"},
    
    {A5,"A相12次谐波电压含有率日最大值"},
    
    {A17,"A相12次谐波电压含有率日最大值发生时间"},
    
    {A5,"A相13次谐波电压含有率日最大值"},
    
    {A17,"A相13次谐波电压含有率日最大值发生时间"},
    
    {A5,"A相14次谐波电压含有率日最大值"},
    
    {A17,"A相14次谐波电压含有率日最大值发生时间"},
    
    {A5,"A相15次谐波电压含有率日最大值"},
    
    {A17,"A相15次谐波电压含有率日最大值发生时间"},
    
    {A5,"A相16次谐波电压含有率日最大值"},
    
    {A17,"A相16次谐波电压含有率日最大值发生时间"},
    
    {A5,"A相17次谐波电压含有率日最大值"},
    
    {A17,"A相17次谐波电压含有率日最大值发生时间"},
    
    {A5,"A相18次谐波电压含有率日最大值"},
    
    {A17,"A相18次谐波电压含有率日最大值发生时间"},
    
    {A5,"A相19次谐波电压含有率日最大值"},
    
    {A17,"A相19次谐波电压含有率日最大值发生时间"},
    
    //A相总谐波电压含有率日最大值及+A相总畸变电压含有率日最大值发生时间
    {A5,"A相总谐波电压含有率日最大值"},
    
    {A17,"A相总谐波电压含有率日最大值发生时间"},
    
    
    /*B相2－19次谐波电压含有率日最大值及发生时间*/
    {A5,"B相2次谐波电压含有率日最大值"},
    
    {A17,"B相2次谐波电压含有率日最大值发生时间"},
    
    {A5,"B相3次谐波电压含有率日最大值"},
    
    {A17,"B相3次谐波电压含有率日最大值发生时间"},
    
    {A5,"B相4次谐波电压含有率日最大值"},
    
    {A17,"B相4次谐波电压含有率日最大值发生时间"},
    
    {A5,"B相5次谐波电压含有率日最大值"},
    
    {A17,"B相5次谐波电压含有率日最大值发生时间"},
    
    {A5,"B相6次谐波电压含有率日最大值"},
    
    {A17,"B相6次谐波电压含有率日最大值发生时间"},
    
    {A5,"B相7次谐波电压含有率日最大值"},
    
    {A17,"B相7次谐波电压含有率日最大值发生时间"},
    
    {A5,"B相8次谐波电压含有率日最大值"},
    
    {A17,"B相8次谐波电压含有率日最大值发生时间"},
    
    {A5,"B相9次谐波电压含有率日最大值"},
    
    {A17,"B相9次谐波电压含有率日最大值发生时间"},
    
    {A5,"B相10次谐波电压含有率日最大值"},
    
    {A17,"B相10次谐波电压含有率日最大值发生时间"},
    
    {A5,"B相11次谐波电压含有率日最大值"},
    
    {A17,"B相11次谐波电压含有率日最大值发生时间"},
    
    {A5,"B相12次谐波电压含有率日最大值"},
    
    {A17,"B相12次谐波电压含有率日最大值发生时间"},
    
    {A5,"B相13次谐波电压含有率日最大值"},
    
    {A17,"B相13次谐波电压含有率日最大值发生时间"},
    
    {A5,"B相14次谐波电压含有率日最大值"},
    
    {A17,"B相14次谐波电压含有率日最大值发生时间"},
    
    {A5,"B相15次谐波电压含有率日最大值"},
    
    {A17,"B相15次谐波电压含有率日最大值发生时间"},
    
    {A5,"B相16次谐波电压含有率日最大值"},
    
    {A17,"B相16次谐波电压含有率日最大值发生时间"},
    
    {A5,"B相17次谐波电压含有率日最大值"},
    
    {A17,"B相17次谐波电压含有率日最大值发生时间"},
    
    {A5,"B相18次谐波电压含有率日最大值"},
    
    {A17,"B相18次谐波电压含有率日最大值发生时间"},
    
    {A5,"B相19次谐波电压含有率日最大值"},
    
    {A17,"B相19次谐波电压含有率日最大值发生时间"},
    
    //B相总谐波电压含有率日最大值及+A相总畸变电压含有率日最大值发生时间
    {A5,"B相总谐波电压含有率日最大值"},
    
    {A17,"B相总谐波电压含有率日最大值发生时间"},
    
    
    
    /*C相2－19次谐波电压含有率日最大值及发生时间*/
    {A5,"C相2次谐波电压含有率日最大值"},
    
    {A17,"C相2次谐波电压含有率日最大值发生时间"},
    
    {A5,"C相3次谐波电压含有率日最大值"},
    
    {A17,"C相3次谐波电压含有率日最大值发生时间"},
    
    {A5,"C相4次谐波电压含有率日最大值"},
    
    {A17,"C相4次谐波电压含有率日最大值发生时间"},
    
    {A5,"C相5次谐波电压含有率日最大值"},
    
    {A17,"C相5次谐波电压含有率日最大值发生时间"},
    
    {A5,"C相6次谐波电压含有率日最大值"},
    
    {A17,"C相6次谐波电压含有率日最大值发生时间"},
    
    {A5,"C相7次谐波电压含有率日最大值"},
    
    {A17,"C相7次谐波电压含有率日最大值发生时间"},
    
    {A5,"C相8次谐波电压含有率日最大值"},
    
    {A17,"C相8次谐波电压含有率日最大值发生时间"},
    
    {A5,"C相9次谐波电压含有率日最大值"},
    
    {A17,"C相9次谐波电压含有率日最大值发生时间"},
    
    {A5,"C相10次谐波电压含有率日最大值"},
    
    {A17,"C相10次谐波电压含有率日最大值发生时间"},
    
    {A5,"C相11次谐波电压含有率日最大值"},
    
    {A17,"C相11次谐波电压含有率日最大值发生时间"},
    
    {A5,"C相12次谐波电压含有率日最大值"},
    
    {A17,"C相12次谐波电压含有率日最大值发生时间"},
    
    {A5,"C相13次谐波电压含有率日最大值"},
    
    {A17,"C相13次谐波电压含有率日最大值发生时间"},
    
    {A5,"C相14次谐波电压含有率日最大值"},
    
    {A17,"C相14次谐波电压含有率日最大值发生时间"},
    
    {A5,"C相15次谐波电压含有率日最大值"},
    
    {A17,"C相15次谐波电压含有率日最大值发生时间"},
    
    {A5,"C相16次谐波电压含有率日最大值"},
    
    {A17,"C相16次谐波电压含有率日最大值发生时间"},
    
    {A5,"C相17次谐波电压含有率日最大值"},
    
    {A17,"C相17次谐波电压含有率日最大值发生时间"},
    
    {A5,"C相18次谐波电压含有率日最大值"},
    
    {A17,"C相18次谐波电压含有率日最大值发生时间"},
    
    {A5,"C相19次谐波电压含有率日最大值"},
    
    {A17,"C相19次谐波电压含有率日最大值发生时间"},
    
    //C相总谐波电压含有率日最大值及+A相总畸变电压含有率日最大值发生时间
    {A5,"C相总谐波电压含有率日最大值"},
    
    {A17,"C相总谐波电压含有率日最大值发生时间"}
    
};





//测量点日数据——电流谐波类数据
const COMPLEX_ITEM daily_data_charmonic[] =
{
    {A20,"日数据时标"},
    
    
    /*A相2－19次谐波电流日最大值及发生时间*/
    {A6,"A相2次谐波电流日最大值"},
    
    {A17,"A相2次谐波电流日最大值发生时间"},
    
    {A6,"A相3次谐波电流日最大值"},
    
    {A17,"A相3次谐波电流日最大值发生时间"},
    
    {A6,"A相4次谐波电流日最大值"},
    
    {A17,"A相4次谐波电流日最大值发生时间"},
    
    {A6,"A相5次谐波电流日最大值"},
    
    {A17,"A相5次谐波电流日最大值发生时间"},
    
    {A6,"A相6次谐波电流日最大值"},
    
    {A17,"A相6次谐波电流日最大值发生时间"},
    
    {A6,"A相7次谐波电流日最大值"},
    
    {A17,"A相7次谐波电流日最大值发生时间"},
    
    {A6,"A相8次谐波电流日最大值"},
    
    {A17,"A相8次谐波电流日最大值发生时间"},
    
    {A6,"A相9次谐波电流日最大值"},
    
    {A17,"A相9次谐波电流日最大值发生时间"},
    
    {A6,"A相10次谐波电流日最大值"},
    
    {A17,"A相10次谐波电流日最大值发生时间"},
    
    {A6,"A相11次谐波电流日最大值"},
    
    {A17,"A相11次谐波电流日最大值发生时间"},
    
    {A6,"A相12次谐波电流日最大值"},
    
    {A17,"A相12次谐波电流日最大值发生时间"},
    
    {A6,"A相13次谐波电流日最大值"},
    
    {A17,"A相13次谐波电流日最大值发生时间"},
    
    {A6,"A相14次谐波电流日最大值"},
    
    {A17,"A相14次谐波电流日最大值发生时间"},
    
    {A6,"A相15次谐波电流日最大值"},
    
    {A17,"A相15次谐波电流日最大值发生时间"},
    
    {A6,"A相16次谐波电流日最大值"},
    
    {A17,"A相16次谐波电流日最大值发生时间"},
    
    {A6,"A相17次谐波电流日最大值"},
    
    {A17,"A相17次谐波电流日最大值发生时间"},
    
    {A6,"A相18次谐波电流日最大值"},
    
    {A17,"A相18次谐波电流日最大值发生时间"},
    
    {A6,"A相19次谐波电流日最大值"},
    
    {A17,"A相19次谐波电流日最大值发生时间"},
    /*A相总畸变电流日最大值+A相总畸变电流日最大值发生时间*/
    {A6,"A相总畸变电流日最大值"},
    
    {A17,"A相总畸变电流日最大值发生时间"},
    
    
    /*B相2－19次谐波电流日最大值及发生时间*/
    {A6,"B相2次谐波电流日最大值"},
    
    {A17,"B相2次谐波电流日最大值发生时间"},
    
    {A6,"B相3次谐波电流日最大值"},
    
    {A17,"B相3次谐波电流日最大值发生时间"},
    
    {A6,"B相4次谐波电流日最大值"},
    
    {A17,"B相4次谐波电流日最大值发生时间"},
    
    {A6,"B相5次谐波电流日最大值"},
    
    {A17,"B相5次谐波电流日最大值发生时间"},
    
    {A6,"B相6次谐波电流日最大值"},
    
    {A17,"B相6次谐波电流日最大值发生时间"},
    
    {A6,"B相7次谐波电流日最大值"},
    
    {A17,"B相7次谐波电流日最大值发生时间"},
    
    {A6,"B相8次谐波电流日最大值"},
    
    {A17,"B相8次谐波电流日最大值发生时间"},
    
    {A6,"B相9次谐波电流日最大值"},
    
    {A17,"B相9次谐波电流日最大值发生时间"},
    
    {A6,"B相10次谐波电流日最大值"},
    
    {A17,"B相10次谐波电流日最大值发生时间"},
    
    {A6,"B相11次谐波电流日最大值"},
    
    {A17,"B相11次谐波电流日最大值发生时间"},
    
    {A6,"B相12次谐波电流日最大值"},
    
    {A17,"B相12次谐波电流日最大值发生时间"},
    
    {A6,"B相13次谐波电流日最大值"},
    
    {A17,"B相13次谐波电流日最大值发生时间"},
    
    {A6,"B相14次谐波电流日最大值"},
    
    {A17,"B相14次谐波电流日最大值发生时间"},
    
    {A6,"B相15次谐波电流日最大值"},
    
    {A17,"B相15次谐波电流日最大值发生时间"},
    
    {A6,"B相16次谐波电流日最大值"},
    
    {A17,"B相16次谐波电流日最大值发生时间"},
    
    {A6,"B相17次谐波电流日最大值"},
    
    {A17,"B相17次谐波电流日最大值发生时间"},
    
    {A6,"B相18次谐波电流日最大值"},
    
    {A17,"B相18次谐波电流日最大值发生时间"},
    
    {A6,"B相19次谐波电流日最大值"},
    
    {A17,"B相19次谐波电流日最大值发生时间"},
    /*B相总畸变电流日最大值+B相总畸变电流日最大值发生时间*/
    {A6,"B相总畸变电流日最大值"},
    
    {A17,"B相总畸变电流日最大值发生时间"},
    
    /*C相2－19次谐波电流日最大值及发生时间*/
    {A6,"C相2次谐波电流日最大值"},
    
    {A17,"C相2次谐波电流日最大值发生时间"},
    
    {A6,"C相3次谐波电流日最大值"},
    
    {A17,"C相3次谐波电流日最大值发生时间"},
    
    {A6,"C相4次谐波电流日最大值"},
    
    {A17,"C相4次谐波电流日最大值发生时间"},
    
    {A6,"C相5次谐波电流日最大值"},
    
    {A17,"C相5次谐波电流日最大值发生时间"},
    
    {A6,"C相6次谐波电流日最大值"},
    
    {A17,"C相6次谐波电流日最大值发生时间"},
    
    {A6,"C相7次谐波电流日最大值"},
    
    {A17,"C相7次谐波电流日最大值发生时间"},
    
    {A6,"C相8次谐波电流日最大值"},
    
    {A17,"C相8次谐波电流日最大值发生时间"},
    
    {A6,"C相9次谐波电流日最大值"},
    
    {A17,"C相9次谐波电流日最大值发生时间"},
    
    {A6,"C相10次谐波电流日最大值"},
    
    {A17,"C相10次谐波电流日最大值发生时间"},
    
    {A6,"C相11次谐波电流日最大值"},
    
    {A17,"C相11次谐波电流日最大值发生时间"},
    
    {A6,"C相12次谐波电流日最大值"},
    
    {A17,"C相12次谐波电流日最大值发生时间"},
    
    {A6,"C相13次谐波电流日最大值"},
    
    {A17,"C相13次谐波电流日最大值发生时间"},
    
    {A6,"C相14次谐波电流日最大值"},
    
    {A17,"C相14次谐波电流日最大值发生时间"},
    
    {A6,"C相15次谐波电流日最大值"},
    
    {A17,"C相15次谐波电流日最大值发生时间"},
    
    {A6,"C相16次谐波电流日最大值"},
    
    {A17,"C相16次谐波电流日最大值发生时间"},
    
    {A6,"C相17次谐波电流日最大值"},
    
    {A17,"C相17次谐波电流日最大值发生时间"},
    
    {A6,"C相18次谐波电流日最大值"},
    
    {A17,"C相18次谐波电流日最大值发生时间"},
    
    {A6,"C相19次谐波电流日最大值"},
    
    {A17,"C相19次谐波电流日最大值发生时间"},
    /*C相总畸变电流日最大值+C相总畸变电流日最大值发生时间*/
    {A6,"C相总畸变电流日最大值"},
    
    {A17,"C相总畸变电流日最大值发生时间"},
    
};

//测量点日电能示值数据
const COMPLEX_ITEM measure_day_powervalue[]=
{
    
    {A20,"数据时标"},
    //正向有功总电能示值
    {A14,"正向有功总电能示值"},
    
    {A14,"费率1正向有功电能示值"},
    
    {A14,"费率2正向有功电能示值"},
    
    {A14,"费率3正向有功电能示值"},
    
    {A14,"费率4正向有功电能示值"},
    
    
    
    //正向无功
    {A11,"正向无功总电能示值"},
    
    {A11,"正向无功费率1电能示值"},
    
    {A11,"正向无功费率2电能示值"},
    
    {A11,"正向无功费率3电能示值"},
    
    {A11,"正向无功费率4电能示值"},
    
    //一象限无功
    
    {A11,"一象限无功总电能示值"},
    
    {A11,"一象限无功费率1电能示值"},
    
    {A11,"一象限无功费率2电能示值"},
    
    {A11,"一象限无功费率3电能示值"},
    
    {A11,"一象限无功费率4电能示值"},
    
    //四象限无功
    {A11,"四象限无功总电能示值"},
    
    {A11,"四象限无功费率1电能示值"},
    
    {A11,"四象限无功费率2电能示值"},
    
    {A11,"四象限无功费率3电能示值"},
    
    {A11,"四象限无功费率4电能示值"},
    
    
    //反向有功
    {A14,"反向有功总电能示值"},
    
    {A14,"费率1反向有功电能示值"},
    
    {A14,"费率2反向有功电能示值"},
    
    {A14,"费率3反向有功电能示值"},
    
    {A14,"费率4反向有功电能示值"},
    
    
    //反向无功
    {A11,"反向无功总电能示值"},
    
    {A11,"反向无功费率1电能示值"},
    
    {A11,"反向无功费率2电能示值"},
    
    {A11,"反向无功费率3电能示值"},
    
    {A11,"反向无功费率4电能示值"},
    
    
    //二象限无功
    {A11,"二象限无功总电能示值"},
    
    {A11,"二象限无功费率1电能示值"},
    
    {A11,"二象限无功费率2电能示值"},
    
    {A11,"二象限无功费率3电能示值"},
    
    {A11,"二象限无功费率4电能示值"},
    
    
    //三象限无功
    {A11,"三象限无功总电能示值"},
    
    {A11,"三象限无功费率1电能示值"},
    
    {A11,"三象限无功费率2电能示值"},
    
    {A11,"三象限无功费率3电能示值"},
    
    {A11,"三象限无功费率4电能示值"},
    
    
    
    //正向无功（组合无功1）
    {A11,"正向无功总电能示值"},
    
    {A11,"正向无功费率1电能示值"},
    
    {A11,"正向无功费率2电能示值"},
    
    {A11,"正向无功费率3电能示值"},
    
    {A11,"正向无功费率4电能示值"},
    
    //反向无功（组合无功1）
    {A11,"反向无功总电能示值"},
    
    {A11,"反向无功费率1电能示值"},
    
    {A11,"反向无功费率2电能示值"},
    
    {A11,"反向无功费率3电能示值"},
    
    {A11,"反向无功费率4电能示值"},
    
};


//测量点月电能示值数据
const COMPLEX_ITEM measure_month_powervalue[]=
{
    {A21,"数据时标"},
    
    //正向有功总电能示值
    {A14,"正向有功总电能示值"},
    
    {A14,"费率1正向有功电能示值"},
    
    {A14,"费率2正向有功电能示值"},
    
    {A14,"费率3正向有功电能示值"},
    
    {A14,"费率4正向有功电能示值"},
    
    
    
    //正向无功
    {A11,"正向无功总电能示值"},
    
    {A11,"正向无功费率1电能示值"},
    
    {A11,"正向无功费率2电能示值"},
    
    {A11,"正向无功费率3电能示值"},
    
    {A11,"正向无功费率4电能示值"},
    
    //一象限无功
    {A11,"一象限无功总电能示值"},
    
    {A11,"一象限无功费率1电能示值"},
    
    {A11,"一象限无功费率2电能示值"},
    
    {A11,"一象限无功费率3电能示值"},
    
    {A11,"一象限无功费率4电能示值"},
    //四象限无功
    {A11,"四象限无功总电能示值"},
    
    {A11,"四象限无功费率1电能示值"},
    
    {A11,"四象限无功费率2电能示值"},
    
    {A11,"四象限无功费率3电能示值"},
    
    {A11,"四象限无功费率4电能示值"},
    
    
    //反向有功
    {A14,"反向有功总电能示值"},
    
    {A14,"费率1反向有功电能示值"},
    
    {A14,"费率2反向有功电能示值"},
    
    {A14,"费率3反向有功电能示值"},
    
    {A14,"费率4反向有功电能示值"},
    
    
    //反向无功
    {A11,"反向无功总电能示值"},
    
    {A11,"反向无功费率1电能示值"},
    
    {A11,"反向无功费率2电能示值"},
    
    {A11,"反向无功费率3电能示值"},
    
    {A11,"反向无功费率4电能示值"},
    
    
    //二象限无功
    {A11,"二象限无功总电能示值"},
    
    {A11,"二象限无功费率1电能示值"},
    
    {A11,"二象限无功费率2电能示值"},
    
    {A11,"二象限无功费率3电能示值"},
    
    {A11,"二象限无功费率4电能示值"},
    
    
    //三象限无功
    {A11,"三象限无功总电能示值"},
    
    {A11,"三象限无功费率1电能示值"},
    
    {A11,"三象限无功费率2电能示值"},
    
    {A11,"三象限无功费率3电能示值"},
    
    {A11,"三象限无功费率4电能示值"},
    
    
    
    //正向无功（组合无功1）
    {A11,"正向无功总电能示值"},
    
    {A11,"正向无功费率1电能示值"},
    
    {A11,"正向无功费率2电能示值"},
    
    {A11,"正向无功费率3电能示值"},
    
    {A11,"正向无功费率4电能示值"},
    
    //反向无功（组合无功1）
    {A11,"反向无功总电能示值"},
    
    {A11,"反向无功费率1电能示值"},
    
    {A11,"反向无功费率2电能示值"},
    
    {A11,"反向无功费率3电能示值"},
    
    {A11,"反向无功费率4电能示值"},
    
    
};


//历史数据测量日统计数据
const COMPLEX_ITEM measure_day_sta[]=
{
    {A20,"日数据时标"},
    
    {BIN2_30,"A相电压越上上限日累计时间"},
    
    {BIN2_30,"A相电压越下下限日累计时间"},
    
    {BIN2_30,"A相电压越上限日累计时间"},
    
    {BIN2_30,"A相电压越下限日累计时间"},
    
    {BIN2_30,"A相电压合格日累计时间"},
    
    
    {BIN2_30,"B相电压越上上限日累计时间"},
    
    {BIN2_30,"B相电压越下下限日累计时间"},
    
    {BIN2_30,"B相电压越上限日累计时间"},
    
    {BIN2_30,"B相电压越下限日累计时间"},
    
    {BIN2_30,"B相电压合格日累计时间"},
    
    
    {BIN2_30,"C相电压越上上限日累计时间"},
    
    {BIN2_30,"C相电压越下下限日累计时间"},
    
    {BIN2_30,"C相电压越上限日累计时间"},
    
    {BIN2_30,"C相电压越下限日累计时间"},
    
    {BIN2_30,"C相电压合格日累计时间"},
    
    
    {A7,"A相电压最大值"},
    
    {A18,"A相电压最大值发生时间"},
    
    {A7,"A相电压最小值"},
    
    {A18,"A相电压最小值发生时间"},
    
    {A7,"B相电压最大值"},
    
    {A18,"B相电压最大值发生时间"},
    
    {A7,"B相电压最小值"},
    
    {A18,"B相电压最小值发生时间"},
    
    {A7,"C相电压最大值"},
    
    {A18,"C相电压最大值发生时间"},
    
    {A7,"C相电压最小值"},
    
    {A18,"C相电压最小值发生时间"},
    
    
    
    {A7,"A相平均电压"},
    
    {A7,"B相平均电压"},
    
    {A7,"C相平均电压"},
    
    
    
    {A25,"A相电压越上限率"},
    
    {A25,"A相电压越下限率"},
    
    {A25,"A相电压合格率"},
    
    {A25,"B相电压越上限率"},
    
    {A25,"B相电压越下限率"},
    
    {A25,"B相电压合格率"},
    
    {A25,"C相电压越上限率"},
    
    {A25,"C相电压越下限率"},
    
    {A25,"C相电压合格率"},
    
    //日冻结日不平衡度越限累计时间 发生时间不相同
    {BIN2_30,"电流不平衡度越限日累计时间"},
    
    {BIN2_30,"电压不平衡度越限日累计时间"},
    
    //***************************确认***************************
    {A5,"电流不平衡最大值"},
    
    {A18,"电流不平衡最大值发生时间"},
    
    {A5,"电压不平衡最大值"},
    
    {A18,"电压不平衡最大值发生时间"},
    
    
    
    {BIN2_30,"A相电流越上上限日累计时间"},
    
    {BIN2_30,"A相电流越上限日累计时间"},
    
    {BIN2_30,"B相电流越上上限日累计时间"},
    
    {BIN2_30,"B相电流越上限日累计时间"},
    
    {BIN2_30,"C相电流越上上限日累计时间"},
    
    {BIN2_30,"C相电流越上限日累计时间"},
    
    {BIN2_30,"零序电流越上限日累计时间"},
    
    
    
    
    {A25,"A相电流最大值"},
    
    {A18,"A相电流最大值发生时间"},
    
    {A25,"B相电流最大值"},
    
    {A18,"B相电流最大值发生时间"},
    
    {A25,"C相电流最大值"},
    
    {A18,"C相电流最大值发生时间"},
    
    {A25,"零序电流最大值"},
    
    {A18,"零序电流最大值发生时间"},
    
    
    
    {BIN2_30,"视在功率越上上限日累计时间"},
    
    {BIN2_30,"视在功率越上限日累计时间"},
    
    
    
    {BIN2_30,"区段1累计时间（功率因数＜定值1）"},
    
    {BIN2_30,"区段2累计时间（定值1≤功率因数＜定值2）"},
    
    {BIN2_30,"区段3累计时间（功率因数≥定值2）"},
    
    {A23,"三相总最大有功功率"},
    
    {A18,"三相总最大有功功率发生时间"},
    
    {A23,"A相最大有功功率"},
    
    {A18,"A相最大有功功率发生时间"},
    
    {A23,"B相最大有功功率"},
    
    {A18,"B相最大有功功率发生时间"},
    
    {A23,"C相最大有功功率"},
    
    {A18,"C相最大有功功率发生时间"},
    
    
    {BIN2_30,"三相总有功功率为零时间"},
    
    {BIN2_30,"A相有功功率为零时间"},
    
    {BIN2_30,"B相有功功率为零时间"},
    
    {BIN2_30,"C相有功功率为零时间"},
    
};



//历史数据测量点月统计数据
const COMPLEX_ITEM measure_month_sta[]=
{
    
    {A21,"月数据时标"},
    
    {BIN2_30,"A相电压越上上限月累计时间"},
    
    {BIN2_30,"A相电压越下下限月累计时间"},
    
    {BIN2_30,"A相电压越上限月累计时间"},
    
    {BIN2_30,"A相电压越下限月累计时间"},
    
    {BIN2_30,"A相电压合格月累计时间"},
    
    
    {BIN2_30,"B相电压越上上限月累计时间"},
    
    {BIN2_30,"B相电压越下下限月累计时间"},
    
    {BIN2_30,"B相电压越上限月累计时间"},
    
    {BIN2_30,"B相电压越下限月累计时间"},
    
    {BIN2_30,"B相电压合格月累计时间"},
    
    
    {BIN2_30,"C相电压越上上限月累计时间"},
    
    {BIN2_30,"C相电压越下下限月累计时间"},
    
    {BIN2_30,"C相电压越上限月累计时间"},
    
    {BIN2_30,"C相电压越下限月累计时间"},
    
    {BIN2_30,"C相电压合格月累计时间"},
    
    
    {A7,"A相电压最大值"},
    
    {A18,"A相电压最大值发生时间"},
    
    {A7,"A相电压最小值"},
    
    {A18,"A相电压最小值发生时间"},
    
    {A7,"B相电压最大值"},
    
    {A18,"B相电压最大值发生时间"},
    
    {A7,"B相电压最小值"},
    
    {A18,"B相电压最小值发生时间"},
    
    {A7,"C相电压最大值"},
    
    {A18,"C相电压最大值发生时间"},
    
    {A7,"C相电压最小值"},
    
    {A18,"C相电压最小值发生时间"},
    
    {A7,"A相平均电压"},
    
    {A7,"B相平均电压"},
    
    {A7,"C相平均电压"},
    
    
    
    {A25,"A相电压越上限率"},
    
    {A25,"A相电压越下限率"},
    
    {A25,"A相电压合格率"},
    
    {A25,"B相电压越上限率"},
    
    {A25,"B相电压越下限率"},
    
    {A25,"B相电压合格率"},
    
    {A25,"C相电压越上限率"},
    
    {A25,"C相电压越下限率"},
    
    {A25,"C相电压合格率"},
    
    
    {BIN2_30,"电流不平衡度越限月累计时间"},
    
    {BIN2_30,"电压不平衡度越限月累计时间"},
    
    {A5,"电流不平衡最大值"},
    
    {A17,"电流不平衡最大值发生时间"},
    
    {A5,"电压不平衡最大值"},
    
    {A17,"电压不平衡最大值发生时间"},
    
    
    
    {BIN2_30,"A相电流越上上限月累计时间"},
    
    {BIN2_30,"A相电流越上限月累计时间"},
    
    {BIN2_30,"B相电流越上上限月累计时间"},
    
    {BIN2_30,"B相电流越上限月累计时间"},
    
    {BIN2_30,"C相电流越上上限月累计时间"},
    
    {BIN2_30,"C相电流越上限月累计时间"},
    
    {BIN2_30,"零序电流越上限月累计时间"},
    
    
    
    
    {A25,"A相电流最大值"},
    
    {A18,"A相电流最大值发生时间"},
    
    {A25,"B相电流最大值"},
    
    {A18,"B相电流最大值发生时间"},
    
    {A25,"C相电流最大值"},
    
    {A18,"C相电流最大值发生时间"},
    
    {A25,"零序电流最大值"},
    
    {A18,"零序电流最大值发生时间"},
    
    
    
    {BIN2_30,"视在功率越上上限月累计时间"},
    
    {BIN2_30,"视在功率越上限月累计时间"},
    
    {BIN2_30,"区段1累计时间（功率因数＜定值1）"},
    
    {BIN2_30,"区段2累计时间（定值1≤功率因数＜定值2）"},
    
    {BIN2_30,"区段3累计时间（功率因数≥定值2）"},
    
    {A23,"三相总最大有功功率"},
    
    {A18,"三相总最大有功功率发生时间"},
    
    {A23,"A相最大有功功率"},
    
    {A18,"A相最大有功功率发生时间"},
    
    {A23,"B相最大有功功率"},
    
    {A18,"B相最大有功功率发生时间"},
    
    {A23,"C相最大有功功率"},
    
    {A18,"C相最大有功功率发生时间"},
    
    {BIN2_30,"三相总有功功率为零时间"},
    
    {BIN2_30,"A相有功功率为零时间"},
    
    {BIN2_30,"B相有功功率为零时间"},
    
    {BIN2_30,"C相有功功率为零时间"},
    
};








//测量点日需量数据类型
const COMPLEX_ITEM history_day_powerneeds[]=
{
    
    {A20, "日数据时标"},
    
    //正向有功最大需量
    {A23,"正向有功总最大需量"},
    
    {A23,"费率1正向有功最大需量"},
    
    {A23,"费率2正向有功最大需量"},
    
    {A23,"费率3正向有功最大需量"},
    
    {A23,"费率4正向有功最大需量"},
    
    
    //正向有功最大需量发生时间
    {A17,"正向有功总最大需量发生时间"},
    
    {A17,"费率1正向有功最大需量发生时间"},
    
    {A17,"费率2正向有功最大需量发生时间"},
    
    {A17,"费率3正向有功最大需量发生时间"},
    
    {A17,"费率4正向有功最大需量发生时间"},
    
    
    //正向无功最大需量
    {A23,"正向无功总最大需量"},
    
    {A23,"费率1正向无功最大需量"},
    
    {A23,"费率2正向无功最大需量"},
    
    {A23,"费率3正向无功最大需量"},
    
    {A23,"费率4正向无功最大需量"},
    
    
    //正向无功最大需量发生时间
    {A17,"正向无功总最大需量发生时间"},
    
    {A17,"费率1正向无功最大需量发生时间"},
    
    {A17,"费率2正向无功最大需量发生时间"},
    
    {A17,"费率3正向无功最大需量发生时间"},
    
    {A17,"费率4正向无功最大需量发生时间"},
    
    
    //反向有功最大需量
    {A23,"反向有功总最大需量"},
    
    {A23,"费率1反向有功最大需量"},
    
    {A23,"费率2反向有功最大需量"},
    
    {A23,"费率3反向有功最大需量"},
    
    {A23,"费率4反向有功最大需量"},
    
    
    //反向有功最大需量发生时间
    {A17,"反向有功总最大需量发生时间"},
    
    {A17,"费率1反向有功最大需量发生时间"},
    
    {A17,"费率2反向有功最大需量发生时间"},
    
    {A17,"费率3反向有功最大需量发生时间"},
    
    {A17,"费率4反向有功最大需量发生时间"},
    
    
    //反向无功最大需量
    {A23,"反向无功总最大需量"},
    
    {A23,"费率1反向无功最大需量"},
    
    {A23,"费率2反向无功最大需量"},
    
    {A23,"费率3反向无功最大需量"},
    
    {A23,"费率4反向无功最大需量"},
    
    
    //反向无功最大需量发生时间
    {A17,"反向无功总最大需量发生时间"},
    
    {A17,"费率1反向无功最大需量发生时间"},
    
    {A17,"费率2反向无功最大需量发生时间"},
    
    {A17,"费率3反向无功最大需量发生时间"},
    
    {A17,"费率4反向无功最大需量发生时间"},
    
    
    
    
    //三向总有功最大需量
    {A23,"三相总有功最大需量"},
    
    {A18,"三相总有功最大需量发生时间"},
    
    {A23,"A相有功最大需量"},
    
    {A18,"A相有功最大需量发生时间"},
    
    {A23,"B相有功最大需量"},
    
    {A18,"B相有功最大需量发生时间"},
    
    {A23,"C相有功最大需量"},
    
    {A18,"C相有功最大需量发生时间"},
    
};

//测量点月需量数据类型
const COMPLEX_ITEM history_month_powerneeds[]=
{
    {A21,"月数据时标"},
    
    //正向有功最大需量
    {A23,"正向有功总最大需量"},
    
    {A23,"费率1正向有功最大需量"},
    
    {A23,"费率2正向有功最大需量"},
    
    {A23,"费率3正向有功最大需量"},
    
    {A23,"费率4正向有功最大需量"},
    
    
    
    //正向有功最大需量发生时间
    {A17,"正向有功总最大需量发生时间"},
    
    {A17,"费率1正向有功最大需量发生时间"},
    
    {A17,"费率2正向有功最大需量发生时间"},
    
    {A17,"费率3正向有功最大需量发生时间"},
    
    {A17,"费率4正向有功最大需量发生时间"},
    
    
    
    //正向无功最大需量
    {A23,"正向无功总最大需量"},
    
    {A23,"费率1正向无功最大需量"},
    
    {A23,"费率2正向无功最大需量"},
    
    {A23,"费率3正向无功最大需量"},
    
    {A23,"费率4正向无功最大需量"},
    
    
    
    //正向无功最大需量发生时间
    {A17,"正向无功总最大需量发生时间"},
    
    {A17,"费率1正向无功最大需量发生时间"},
    
    {A17,"费率2正向无功最大需量发生时间"},
    
    {A17,"费率3正向无功最大需量发生时间"},
    
    {A17,"费率4正向无功最大需量发生时间"},
    
    
    
    //反向有功最大需量
    {A23,"反向有功总最大需量"},
    
    {A23,"费率1反向有功最大需量"},
    
    {A23,"费率2反向有功最大需量"},
    
    {A23,"费率3反向有功最大需量"},
    
    {A23,"费率4反向有功最大需量"},
    
    
    //反向有功最大需量发生时间
    {A17,"反向有功总最大需量发生时间"},
    
    {A17,"费率1反向有功最大需量发生时间"},
    
    {A17,"费率2反向有功最大需量发生时间"},
    
    {A17,"费率3反向有功最大需量发生时间"},
    
    {A17,"费率4反向有功最大需量发生时间"},
    
    
    
    //反向无功最大需量
    {A23,"反向无功总最大需量"},
    
    {A23,"费率1反向无功最大需量"},
    
    {A23,"费率2反向无功最大需量"},
    
    {A23,"费率3反向无功最大需量"},
    
    {A23,"费率4反向无功最大需量"},
    
    
    //反向无功最大需量发生时间
    {A17,"反向无功总最大需量发生时间"},
    
    {A17,"费率1反向无功最大需量发生时间"},
    
    {A17,"费率2反向无功最大需量发生时间"},
    
    {A17,"费率3反向无功最大需量发生时间"},
    
    {A17,"费率4反向无功最大需量发生时间"},
    
    
    //三向总有功最大需量
    {A23,"三相总有功最大需量"},
    
    {A18,"三相总有功最大需量发生时间"},
    
    {A23,"A相有功最大需量"},
    
    {A18,"A相有功最大需量发生时间"},
    
    {A23,"B相有功最大需量"},
    
    {A18,"B相有功最大需量发生时间"},
    
    {A23,"C相有功最大需量"},
    
    {A18,"C相有功最大需量发生时间"},
    
    
};


////终端日统计数据
//const int terminal_day_sta[] =
//{
//    //数据时标
//    A20,
//    
//    //终端日供电时间
//    BIN2_30,
//    
//    //终端日复位次数
//    BIN2_30
//};
//
////终端月统计数据
//const int terminal_month_sta[] =
//{
//    //数据时标
//    A21,
//    
//    //终端日供电时间
//    BIN2_30,
//    
//    //终端日复位次数
//    BIN2_30
//};



////终端基本实时数据
//const int terminal_rt_basic_sta[] =
//{
//    
//    BS248_33,    //终端参数状态
//    
//    BIN4_32,     //终端与主站当日通信流量
//    
//    BIN4_32,     //终端与主站当月通信流量
//    
//    BS8_34,      //状态量的状态
//    
//    BS8_34,      //状态量变位标志
//    
//    BIN1_29,     //当前重要事件计数器EC1值
//    
//    BIN1_29      //当前一般事件计数器EC2值
//};
//
//const int mtr_rt_basic_sta[] =
//{
//    
//    A9,    //当前总有功功率
//    
//    A9,    //当前A相有功功率
//    
//    A9,    //当前B相有功功率
//    
//    A9,    //当前C相有功功率
//    
//    A9,    //当前总无功功率
//    
//    A9,    //当前A相无功功率
//    
//    A9,    //当前B相无功功率
//    
//    A9,    //当前C相无功功率
//    
//    A5,    //当前总功率因数
//    
//    A5,    //当前A相功率因数
//    
//    A5,    //当前B相功率因数
//    
//    A5,    //当前C相功率因数
//    
//    A7,    //当前A相电压
//    
//    A7,    //当前B相电压
//    
//    A7,    //当前C相电压
//    
//    A25,   //当前A相电流
//    
//    A25,   //当前B相电流
//    
//    A25,   //当前C相电流
//    
//    A25,   //当前零序电流
//    
//    A9,    //当前总视在功率
//    
//    A9,    //当前A相视在功率
//    
//    A9,    //当前B相视在功率
//    
//    A9,    //当前C相视在功率
//    
//    A5,    //A相电压相角
//    
//    A5,    //B相电压相角
//    
//    A5,    //C相电压相角
//    
//    A5,    //A相电流相角
//    
//    A5,    //B相电流相角
//    
//    A5     //C相电流相角
//};
//
//const int rt_power_value_sta[] =
//{
//    //当前正向有功总电能示值
//    A14,
//    
//    //当前费率1正向有功总电能示值
//    A14,
//    
//    //当前费率2正向有功总电能示值
//    A14,
//    
//    //当前费率3正向有功总电能示值
//    A14,
//    
//    //当前费率4正向有功总电能示值
//    A14,
//    
//    //当前正向无功（组合无功1）总电能示值
//    A11,
//    
//    //当前费率1正向无功（组合无功1）总电能示值
//    A11,
//    
//    //当前费率2正向无功（组合无功1）总电能示值
//    A11,
//    
//    //当前费率3正向无功（组合无功1）总电能示值
//    A11,
//    
//    //当前费率4正向无功（组合无功1）总电能示值
//    A11,
//    
//    //当前一象限无功总电能示值
//    A11,
//    
//    //当前一象限费率1无功电能示值
//    A11,
//    
//    //当前一象限费率2无功电能示值
//    A11,
//    
//    //当前一象限费率3无功电能示值
//    A11,
//    
//    //当前一象限费率4无功电能示值
//    A11,
//    
//    //当前四象限无功总电能示值
//    A11,
//    
//    //当前四象限费率1无功电能示值
//    A11,
//    
//    //当前四象限费率2无功电能示值
//    A11,
//    
//    //当前四象限费率3无功电能示值
//    A11,
//    
//    //当前四象限费率4无功电能示值
//    A11,
//    
//    //当前反向有功总电能示值
//    A14,
//    
//    //当前费率1反向有功总电能示值
//    A14,
//    
//    //当前费率2反向有功总电能示值
//    A14,
//    
//    //当前费率3反向有功总电能示值
//    A14,
//    
//    //当前费率4反向有功总电能示值
//    A14,
//    
//    //当前反向无功（组合无功2）总电能示值
//    A11,
//    
//    //当前费率1反向无功（组合无功2）总电能示值
//    A11,
//    
//    //当前费率2反向无功（组合无功2）总电能示值
//    A11,
//    
//    //当前费率3反向无功（组合无功2）总电能示值
//    A11,
//    
//    //当前费率4反向无功（组合无功2）总电能示值
//    A11,
//    
//    //当前二象限无功总电能示值
//    A11,
//    
//    //当前二象限费率1无功电能示值
//    A11,
//    
//    //当前二象限费率2无功电能示值
//    A11,
//    
//    //当前二象限费率3无功电能示值
//    A11,
//    
//    //当前二象限费率4无功电能示值
//    A11,
//    
//    //当前三象限无功总电能示值
//    A11,
//    
//    //当前三象限费率1无功电能示值
//    A11,
//    
//    //当前三象限费率2无功电能示值
//    A11,
//    
//    //当前三象限费率3无功电能示值
//    A11,
//    
//    //当前三象限费率4无功电能示值
//    A11
//};
//
//const int rt_power_needs_sta[]=
//{
//    //当月正向有功总最大需量
//    A23,
//    
//    //当月正向有功费率1最大需量
//    A23,
//    
//    //当月正向有功费率2最大需量
//    A23,
//    
//    //当月正向有功费率3最大需量
//    A23,
//    
//    //当月正向有功费率4最大需量
//    A23,
//    
//    //当月正向有功总最大需量发生时间
//    A17,
//    
//    //当月正向有功费率1最大需量发生时间
//    A17,
//    
//    //当月正向有功费率2最大需量发生时间
//    A17,
//    
//    //当月正向有功费率3最大需量发生时间
//    A17,
//    
//    //当月正向有功费率4最大需量发生时间
//    A17,
//    
//    //当月正向无功总最大需量
//    A23,
//    
//    //当月正向无功费率1最大需量
//    A23,
//    
//    //当月正向无功费率2最大需量
//    A23,
//    
//    //当月正向无功费率3最大需量
//    A23,
//    
//    //当月正向无功费率4最大需量
//    A23,
//    
//    //当月正向无功总最大需量发生时间
//    A17,
//    
//    //当月正向无功费率1最大需量发生时间
//    A17,
//    
//    //当月正向无功费率2最大需量发生时间
//    A17,
//    
//    //当月正向无功费率3最大需量发生时间
//    A17,
//    
//    //当月正向无功费率4最大需量发生时间
//    A17,
//    
//    //当月反向有功总最大需量
//    A23,
//    
//    //当月反向有功费率1最大需量
//    A23,
//    
//    //当月反向有功费率2最大需量
//    A23,
//    
//    //当月反向有功费率3最大需量
//    A23,
//    
//    //当月反向有功费率4最大需量
//    A23,
//    
//    //当月反向有功总最大需量发生时间
//    A17,
//    
//    //当月反向有功费率1最大需量发生时间
//    A17,
//    
//    //当月反向有功费率2最大需量发生时间
//    A17,
//    
//    //当月反向有功费率3最大需量发生时间
//    A17,
//    
//    //当月反向有功费率4最大需量发生时间
//    A17,
//    
//    //当月反向无功总最大需量
//    A23,
//    
//    //当月反向无功费率1最大需量
//    A23,
//    
//    //当月反向无功费率2最大需量
//    A23,
//    
//    //当月反向无功费率3最大需量
//    A23,
//    
//    //当月反向无功费率4最大需量
//    A23,
//    
//    //当月反向无功总最大需量发生时间
//    A17,
//    
//    //当月反向无功费率1最大需量发生时间
//    A17,
//    
//    //当月反向无功费率2最大需量发生时间
//    A17,
//    
//    //当月反向无功费率3最大需量发生时间
//    A17,
//    
//    //当月反向无功费率4最大需量发生时间
//    A17
//    
//};
//
//const int rt_dc_analog[]=
//{
//    //直流模拟量当前数据
//    A2
//};
//
//const int mtr_rt_harmonic[]=
//{
//    //A相电压2次谐波有效值
//    A7,
//    
//    //A相电压3次谐波有效值
//    A7,
//    
//    //A相电压4次谐波有效值
//    A7,
//    
//    //A相电压5次谐波有效值
//    A7,
//    
//    //A相电压6次谐波有效值
//    A7,
//    
//    //A相电压7次谐波有效值
//    A7,
//    
//    //A相电压8次谐波有效值
//    A7,
//    
//    //A相电压9次谐波有效值
//    A7,
//    
//    //A相电压10次谐波有效值
//    A7,
//    
//    //A相电压11次谐波有效值
//    A7,
//    
//    //A相电压12次谐波有效值
//    A7,
//    
//    //A相电压13次谐波有效值
//    A7,
//    
//    //A相电压14次谐波有效值
//    A7,
//    
//    //A相电压15次谐波有效值
//    A7,
//    
//    //A相电压16次谐波有效值
//    A7,
//    
//    //A相电压17次谐波有效值
//    A7,
//    
//    //A相电压18次谐波有效值
//    A7,
//    
//    //A相电压19次谐波有效值
//    A7,
//    
//    //B相电压2次谐波有效值
//    A7,
//    
//    //B相电压3次谐波有效值
//    A7,
//    
//    //B相电压4次谐波有效值
//    A7,
//    
//    //B相电压5次谐波有效值
//    A7,
//    
//    //B相电压6次谐波有效值
//    A7,
//    
//    //B相电压7次谐波有效值
//    A7,
//    
//    //B相电压8次谐波有效值
//    A7,
//    
//    //B相电压9次谐波有效值
//    A7,
//    
//    //B相电压10次谐波有效值
//    A7,
//    
//    //B相电压11次谐波有效值
//    A7,
//    
//    //B相电压12次谐波有效值
//    A7,
//    
//    //B相电压13次谐波有效值
//    A7,
//    
//    //B相电压14次谐波有效值
//    A7,
//    
//    //B相电压15次谐波有效值
//    A7,
//    
//    //B相电压16次谐波有效值
//    A7,
//    
//    //B相电压17次谐波有效值
//    A7,
//    
//    //B相电压18次谐波有效值
//    A7,
//    
//    //B相电压19次谐波有效值
//    A7,
//    
//    //C相电压2次谐波有效值
//    A7,
//    
//    //C相电压3次谐波有效值
//    A7,
//    
//    //C相电压4次谐波有效值
//    A7,
//    
//    //C相电压5次谐波有效值
//    A7,
//    
//    //C相电压6次谐波有效值
//    A7,
//    
//    //C相电压7次谐波有效值
//    A7,
//    
//    //C相电压8次谐波有效值
//    A7,
//    
//    //C相电压9次谐波有效值
//    A7,
//    
//    //C相电压10次谐波有效值
//    A7,
//    
//    //C相电压11次谐波有效值
//    A7,
//    
//    //C相电压12次谐波有效值
//    A7,
//    
//    //C相电压13次谐波有效值
//    A7,
//    
//    //C相电压14次谐波有效值
//    A7,
//    
//    //C相电压15次谐波有效值
//    A7,
//    
//    //C相电压16次谐波有效值
//    A7,
//    
//    //C相电压17次谐波有效值
//    A7,
//    
//    //C相电压18次谐波有效值
//    A7,
//    
//    //C相电压19次谐波有效值
//    A7,
//    
//    //A相电流2次谐波有效值
//    A6,
//    
//    //A相电流3次谐波有效值
//    A6,
//    
//    //A相电流4次谐波有效值
//    A6,
//    
//    //A相电流5次谐波有效值
//    A6,
//    
//    //A相电流6次谐波有效值
//    A6,
//    
//    //A相电流7次谐波有效值
//    A6,
//    
//    //A相电流8次谐波有效值
//    A6,
//    
//    //A相电流9次谐波有效值
//    A6,
//    
//    //A相电流10次谐波有效值
//    A6,
//    
//    //A相电流11次谐波有效值
//    A6,
//    
//    //A相电流12次谐波有效值
//    A6,
//    
//    //A相电流13次谐波有效值
//    A6,
//    
//    //A相电流14次谐波有效值
//    A6,
//    
//    //A相电流15次谐波有效值
//    A6,
//    
//    //A相电流16次谐波有效值
//    A6,
//    
//    //A相电流17次谐波有效值
//    A6,
//    
//    //A相电流18次谐波有效值
//    A6,
//    
//    //A相电流19次谐波有效值
//    A6,
//    
//    //B相电流2次谐波有效值
//    A6,
//    
//    //B相电流3次谐波有效值
//    A6,
//    
//    //B相电流4次谐波有效值
//    A6,
//    
//    //B相电流5次谐波有效值
//    A6,
//    
//    //B相电流6次谐波有效值
//    A6,
//    
//    //B相电流7次谐波有效值
//    A6,
//    
//    //B相电流8次谐波有效值
//    A6,
//    
//    //B相电流9次谐波有效值
//    A6,
//    
//    //B相电流10次谐波有效值
//    A6,
//    
//    //B相电流11次谐波有效值
//    A6,
//    
//    //B相电流12次谐波有效值
//    A6,
//    
//    //B相电流13次谐波有效值
//    A6,
//    
//    //B相电流14次谐波有效值
//    A6,
//    
//    //B相电流15次谐波有效值
//    A6,
//    
//    //B相电流16次谐波有效值
//    A6,
//    
//    //B相电流17次谐波有效值
//    A6,
//    
//    //B相电流18次谐波有效值
//    A6,
//    
//    //B相电流19次谐波有效值
//    A6,
//    
//    //C相电流2次谐波有效值
//    A6,
//    
//    //C相电流3次谐波有效值
//    A6,
//    
//    //C相电流4次谐波有效值
//    A6,
//    
//    //C相电流5次谐波有效值
//    A6,
//    
//    //C相电流6次谐波有效值
//    A6,
//    
//    //C相电流7次谐波有效值
//    A6,
//    
//    //C相电流8次谐波有效值
//    A6,
//    
//    //C相电流9次谐波有效值
//    A6,
//    
//    //C相电流10次谐波有效值
//    A6,
//    
//    //C相电流11次谐波有效值
//    A6,
//    
//    //C相电流12次谐波有效值
//    A6,
//    
//    //C相电流13次谐波有效值
//    A6,
//    
//    //C相电流14次谐波有效值
//    A6,
//    
//    //C相电流15次谐波有效值
//    A6,
//    
//    //C相电流16次谐波有效值
//    A6,
//    
//    //C相电流17次谐波有效值
//    A6,
//    
//    //C相电流18次谐波有效值
//    A6,
//    
//    //C相电流19次谐波有效值
//    A6,
//    
//    //当前A相电压总谐波含有率
//    A5,
//    
//    //当前A相电压2次谐波含有率
//    A5,
//    
//    //当前A相电压3次谐波含有率
//    A5,
//    
//    //当前A相电压4次谐波含有率
//    A5,
//    
//    //当前A相电压5次谐波含有率
//    A5,
//    
//    //当前A相电压6次谐波含有率
//    A5,
//    
//    //当前A相电压7次谐波含有率
//    A5,
//    
//    //当前A相电压8次谐波含有率
//    A5,
//    
//    //当前A相电压9次谐波含有率
//    A5,
//    
//    //当前A相电压10次谐波含有率
//    A5,
//    
//    //当前A相电压11次谐波含有率
//    A5,
//    
//    //当前A相电压12次谐波含有率
//    A5,
//    
//    //当前A相电压13次谐波含有率
//    A5,
//    
//    //当前A相电压14次谐波含有率
//    A5,
//    
//    //当前A相电压15次谐波含有率
//    A5,
//    
//    //当前A相电压16次谐波含有率
//    A5,
//    
//    //当前A相电压17次谐波含有率
//    A5,
//    
//    //当前A相电压18次谐波含有率
//    A5,
//    
//    //当前A相电压19次谐波含有率
//    A5,
//    
//    //当前B相电压总谐波含有率
//    A5,
//    
//    //当前B相电压2次谐波含有率
//    A5,
//    
//    //当前B相电压3次谐波含有率
//    A5,
//    
//    //当前B相电压4次谐波含有率
//    A5,
//    
//    //当前B相电压5次谐波含有率
//    A5,
//    
//    //当前B相电压6次谐波含有率
//    A5,
//    
//    //当前B相电压7次谐波含有率
//    A5,
//    
//    //当前B相电压8次谐波含有率
//    A5,
//    
//    //当前B相电压9次谐波含有率
//    A5,
//    
//    //当前B相电压10次谐波含有率
//    A5,
//    
//    //当前B相电压11次谐波含有率
//    A5,
//    
//    //当前B相电压12次谐波含有率
//    A5,
//    
//    //当前B相电压13次谐波含有率
//    A5,
//    
//    //当前B相电压14次谐波含有率
//    A5,
//    
//    //当前B相电压15次谐波含有率
//    A5,
//    
//    //当前B相电压16次谐波含有率
//    A5,
//    
//    //当前B相电压17次谐波含有率
//    A5,
//    
//    //当前B相电压18次谐波含有率
//    A5,
//    
//    //当前B相电压19次谐波含有率
//    A5,
//    
//    //当前C相电压总谐波含有率
//    A5,
//    
//    //当前C相电压2次谐波含有率
//    A5,
//    
//    //当前C相电压3次谐波含有率
//    A5,
//    
//    //当前C相电压4次谐波含有率
//    A5,
//    
//    //当前C相电压5次谐波含有率
//    A5,
//    
//    //当前C相电压6次谐波含有率
//    A5,
//    
//    //当前C相电压7次谐波含有率
//    A5,
//    
//    //当前C相电压8次谐波含有率
//    A5,
//    
//    //当前C相电压9次谐波含有率
//    A5,
//    
//    //当前C相电压10次谐波含有率
//    A5,
//    
//    //当前C相电压11次谐波含有率
//    A5,
//    
//    //当前C相电压12次谐波含有率
//    A5,
//    
//    //当前C相电压13次谐波含有率
//    A5,
//    
//    //当前C相电压14次谐波含有率
//    A5,
//    
//    //当前C相电压15次谐波含有率
//    A5,
//    
//    //当前C相电压16次谐波含有率
//    A5,
//    
//    //当前C相电压17次谐波含有率
//    A5,
//    
//    //当前C相电压18次谐波含有率
//    A5,
//    
//    //当前C相电压19次谐波含有率
//    A5,
//    
//    //当前A相电流总谐波含有率
//    A5,
//    
//    //当前A相电流2次谐波含有率
//    A5,
//    
//    //当前A相电流3次谐波含有率
//    A5,
//    
//    //当前A相电流4次谐波含有率
//    A5,
//    
//    //当前A相电流5次谐波含有率
//    A5,
//    
//    //当前A相电流6次谐波含有率
//    A5,
//    
//    //当前A相电流7次谐波含有率
//    A5,
//    
//    //当前A相电流8次谐波含有率
//    A5,
//    
//    //当前A相电流9次谐波含有率
//    A5,
//    
//    //当前A相电流10次谐波含有率
//    A5,
//    
//    //当前A相电流11次谐波含有率
//    A5,
//    
//    //当前A相电流12次谐波含有率
//    A5,
//    
//    //当前A相电流13次谐波含有率
//    A5,
//    
//    //当前A相电流14次谐波含有率
//    A5,
//    
//    //当前A相电流15次谐波含有率
//    A5,
//    
//    //当前A相电流16次谐波含有率
//    A5,
//    
//    //当前A相电流17次谐波含有率
//    A5,
//    
//    //当前A相电流18次谐波含有率
//    A5,
//    
//    //当前A相电流19次谐波含有率
//    A5,
//    
//    //当前B相电流总谐波含有率
//    A5,
//    
//    //当前B相电流2次谐波含有率
//    A5,
//    
//    //当前B相电流3次谐波含有率
//    A5,
//    
//    //当前B相电流4次谐波含有率
//    A5,
//    
//    //当前B相电流5次谐波含有率
//    A5,
//    
//    //当前B相电流6次谐波含有率
//    A5,
//    
//    //当前B相电流7次谐波含有率
//    A5,
//    
//    //当前B相电流8次谐波含有率
//    A5,
//    
//    //当前B相电流9次谐波含有率
//    A5,
//    
//    //当前B相电流10次谐波含有率
//    A5,
//    
//    //当前B相电流11次谐波含有率
//    A5,
//    
//    //当前B相电流12次谐波含有率
//    A5,
//    
//    //当前B相电流13次谐波含有率
//    A5,
//    
//    //当前B相电流14次谐波含有率
//    A5,
//    
//    //当前B相电流15次谐波含有率
//    A5,
//    
//    //当前B相电流16次谐波含有率
//    A5,
//    
//    //当前B相电流17次谐波含有率
//    A5,
//    
//    //当前B相电流18次谐波含有率
//    A5,
//    
//    //当前B相电流19次谐波含有率
//    A5,
//    
//    //当前C相电流总谐波含有率
//    A5,
//    
//    //当前C相电流2次谐波含有率
//    A5,
//    
//    //当前C相电流3次谐波含有率
//    A5,
//    
//    //当前C相电流4次谐波含有率
//    A5,
//    
//    //当前C相电流5次谐波含有率
//    A5,
//    
//    //当前C相电流6次谐波含有率
//    A5,
//    
//    //当前C相电流7次谐波含有率
//    A5,
//    
//    //当前C相电流8次谐波含有率
//    A5,
//    
//    //当前C相电流9次谐波含有率
//    A5,
//    
//    //当前C相电流10次谐波含有率
//    A5,
//    
//    //当前C相电流11次谐波含有率
//    A5,
//    
//    //当前C相电流12次谐波含有率
//    A5,
//    
//    //当前C相电流13次谐波含有率
//    A5,
//    
//    //当前C相电流14次谐波含有率
//    A5,
//    
//    //当前C相电流15次谐波含有率
//    A5,
//    
//    //当前C相电流16次谐波含有率
//    A5,
//    
//    //当前C相电流17次谐波含有率
//    A5,
//    
//    //当前C相电流18次谐波含有率
//    A5,
//    
//    //当前C相电流19次谐波含有率
//    A5
//};
//
//
//
//
//
////测量点曲线数据
//const int measure_curve_data[] =
//{
//    A15,    //日期
//    
//    BIN1_29,//密度
//    
//    BIN1_29,//点数
//    
//    A9,//功率曲线类型
//    
//    A7,//电压曲线类型
//    
//    A25,//电流曲线类型
//    
//    A5, //功率因素曲线
//    
//    A2,//直流模拟量数据曲线
//};
//
//
////直流模拟量日数据
//const int dcanalog_day_data[] =
//{
//    
//    
//    A20,  //日数据时标
//    
//    BIN2_30,//直流模拟量越上限日累计时间
//    
//    BIN2_30,//直流模拟量越下限日累计时间
//    
//    A2,//直流模拟量日最大值
//    
//    A18,//直流模拟量日最大值发生时间
//    
//    A2,//直流模拟量日最小值
//    
//    A18//直流模拟量日最小值发生时间
//    
//};
//
//
////直流模拟量月数据
//const int dcanalog_month_data[] =
//{
//    A21,  //月数据时标
//    
//    BIN2_30,//直流模拟量越上限月累计时间
//    
//    BIN2_30,//直流模拟量越下限月累计时间
//    
//    A2,//直流模拟量月最大值
//    
//    A18,//直流模拟量月最大值发生时间
//    
//    A2,//直流模拟量月最小值
//    
//    A18//直流模拟量月最小值发生时间
//};
//
//
//
////测量点日数据——电压谐波数据
//const int daily_data_vharmonic[] =
//{
//    
//    A20,  //日数据时标
//    
//    /*A相2－19次谐波电压含有率日最大值及发生时间*/
//    A5,//A相2次谐波电压含有率日最大值
//    
//    A17,//A相2次谐波电压含有率日最大值发生时间
//    
//    A5,//A相3次谐波电压含有率日最大值
//    
//    A17,//A相3次谐波电压含有率日最大值发生时间
//    
//    A5,//A相4次谐波电压含有率日最大值
//    
//    A17,//A相4次谐波电压含有率日最大值发生时间
//    
//    A5,//A相5次谐波电压含有率日最大值
//    
//    A17,//A相5次谐波电压含有率日最大值发生时间
//    
//    A5,//A相6次谐波电压含有率日最大值
//    
//    A17,//A相6次谐波电压含有率日最大值发生时间
//    
//    A5,//A相7次谐波电压含有率日最大值
//    
//    A17,//A相7次谐波电压含有率日最大值发生时间
//    
//    A5,//A相8次谐波电压含有率日最大值
//    
//    A17,//A相8次谐波电压含有率日最大值发生时间
//    
//    A5,//A相9次谐波电压含有率日最大值
//    
//    A17,//A相9次谐波电压含有率日最大值发生时间
//    
//    A5,//A相10次谐波电压含有率日最大值
//    
//    A17,//A相10次谐波电压含有率日最大值发生时间
//    
//    A5,//A相11次谐波电压含有率日最大值
//    
//    A17,//A相11次谐波电压含有率日最大值发生时间
//    
//    A5,//A相12次谐波电压含有率日最大值
//    
//    A17,//A相12次谐波电压含有率日最大值发生时间
//    
//    A5,//A相13次谐波电压含有率日最大值
//    
//    A17,//A相13次谐波电压含有率日最大值发生时间
//    
//    A5,//A相14次谐波电压含有率日最大值
//    
//    A17,//A相14次谐波电压含有率日最大值发生时间
//    
//    A5,//A相15次谐波电压含有率日最大值
//    
//    A17,//A相15次谐波电压含有率日最大值发生时间
//    
//    A5,//A相16次谐波电压含有率日最大值
//    
//    A17,//A相16次谐波电压含有率日最大值发生时间
//    
//    A5,//A相17次谐波电压含有率日最大值
//    
//    A17,//A相17次谐波电压含有率日最大值发生时间
//    
//    A5,//A相18次谐波电压含有率日最大值
//    
//    A17,//A相18次谐波电压含有率日最大值发生时间
//    
//    A5,//A相19次谐波电压含有率日最大值
//    
//    A17,//A相19次谐波电压含有率日最大值发生时间
//    
//    //A相总谐波电压含有率日最大值及+A相总畸变电压含有率日最大值发生时间
//    A5,//A相总谐波电压含有率日最大值
//    
//    A17,//A相总谐波电压含有率日最大值发生时间
//    
//    
//    /*B相2－19次谐波电压含有率日最大值及发生时间*/
//    A5,//B相2次谐波电压含有率日最大值
//    
//    A17,//B相2次谐波电压含有率日最大值发生时间
//    
//    A5,//B相3次谐波电压含有率日最大值
//    
//    A17,//B相3次谐波电压含有率日最大值发生时间
//    
//    A5,//B相4次谐波电压含有率日最大值
//    
//    A17,//B相4次谐波电压含有率日最大值发生时间
//    
//    A5,//B相5次谐波电压含有率日最大值
//    
//    A17,//B相5次谐波电压含有率日最大值发生时间
//    
//    A5,//B相6次谐波电压含有率日最大值
//    
//    A17,//B相6次谐波电压含有率日最大值发生时间
//    
//    A5,//B相7次谐波电压含有率日最大值
//    
//    A17,//B相7次谐波电压含有率日最大值发生时间
//    
//    A5,//B相8次谐波电压含有率日最大值
//    
//    A17,//B相8次谐波电压含有率日最大值发生时间
//    
//    A5,//B相9次谐波电压含有率日最大值
//    
//    A17,//B相9次谐波电压含有率日最大值发生时间
//    
//    A5,//B相10次谐波电压含有率日最大值
//    
//    A17,//B相10次谐波电压含有率日最大值发生时间
//    
//    A5,//B相11次谐波电压含有率日最大值
//    
//    A17,//B相11次谐波电压含有率日最大值发生时间
//    
//    A5,//B相12次谐波电压含有率日最大值
//    
//    A17,//B相12次谐波电压含有率日最大值发生时间
//    
//    A5,//B相13次谐波电压含有率日最大值
//    
//    A17,//B相13次谐波电压含有率日最大值发生时间
//    
//    A5,//B相14次谐波电压含有率日最大值
//    
//    A17,//B相14次谐波电压含有率日最大值发生时间
//    
//    A5,//B相15次谐波电压含有率日最大值
//    
//    A17,//B相15次谐波电压含有率日最大值发生时间
//    
//    A5,//B相16次谐波电压含有率日最大值
//    
//    A17,//B相16次谐波电压含有率日最大值发生时间
//    
//    A5,//B相17次谐波电压含有率日最大值
//    
//    A17,//B相17次谐波电压含有率日最大值发生时间
//    
//    A5,//B相18次谐波电压含有率日最大值
//    
//    A17,//B相18次谐波电压含有率日最大值发生时间
//    
//    A5,//B相19次谐波电压含有率日最大值
//    
//    A17,//B相19次谐波电压含有率日最大值发生时间
//    
//    //B相总谐波电压含有率日最大值及+A相总畸变电压含有率日最大值发生时间
//    A5,//B相总谐波电压含有率日最大值
//    
//    A17,//B相总谐波电压含有率日最大值发生时间
//    
//    
//    
//    /*C相2－19次谐波电压含有率日最大值及发生时间*/
//    A5,//C相2次谐波电压含有率日最大值
//    
//    A17,//C相2次谐波电压含有率日最大值发生时间
//    
//    A5,//C相3次谐波电压含有率日最大值
//    
//    A17,//C相3次谐波电压含有率日最大值发生时间
//    
//    A5,//C相4次谐波电压含有率日最大值
//    
//    A17,//C相4次谐波电压含有率日最大值发生时间
//    
//    A5,//C相5次谐波电压含有率日最大值
//    
//    A17,//C相5次谐波电压含有率日最大值发生时间
//    
//    A5,//C相6次谐波电压含有率日最大值
//    
//    A17,//C相6次谐波电压含有率日最大值发生时间
//    
//    A5,//C相7次谐波电压含有率日最大值
//    
//    A17,//C相7次谐波电压含有率日最大值发生时间
//    
//    A5,//C相8次谐波电压含有率日最大值
//    
//    A17,//C相8次谐波电压含有率日最大值发生时间
//    
//    A5,//C相9次谐波电压含有率日最大值
//    
//    A17,//C相9次谐波电压含有率日最大值发生时间
//    
//    A5,//C相10次谐波电压含有率日最大值
//    
//    A17,//C相10次谐波电压含有率日最大值发生时间
//    
//    A5,//C相11次谐波电压含有率日最大值
//    
//    A17,//C相11次谐波电压含有率日最大值发生时间
//    
//    A5,//C相12次谐波电压含有率日最大值
//    
//    A17,//C相12次谐波电压含有率日最大值发生时间
//    
//    A5,//C相13次谐波电压含有率日最大值
//    
//    A17,//C相13次谐波电压含有率日最大值发生时间
//    
//    A5,//C相14次谐波电压含有率日最大值
//    
//    A17,//C相14次谐波电压含有率日最大值发生时间
//    
//    A5,//C相15次谐波电压含有率日最大值
//    
//    A17,//C相15次谐波电压含有率日最大值发生时间
//    
//    A5,//C相16次谐波电压含有率日最大值
//    
//    A17,//C相16次谐波电压含有率日最大值发生时间
//    
//    A5,//C相17次谐波电压含有率日最大值
//    
//    A17,//C相17次谐波电压含有率日最大值发生时间
//    
//    A5,//C相18次谐波电压含有率日最大值
//    
//    A17,//C相18次谐波电压含有率日最大值发生时间
//    
//    A5,//C相19次谐波电压含有率日最大值
//    
//    A17,//C相19次谐波电压含有率日最大值发生时间
//    
//    //C相总谐波电压含有率日最大值及+A相总畸变电压含有率日最大值发生时间
//    A5,//C相总谐波电压含有率日最大值
//    
//    A17,//C相总谐波电压含有率日最大值发生时间
//    
//};
//
//
//
//
//
////测量点日数据——电流谐波类数据
//const int daily_data_charmonic[] =
//{
//    A20,  //日数据时标
//    
//    
//    /*A相2－19次谐波电流日最大值及发生时间*/
//    A6,//A相2次谐波电流日最大值
//    
//    A17,//A相2次谐波电流日最大值发生时间
//    
//    A6,//A相3次谐波电流日最大值
//    
//    A17,//A相3次谐波电流日最大值发生时间
//    
//    
//    A6,//A相4次谐波电流日最大值
//    
//    A17,//A相4次谐波电流日最大值发生时间
//    
//    A6,//A相5次谐波电流日最大值
//    
//    A17,//A相5次谐波电流日最大值发生时间
//    
//    A6,//A相6次谐波电流日最大值
//    
//    A17,//A相6次谐波电流日最大值发生时间
//    
//    A6,//A相7次谐波电流日最大值
//    
//    A17,//A相7次谐波电流日最大值发生时间
//    
//    A6,//A相8次谐波电流日最大值
//    
//    A17,//A相8次谐波电流日最大值发生时间
//    
//    A6,//A相9次谐波电流日最大值
//    
//    A17,//A相9次谐波电流日最大值发生时间
//    
//    A6,//A相10次谐波电流日最大值
//    
//    A17,//A相10次谐波电流日最大值发生时间
//    
//    A6,//A相11次谐波电流日最大值
//    
//    A17,//A相11次谐波电流日最大值发生时间
//    
//    A6,//A相12次谐波电流日最大值
//    
//    A17,//A相12次谐波电流日最大值发生时间
//    
//    A6,//A相13次谐波电流日最大值
//    
//    A17,//A相13次谐波电流日最大值发生时间
//    
//    A6,//A相14次谐波电流日最大值
//    
//    A17,//A相14次谐波电流日最大值发生时间
//    
//    A6,//A相15次谐波电流日最大值
//    
//    A17,//A相15次谐波电流日最大值发生时间
//    
//    A6,//A相16次谐波电流日最大值
//    
//    A17,//A相16次谐波电流日最大值发生时间
//    
//    A6,//A相17次谐波电流日最大值
//    
//    A17,//A相17次谐波电流日最大值发生时间
//    
//    A6,//A相18次谐波电流日最大值
//    
//    A17,//A相18次谐波电流日最大值发生时间
//    
//    A6,//A相19次谐波电流日最大值
//    
//    A17,//A相19次谐波电流日最大值发生时间
//    /*A相总畸变电流日最大值+A相总畸变电流日最大值发生时间*/
//    A6,//A相总畸变电流日最大值
//    
//    A17,//A相总畸变电流日最大值发生时间
//    
//    
//    /*B相2－19次谐波电流日最大值及发生时间*/
//    A6,//B相2次谐波电流日最大值
//    
//    A17,//B相2次谐波电流日最大值发生时间
//    
//    A6,//B相3次谐波电流日最大值
//    
//    A17,//B相3次谐波电流日最大值发生时间
//    
//    
//    A6,//B相4次谐波电流日最大值
//    
//    A17,//B相4次谐波电流日最大值发生时间
//    
//    A6,//B相5次谐波电流日最大值
//    
//    A17,//B相5次谐波电流日最大值发生时间
//    
//    A6,//B相6次谐波电流日最大值
//    
//    A17,//B相6次谐波电流日最大值发生时间
//    
//    A6,//B相7次谐波电流日最大值
//    
//    A17,//B相7次谐波电流日最大值发生时间
//    
//    A6,//B相8次谐波电流日最大值
//    
//    A17,//B相8次谐波电流日最大值发生时间
//    
//    A6,//B相9次谐波电流日最大值
//    
//    A17,//B相9次谐波电流日最大值发生时间
//    
//    
//    A6,//B相10次谐波电流日最大值
//    
//    A17,//B相10次谐波电流日最大值发生时间
//    
//    
//    A6,//B相11次谐波电流日最大值
//    
//    A17,//B相11次谐波电流日最大值发生时间
//    
//    A6,//B相12次谐波电流日最大值
//    
//    A17,//B相12次谐波电流日最大值发生时间
//    
//    A6,//B相13次谐波电流日最大值
//    
//    A17,//B相13次谐波电流日最大值发生时间
//    
//    A6,//B相14次谐波电流日最大值
//    
//    A17,//B相14次谐波电流日最大值发生时间
//    
//    A6,//B相15次谐波电流日最大值
//    
//    A17,//B相15次谐波电流日最大值发生时间
//    
//    A6,//B相16次谐波电流日最大值
//    
//    A17,//B相16次谐波电流日最大值发生时间
//    
//    A6,//B相17次谐波电流日最大值
//    
//    A17,//B相17次谐波电流日最大值发生时间
//    
//    A6,//B相18次谐波电流日最大值
//    
//    A17,//B相18次谐波电流日最大值发生时间
//    
//    A6,//B相19次谐波电流日最大值
//    
//    A17,//B相19次谐波电流日最大值发生时间
//    /*B相总畸变电流日最大值+A相总畸变电流日最大值发生时间*/
//    A6,//B相总畸变电流日最大值
//    
//    A17,//B相总畸变电流日最大值发生时间
//    
//    
//    /*C相2－19次谐波电流日最大值及发生时间*/
//    A6,//C相2次谐波电流日最大值
//    
//    A17,//C相2次谐波电流日最大值发生时间
//    
//    A6,//C相3次谐波电流日最大值
//    
//    A17,//C相3次谐波电流日最大值发生时间
//    
//    
//    A6,//C相4次谐波电流日最大值
//    
//    A17,//C相4次谐波电流日最大值发生时间
//    
//    A6,//C相5次谐波电流日最大值
//    
//    A17,//C相5次谐波电流日最大值发生时间
//    
//    A6,//C相6次谐波电流日最大值
//    
//    A17,//C相6次谐波电流日最大值发生时间
//    
//    A6,//C相7次谐波电流日最大值
//    
//    A17,//C相7次谐波电流日最大值发生时间
//    
//    A6,//C相8次谐波电流日最大值
//    
//    A17,//C相8次谐波电流日最大值发生时间
//    
//    A6,//C相9次谐波电流日最大值
//    
//    A17,//C相9次谐波电流日最大值发生时间
//    
//    A6,//C相10次谐波电流日最大值
//    
//    A17,//C相10次谐波电流日最大值发生时间
//    
//    A6,//C相11次谐波电流日最大值
//    
//    A17,//C相11次谐波电流日最大值发生时间
//    
//    A6,//C相12次谐波电流日最大值
//    
//    A17,//C相12次谐波电流日最大值发生时间
//    
//    A6,//C相13次谐波电流日最大值
//    
//    A17,//C相13次谐波电流日最大值发生时间
//    
//    A6,//C相14次谐波电流日最大值
//    
//    A17,//C相14次谐波电流日最大值发生时间
//    
//    A6,//C相15次谐波电流日最大值
//    
//    A17,//C相15次谐波电流日最大值发生时间
//    
//    A6,//C相16次谐波电流日最大值
//    
//    A17,//C相16次谐波电流日最大值发生时间
//    
//    
//    A6,//C相17次谐波电流日最大值
//    
//    A17,//C相17次谐波电流日最大值发生时间
//    
//    A6,//C相18次谐波电流日最大值
//    
//    A17,//C相18次谐波电流日最大值发生时间
//    
//    A6,//C相19次谐波电流日最大值
//    
//    A17,//C相19次谐波电流日最大值发生时间
//    /*C相总畸变电流日最大值+A相总畸变电流日最大值发生时间*/
//    A6,//C相总畸变电流日最大值
//    
//    A17,//C相总畸变电流日最大值发生时间
//    
//    
//};
//
////测量点日电能示值数据
//const int measure_day_powervalue[]=
//{
//    
//    A20, //数据时标
//    //正向有功总电能示值
//    A14,//正向有功总电能示值
//    
//    A14,//费率1正向有功电能示值
//    
//    A14,//费率2正向有功电能示值
//    
//    A14,//费率3正向有功电能示值
//    
//    A14,//费率4正向有功电能示值
//    
//    
//    
//    //正向无功
//    A11,//正向无功总电能示值
//    
//    A11,//正向无功费率1电能示值
//    
//    A11,//正向无功费率2电能示值
//    
//    A11,//正向无功费率3电能示值
//    
//    A11,//正向无功费率4电能示值
//    
//    //一象限无功
//    
//    A11,//一象限无功总电能示值
//    
//    A11,//一象限无功费率1电能示值
//    
//    A11,//一象限无功费率2电能示值
//    
//    A11,//一象限无功费率3电能示值
//    
//    A11,//一象限无功费率4电能示值
//    
//    //四象限无功
//    A11,//四象限无功总电能示值
//    
//    A11,//四象限无功费率1电能示值
//    
//    A11,//四象限无功费率2电能示值
//    
//    A11,//四象限无功费率3电能示值
//    
//    A11,//四象限无功费率4电能示值
//    
//    
//    //反向有功
//    A14,//反向有功总电能示值
//    
//    A14,//费率1反向有功电能示值
//    
//    A14,//费率2反向有功电能示值
//    
//    A14,//费率3反向有功电能示值
//    
//    A14,//费率4反向有功电能示值
//    
//    
//    //反向无功
//    A11,//反向无功总电能示值
//    
//    A11,//反向无功费率1电能示值
//    
//    A11,//反向无功费率2电能示值
//    
//    A11,//反向无功费率3电能示值
//    
//    A11,//反向无功费率4电能示值
//    
//    
//    //二象限无功
//    A11,//二象限无功总电能示值
//    
//    A11,//二象限无功费率1电能示值
//    
//    A11,//二象限无功费率2电能示值
//    
//    A11,//二象限无功费率3电能示值
//    
//    A11,//二象限无功费率4电能示值
//    
//    
//    //三象限无功
//    A11,//三象限无功总电能示值
//    
//    A11,//三象限无功费率1电能示值
//    
//    A11,//三象限无功费率2电能示值
//    
//    A11,//三象限无功费率3电能示值
//    
//    A11,//三象限无功费率4电能示值
//    
//    
//    
//    //正向无功（组合无功1）
//    A11,//正向无功总电能示值
//    
//    A11,//正向无功费率1电能示值
//    
//    A11,//正向无功费率2电能示值
//    
//    A11,//正向无功费率3电能示值
//    
//    A11,//正向无功费率4电能示值
//    
//    //反向无功（组合无功1）
//    A11,//反向无功总电能示值
//    
//    A11,//反向无功费率1电能示值
//    
//    A11,//反向无功费率2电能示值
//    
//    A11,//反向无功费率3电能示值
//    
//    A11,//反向无功费率4电能示值
//    
//};
//
//
////测量点月电能示值数据
//const int measure_month_powervalue[]=
//{
//    A21,  //数据时标
//    
//    //正向有功总电能示值
//    A14,//正向有功总电能示值
//    
//    A14,//费率1正向有功电能示值
//    
//    A14,//费率2正向有功电能示值
//    
//    A14,//费率3正向有功电能示值
//    
//    A14,//费率4正向有功电能示值
//    
//    
//    
//    //正向无功
//    A11,//正向无功总电能示值
//    
//    A11,//正向无功费率1电能示值
//    
//    A11,//正向无功费率2电能示值
//    
//    A11,//正向无功费率3电能示值
//    
//    A11,//正向无功费率4电能示值
//    
//    //一象限无功
//    A11,//一象限无功总电能示值
//    
//    A11,//一象限无功费率1电能示值
//    
//    A11,//一象限无功费率2电能示值
//    
//    A11,//一象限无功费率3电能示值
//    
//    A11,//一象限无功费率4电能示值
//    //四象限无功
//    A11,//四象限无功总电能示值
//    
//    A11,//四象限无功费率1电能示值
//    
//    A11,//四象限无功费率2电能示值
//    
//    A11,//四象限无功费率3电能示值
//    
//    A11,//四象限无功费率4电能示值
//    
//    
//    //反向有功
//    A14,//反向有功总电能示值
//    
//    A14,//费率1反向有功电能示值
//    
//    A14,//费率2反向有功电能示值
//    
//    A14,//费率3反向有功电能示值
//    
//    A14,//费率4反向有功电能示值
//    
//    
//    //反向无功
//    A11,//反向无功总电能示值
//    
//    A11,//反向无功费率1电能示值
//    
//    A11,//反向无功费率2电能示值
//    
//    A11,//反向无功费率3电能示值
//    
//    A11,//反向无功费率4电能示值
//    
//    
//    //二象限无功
//    A11,//二象限无功总电能示值
//    
//    A11,//二象限无功费率1电能示值
//    
//    A11,//二象限无功费率2电能示值
//    
//    A11,//二象限无功费率3电能示值
//    
//    A11,//二象限无功费率4电能示值
//    
//    
//    //三象限无功
//    A11,//三象限无功总电能示值
//    
//    A11,//三象限无功费率1电能示值
//    
//    A11,//三象限无功费率2电能示值
//    
//    A11,//三象限无功费率3电能示值
//    
//    A11,//三象限无功费率4电能示值
//    
//    
//    
//    //正向无功（组合无功1）
//    A11,//正向无功总电能示值
//    
//    A11,//正向无功费率1电能示值
//    
//    A11,//正向无功费率2电能示值
//    
//    A11,//正向无功费率3电能示值
//    
//    A11,//正向无功费率4电能示值
//    
//    //反向无功（组合无功1）
//    A11,//反向无功总电能示值
//    
//    A11,//反向无功费率1电能示值
//    
//    A11,//反向无功费率2电能示值
//    
//    A11,//反向无功费率3电能示值
//    
//    A11,//反向无功费率4电能示值
//    
//    
//};
//
//
////历史数据测量日统计数据
//const int measure_day_sta[]=
//{
//    A20,   //日数据时标
//    BIN2_30,//A相电压越上上限月累计时间
//    
//    BIN2_30,//A相电压越下下限月累计时间
//    
//    BIN2_30,//A相电压越上限月累计时间
//    
//    BIN2_30,//A相电压越下限月累计时间
//    
//    BIN2_30,//A相电压合格月累计时间
//    
//    
//    BIN2_30,//B相电压越上上限月累计时间
//    
//    BIN2_30,//B相电压越下下限月累计时间
//    
//    BIN2_30,//B相电压越上限月累计时间
//    
//    BIN2_30,//B相电压越下限月累计时间
//    
//    BIN2_30,//B相电压合格月累计时间
//    
//    
//    BIN2_30,//C相电压越上上限月累计时间
//    
//    BIN2_30,//C相电压越下下限月累计时间
//    
//    BIN2_30,//C相电压越上限月累计时间
//    
//    BIN2_30,//C相电压越下限月累计时间
//    
//    BIN2_30,//C相电压合格月累计时间
//    
//    
//    A7,//A相电压最大值
//    
//    A18,//A相电压最大值发生时间
//    
//    A7,//A相电压最小值
//    
//    A18,//A相电压最小值发生时间
//    
//    A7,//B相电压最大值
//    
//    A18,//B相电压最大值发生时间
//    
//    A7,//B相电压最小值
//    
//    A18,//B相电压最小值发生时间
//    
//    
//    A7,//C相电压最大值
//    
//    A18,//C相电压最大值发生时间
//    
//    A7,//C相电压最小值
//    
//    A18,//C相电压最小值发生时间
//    
//    A7,//A相平均电压
//    
//    A7,//B相平均电压
//    
//    A7,//C相平均电压
//    
//    
//    
//    A25,//A相电压越上限率
//    
//    A25,//A相电压越下限率
//    
//    A25,//A相电压合格率
//    
//    A25,//B相电压越上限率
//    
//    A25,//B相电压越下限率
//    
//    A25,//B相电压合格率
//    
//    
//    A25,//C相电压越上限率
//    
//    A25,//C相电压越下限率
//    
//    A25,//C相电压合格率
//    
//    //日冻结日不平衡度越限累计时间 发生时间不相同
//    BIN2_30,//电流不平衡度越限月累计时间
//    
//    BIN2_30,//电压不平衡度越限月累计时间
//    
//    A5,//电流不平衡最大值
//    
//    A18,//电流不平衡最大值发生时间
//    
//    A5,//电压不平衡最大值
//    
//    A18,//电压不平衡最大值发生时间
//    
//    
//    
//    BIN2_30,//A相电流越上上限月累计时间
//    
//    BIN2_30,//A相电流越上限月累计时间
//    
//    BIN2_30,//B相电流越上上限月累计时间
//    
//    BIN2_30,//B相电流越上限月累计时间
//    
//    BIN2_30,//C相电流越上上限月累计时间
//    
//    BIN2_30,//C相电流越上限月累计时间
//    
//    BIN2_30,//零序电流越上限月累计时间
//    
//    
//    
//    
//    A25,//A相电流最大值
//    
//    A18,//A相电流最大值发生时间
//    
//    A25,//B相电流最大值
//    
//    A18,//B相电流最大值发生时间
//    
//    A25,//C相电流最大值
//    
//    A18,//C相电流最大值发生时间
//    
//    A25,//零序电流最大值
//    
//    A18,//零序电流最大值发生时间
//    
//    
//    
//    BIN2_30,//视在功率越上上限日累计时间
//    
//    BIN2_30,//视在功率越上限日累计时间
//    
//    
//    
//    BIN2_30,//区段1累计时间（功率因数＜定值1）
//    
//    BIN2_30,//区段2累计时间（定值1≤功率因数＜定值2）
//    
//    BIN2_30,//区段3累计时间（功率因数≥定值2）
//    
//    A23,//三相总最大有功功率
//    
//    A18,//三相总最大有功功率发生时间
//    
//    A23,//A相最大有功功率
//    
//    A18,//A相最大有功功率发生时间
//    
//    A23,//B相最大有功功率
//    
//    A18,//B相最大有功功率发生时间
//    
//    A23,//C相最大有功功率
//    
//    A18,//C相最大有功功率发生时间
//    
//    
//    BIN2_30,//三相总有功功率为零时间
//    
//    BIN2_30,//A相有功功率为零时间
//    
//    BIN2_30,//B相有功功率为零时间
//    
//    BIN2_30,//C相有功功率为零时间
//    
//    
//};
//
//
//
////历史数据测量点月统计数据
//const int measure_month_sta[]=
//{
//    
//    A21,//月数据时标
//    
//    BIN2_30,//A相电压越上上限月累计时间
//    
//    BIN2_30,//A相电压越下下限月累计时间
//    
//    BIN2_30,//A相电压越上限月累计时间
//    
//    BIN2_30,//A相电压越下限月累计时间
//    
//    BIN2_30,//A相电压合格月累计时间
//    
//    
//    BIN2_30,//B相电压越上上限月累计时间
//    
//    BIN2_30,//B相电压越下下限月累计时间
//    
//    BIN2_30,//B相电压越上限月累计时间
//    
//    BIN2_30,//B相电压越下限月累计时间
//    
//    BIN2_30,//B相电压合格月累计时间
//    
//    
//    BIN2_30,//C相电压越上上限月累计时间
//    
//    BIN2_30,//C相电压越下下限月累计时间
//    
//    BIN2_30,//C相电压越上限月累计时间
//    
//    BIN2_30,//C相电压越下限月累计时间
//    
//    BIN2_30,//C相电压合格月累计时间
//    
//    
//    A7,//A相电压最大值
//    
//    A18,//A相电压最大值发生时间
//    
//    A7,//A相电压最小值
//    
//    A18,//A相电压最小值发生时间
//    
//    A7,//B相电压最大值
//    
//    A18,//B相电压最大值发生时间
//    
//    A7,//B相电压最小值
//    
//    A18,//B相电压最小值发生时间
//    
//    
//    A7,//C相电压最大值
//    
//    A18,//C相电压最大值发生时间
//    
//    A7,//C相电压最小值
//    
//    A18,//C相电压最小值发生时间
//    
//    A7,//A相平均电压
//    
//    A7,//B相平均电压
//    
//    A7,//C相平均电压
//    
//    
//    A25,//A相电压越上限率
//    
//    A25,//A相电压越下限率
//    
//    A25,//A相电压合格率
//    
//    A25,//B相电压越上限率
//    
//    A25,//B相电压越下限率
//    
//    A25,//B相电压合格率
//    
//    
//    A25,//C相电压越上限率
//    
//    A25,//C相电压越下限率
//    
//    A25,//C相电压合格率
//    
//    
//    BIN2_30,//电流不平衡度越限月累计时间
//    
//    BIN2_30,//电压不平衡度越限月累计时间
//    
//    A5,//电流不平衡最大值
//    
//    A17,//电流不平衡最大值发生时间
//    
//    A5,//电压不平衡最大值
//    
//    A17,//电压不平衡最大值发生时间
//    
//    
//    
//    BIN2_30,//A相电流越上上限月累计时间
//    
//    BIN2_30,//A相电流越上限月累计时间
//    
//    BIN2_30,//B相电流越上上限月累计时间
//    
//    BIN2_30,//B相电流越上限月累计时间
//    
//    BIN2_30,//C相电流越上上限月累计时间
//    
//    BIN2_30,//C相电流越上限月累计时间
//    
//    BIN2_30,//零序电流越上限月累计时间
//    
//    
//    
//    
//    A25,//A相电流最大值
//    
//    A18,//A相电流最大值发生时间
//    
//    A25,//B相电流最大值
//    
//    A18,//B相电流最大值发生时间
//    
//    A25,//C相电流最大值
//    
//    A18,//C相电流最大值发生时间
//    
//    A25,//零序电流最大值
//    
//    A18,//零序电流最大值发生时间
//    
//    
//    
//    BIN2_30,//视在功率越上上限月累计时间
//    
//    BIN2_30,//视在功率越上限月累计时间
//    
//    BIN2_30,//区段1累计时间（功率因数＜定值1）
//    
//    BIN2_30,//区段2累计时间（定值1≤功率因数＜定值2）
//    
//    BIN2_30,//区段3累计时间（功率因数≥定值2）
//    
//    A23,//三相总最大有功功率
//    
//    A18,//三相总最大有功功率发生时间
//    
//    A23,//A相最大有功功率
//    
//    A18,//A相最大有功功率发生时间
//    
//    A23,//B相最大有功功率
//    
//    A18,//B相最大有功功率发生时间
//    
//    A23,//C相最大有功功率
//    
//    A18,//C相最大有功功率发生时间
//    
//    BIN2_30,//三相总有功功率为零时间
//    
//    BIN2_30,//A相有功功率为零时间
//    
//    BIN2_30,//B相有功功率为零时间
//    
//    BIN2_30,//C相有功功率为零时间
//    
//};
//
//
//
//
//
//
//
//
////测量点日需量数据类型
//const int history_day_powerneeds[]=
//{
//    
//    A20, //日数据时标
//    
//    //正向有功最大需量
//    A23,//正向有功总最大需量
//    
//    A23,//费率1正向有功最大需量
//    
//    A23,//费率2正向有功最大需量
//    
//    A23,//费率3正向有功最大需量
//    
//    A23,//费率4正向有功最大需量
//    
//    
//    //正向有功最大需量发生时间
//    A17,//正向有功总最大需量发生时间
//    
//    A17,//费率1正向有功最大需量发生时间
//    
//    A17,//费率2正向有功最大需量发生时间
//    
//    A17,//费率3正向有功最大需量发生时间
//    
//    A17,//费率4正向有功最大需量发生时间
//    
//    
//    //正向无功最大需量
//    A23,//正向无功总最大需量
//    
//    A23,//费率1正向无功最大需量
//    
//    A23,//费率2正向无功最大需量
//    
//    A23,//费率3正向无功最大需量
//    
//    A23,//费率4正向无功最大需量
//    
//    
//    //正向无功最大需量发生时间
//    A17,//正向无功总最大需量发生时间
//    A17,//费率1正向无功最大需量发生时间
//    
//    A17,//费率2正向无功最大需量发生时间
//    
//    A17,//费率3正向无功最大需量发生时间
//    
//    A17,//费率4正向无功最大需量发生时间
//    
//    
//    //反向有功最大需量
//    A23,//反向有功总最大需量
//    
//    A23,//费率1反向有功最大需量
//    
//    A23,//费率2反向有功最大需量
//    
//    A23,//费率3发向有功最大需量
//    
//    A23,//费率4反向有功最大需量
//    
//    
//    //反向有功最大需量发生时间
//    A17,//反向有功总最大需量发生时间
//    
//    A17,//费率1反向有功最大需量发生时间
//    
//    A17,//费率2反向有功最大需量发生时间
//    
//    A17,//费率3反向有功最大需量发生时间
//    
//    A17,//费率4反向有功最大需量发生时间
//    
//    
//    //反向无功最大需量
//    A23,//反向无功总最大需量
//    A23,//费率1反向无功最大需量
//    
//    A23,//费率2反向无功最大需量
//    
//    A23,//费率3发向无功最大需量
//    
//    A23,//费率4反向无功最大需量
//    
//    
//    //反向无功最大需量发生时间
//    A17,//反向无功总最大需量发生时间
//    
//    A17,//费率1反向无功最大需量发生时间
//    
//    A17,//费率2反向无功最大需量发生时间
//    
//    A17,//费率3反向无功最大需量发生时间
//    
//    A17,//费率4反向无功最大需量发生时间
//    
//    
//    
//    
//    //三向总有功最大需量
//    A23,//三相总有功最大需量
//    
//    A18,//三相总有功最大需量发生时间
//    
//    A23,//A相有功最大需量
//    
//    A18,//A相有功最大需量发生时间
//    
//    A23,//B相有功最大需量
//    
//    A18,//B相有功最大需量发生时间
//    
//    A23,//C相有功最大需量
//    
//    A18,//C相有功最大需量发生时间
//    
//};
//
////测量点月需量数据类型
//const int history_month_powerneeds[]=
//{
//    A21, //月数据时标
//    
//    //正向有功最大需量
//    A23,//正向有功总最大需量
//    
//    A23,//费率1正向有功最大需量
//    
//    A23,//费率2正向有功最大需量
//    
//    A23,//费率3正向有功最大需量
//    
//    A23,//费率4正向有功最大需量
//    
//    
//    
//    //正向有功最大需量发生时间
//    A17,//正向有功总最大需量发生时间
//    
//    A17,//费率1正向有功最大需量发生时间
//    
//    A17,//费率2正向有功最大需量发生时间
//    
//    A17,//费率3正向有功最大需量发生时间
//    
//    A17,//费率4正向有功最大需量发生时间
//    
//    
//    
//    //正向无功最大需量
//    A23,//正向无功总最大需量
//    
//    A23,//费率1正向无功最大需量
//    
//    A23,//费率2正向无功最大需量
//    
//    A23,//费率3正向无功最大需量
//    
//    A23,//费率4正向无功最大需量
//    
//    
//    
//    //正向无功最大需量发生时间
//    A17,//正向无功总最大需量发生时间
//    
//    A17,//费率1正向无功最大需量发生时间
//    
//    A17,//费率2正向无功最大需量发生时间
//    
//    A17,//费率3正向无功最大需量发生时间
//    
//    A17,//费率4正向无功最大需量发生时间
//    
//    
//    
//    //反向有功最大需量
//    A23,//反向有功总最大需量
//    
//    A23,//费率1反向有功最大需量
//    
//    A23,//费率2反向有功最大需量
//    
//    A23,//费率3发向有功最大需量
//    
//    A23,//费率4反向有功最大需量
//    
//    
//    //反向有功最大需量发生时间
//    
//    A17,//反向有功总最大需量发生时间
//    
//    A17,//费率1反向有功最大需量发生时间
//    
//    A17,//费率2反向有功最大需量发生时间
//    
//    A17,//费率3反向有功最大需量发生时间
//    
//    A17,//费率4反向有功最大需量发生时间
//    
//    
//    
//    //反向无功最大需量
//    A23,//反向无功总最大需量
//    
//    A23,//费率1反向无功最大需量
//    
//    A23,//费率2反向无功最大需量
//    
//    A23,//费率3发向无功最大需量
//    
//    A23,//费率4反向无功最大需量
//    
//    
//    //反向无功最大需量发生时间
//    A17,//反向无功总最大需量发生时间
//    
//    A17,//费率1反向无功最大需量发生时间
//    
//    A17,//费率2反向无功最大需量发生时间
//    
//    A17,//费率3反向无功最大需量发生时间
//    
//    A17,//费率4反向无功最大需量发生时间
//    
//    
//    //三向总有功最大需量
//    A23,//三相总有功最大需量
//    
//    A18,//三相总有功最大需量发生时间
//    
//    A23,//A相有功最大需量
//    
//    A18,//A相有功最大需量发生时间
//    
//    A23,//B相有功最大需量
//    
//    A18,//B相有功最大需量发生时间
//    
//    A23,//C相有功最大需量
//    
//    A18,//C相有功最大需量发生时间
//    
//    
//};

const COMPLEX_ITEM eventlist[] = {
    {STRING_35,"描述"}
};

char* type_desc[] = {
    "终端日统计数据","终端月统计数据","测量点日电能需量"
};

#endif


